[
    {
        "title": "Customer Success Manager",
        "company": "Deel",
        "location": "South Korea",
        "description": "You’ll be the face and voice of Deel for our clients, both internally and externally. In this dynamic role, you’ll be responsible for building genuine and durable customer relationships while converting those relationships into opportunities for long-term revenue growth. You will serve as our client’s trusted advisor by providing strategic guidance on operational and product-related&amp;#8230;",
        "html_description": "<p>You’ll be the face and voice of Deel for our clients, both internally and externally. In this dynamic role, you’ll be responsible for building genuine and durable customer relationships while converting those relationships into opportunities for long-term revenue growth. You will serve as our client’s trusted advisor by providing strategic guidance on operational and product-related issues. Simultaneously, you will be an internal advocate for clients with Deel by championing new products and capabilities to facilitate the expansion of each client’s business with Deel.</p>\n<p>You are a passionate business builder at heart. You get energized by tackling complex, challenging, often ambiguous problems and driving real impact across a business. You are not afraid to get your hands dirty to deliver projects. You are a talented generalist at home, diving into data for insights, and confident in cross-functional project management with multiple stakeholders. Working with great people is a non-negotiable priority because you thrive in a highly collaborative, high-performance team. If that is you, join our team!</p>\n<h2><strong>Responsibilities </strong></h2>\n<ul>\n<li>Accounts: The CSM II will manage a diverse portfolio of SMB/MM or ENT accounts. This includes low to mid-sized spend accounts and accounts with strategic growth potential.</li>\n<li>Risk: Identify and flag risks that will lead to customer churn. Engage appropriate internal stakeholders to resolve the issue swiftly while managing customer communications along the way.</li>\n<li>Relationships: Build relationships with key stakeholders. Conduct regular business reviews.</li>\n<li>Product: Be the voice of the customer by collecting product and operational feedback and sharing it with relevant internal stakeholders</li>\n<li>Responsible for providing a high-quality experience to our customers on a day-to-day basis.</li>\n<li>Coordinate with internal stakeholders to ensure timely response and completion of customer requests.</li>\n<li>Drive adoption of platform features that will lead to a better customer experience and better retention.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>You have a minimum of 4+ years of relevant work experience, including client-facing experience</li>\n<li>Have previous experience in at least one of the following: fast-growth startup, top-tier management consulting, investment banking, or private equity</li>\n<li>A relationship builder who remains calm and collected when facing crisis or criticism and celebrates partners’ successes with them</li>\n<li>Quantitatively-inclined and data savvy, you may not be a SQL expert, but you enjoy drawing quick, insightful conclusions from complex data sets, asking critical questions, and synthesizing raw numbers into simple, actionable recommendations</li>\n<li>A reliable, motivated self-starter with a passionate growth mentality. You enjoy fast-paced environments, aren’t deterred by setbacks or pivots, and thrive in roles requiring a very high degree of responsibility</li>\n<li>Have a solid track record of achievement &#8211; e.g., had success in a top-tier company, delivered quantifiable business impact, quickly assumed responsibilities, or won competitive awards</li>\n<li>Have a strong analytical foundation with the ability to manipulate and synthesize data</li>\n<li>Are curious by nature and interested in making an impact</li>\n<li>Proficiency in English and Native Korean language.</li>\n</ul>\n<h2><strong>Total Rewards</strong></h2>\n<p>Our workforce deserves fair and competitive pay that meets them where they are. With scalable benefits, rewards, and perks, our total rewards programs reflect our commitment to inclusivity and access for all.</p>\n<h2><strong>Some things you’ll enjoy</strong></h2>\n<ul>\n<li>Stock grant opportunities dependent on your role, employment status and location</li>\n<li>Additional perks and benefits based on your employment status and country</li>\n<li>The flexibility of remote work, including optional WeWork access</li>\n</ul>\n<p>At Deel, we’re an equal-opportunity employer that values diversity and positively encourage applications from suitably qualified and eligible candidates regardless of  race, religion, sex, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, pregnancy or maternity or other applicable legally protected characteristics.</p>\n<p>Deel is an equal-opportunity employer and is committed to cultivating a diverse and inclusive workplace that reflects different abilities, backgrounds, beliefs, experiences, identities and perspectives.</p>\n<p>Deel will provide accommodation on request throughout the recruitment, selection and assessment process for applicants with disabilities. If you require accommodation, please inform our Talent Acquisition Team at recruiting[at]deel.com of the nature of the accommodation that you may require, to ensure your equal participation.</p>\n<p>We use Covey as part of our hiring and/or promotional processes. As part of the evaluation process, we provide Covey with job requirements and candidate-submitted applications. Certain features of the platform may qualify it as an Automated Employment Decision Tool (AEDT) under applicable regulations. For positions in New York City, our use of Covey complies with NYC Local Law 144.</p>",
        "url": "https://jobicy.com/jobs/117052-customer-success-manager-24",
        "source": "Jobicy",
        "posted_at": "2025-04-22 12:39:22",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/282df8b52b60f8a324714ffa21cb4ed5.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Digital Sales Representative",
        "company": "Ferguson Enterprises",
        "location": "USA",
        "description": "We have job openings in our Inbound Phone Divisions! As a Digital Sales Representative, your job will be taking care of the customer &amp;#8211; “be the hero” as we say here at Build.com. You will be held accountable for your call/chat quality and performance metrics within service. We expect each and every sales representative to&amp;#8230;",
        "html_description": "<p>We have job openings in our Inbound Phone Divisions! As a <b>Digital Sales Representative</b>, your job will be taking care of the customer &#8211; “be the hero” as we say here at Build.com. You will be held accountable for your call/chat quality and performance metrics within service. We expect each and every sales representative to be present, invested, and committed to the overall customer experience. The ideal candidate will exhibit superb relationship-building and problem-solving skills while providing outstanding service through sales. An outstanding sales representative will focus on enhancing opportunities within every call to drive revenue and overall company growth. If you identify with any of these qualities, keep reading as we want you to join our team! This role is approved to be either Remote within the United States or Hybrid for associate in Chico, CA, in accordance with company policy.</p>\n<p><b>We are open 7 days a week 5am-6pm (M-F) 6am-4pm (SA &amp; SU) and you will be scheduled a shift within those hours of operation (Pacific Time).</b></p>\n<p><b>Weekend shifts are required and will be determined each quarter based on individual performance metrics.</b></p>\n<h2><b>Responsibilities:</b></h2>\n<ul>\n<li>Responsible for handling inbound call/chat volume, with expectations of taking between 40-50 inbound customer calls/chats per 8 hour. work day.</li>\n<li>Complete all Brand Sales Trainings (BST) each month.</li>\n<li>85% schedule adherence to assigned schedule as referenced in Genesys phone system.</li>\n<li>Responsible for maintaining excellent customer service standards through call quality, problem solving, ownership over any customer issue, and going above &amp; beyond to address all needs.</li>\n<li>Maintaining customer records by logging and retaining correct and precise information in Salesforce.com.</li>\n<li>During workflow identify website, process, product page, post call related inefficiencies or bugs and report if necessary.</li>\n<li>Work with a team of 15-20 other sales people.</li>\n<li>Success will be measured through call quality, and profit dollars generated monthly.</li>\n<li>Demonstrate strong verbal communication skills with the ability to engage guests.</li>\n<li>All BST’s must be completed to be eligible for promotions.</li>\n</ul>\n<h2><b>Qualifications:</b></h2>\n<ul>\n<li>High School diploma or equivalent.</li>\n<li>2+ years of experience in a customer facing, fast paced, service related role highly preferred.</li>\n<li>3+ years of Sales experience preferred.</li>\n<li>Be highly detail oriented and have superior interpersonal skills.</li>\n<li>Proven experience using critical thinking tools to solve customer issues.</li>\n<li>Self-motivated, great teammate, and fast learner.</li>\n<li>Systematic and adaptable approach.</li>\n<li>Strong understanding of Microsoft Excel.</li>\n<li>Familiarity with the Microsoft Office and Google Office suites.</li>\n<li><b>Ability to type 40+ WPM for phone and 45+ WPM for chat.</b></li>\n<li>Strong organizational skills.</li>\n<li>Reliable and consistent internet connection.</li>\n</ul>\n<p>At Ferguson, we care for each other. We value our well-being just as much as our hard work. We are committed to a holistic approach towards benefits plans and programs that support the mental, physical and financial well-being of our associates. Our competitive offering not only includes benefits like health, dental, vision, paid time off, life insurance and a 401(k) with a company match, but our associates also enjoy additional meaningful and inclusive enhancements that are adaptable to their diverse situations and needs, including mental health coverage, gender affirming and family building benefits, paid parental leave, associate discounts, community involvement opportunities and more!</p>\n<p><b>Pay Range:</b></p>\n<p><i>Actual pay rate may vary depending upon location. The estimated pay range for this position is below. The specific rate will depend on a candidate’s qualifications and prior experience.</i></p>\n<p>$21.46 &#8211; $34.36</p>\n<p><b><i>Estimated Ranges displayed are Monthly for Salaried roles </i><u>OR</u><i> Hourly for all other roles.</i></b></p>\n<p>This role is Bonus or Incentive Plan eligible.</p>\n<p>Ferguson complies with all wage regulations. The starting wage may be higher in certain locations based on local or state wage requirements.</p>\n<p><i>The Company is an equal opportunity employer as well as a government contractor that shall abide by the requirements of 41 CFR 60-300.5(a), which prohibits discrimination against qualified protected Veterans and the requirements of 41 CFR 60-741.5(A), which prohibits discrimination against qualified individuals on the basis of disability.</i></p>\n<p><i>Ferguson Enterprises, LLC. is an equal employment employer F/M/Disability/Vet/Sexual Orientation/Gender Identity.</i></p>",
        "url": "https://jobicy.com/jobs/117045-digital-sales-representative-2",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:41:41",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/e6ea0b3f88e22276c807f9f50199057b.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Staff Software Engineer",
        "company": "Copy.ai",
        "location": "USA",
        "description": "We have solid traction but are still a young company. This role is what you make of it, and your teammates and colleagues will help you every step of the way. You’ll look back on your time at Copy.ai and view it as the most impactful and highest growth phase of your career. There’s a&amp;#8230;",
        "html_description": "<p>We have solid traction but are still a young company. This role is what you make of it, and your teammates and colleagues will help you every step of the way. You’ll look back on your time at Copy.ai and view it as the most impactful and highest growth phase of your career. There’s a lot to take on, but we trust that you’re up to the challenge.</p>\n<p>Copy.ai is a fully remote company. All employees must be able to work 9am-5pm in their timezone, Pacific to Eastern.</p>\n<p>We’re looking for a Staff Engineer to build the interface for every day people to interact with generative AI — we believe it’s an opportunity to do career-defining work. You will build the user interface and backend for the latest machine learning technology. Reporting to the Head of Engineering, your primary role will be building our SaaS web application. You will also work on other growth initiatives and products from time to time.</p>\n<h2>What you&#8217;ll do:</h2>\n<ul>\n<li>Contribute to all stages of the software development lifecycle.</li>\n<li>Utilize and contribute to our continuous integration and continuous delivery pipelines.</li>\n<li>Write well-designed, testable, and efficient code with quick turnaround times and ownership/accountability</li>\n<li>Create and maintain processes, policies, documents, and the implementation of underlying systems and technologies for application sustainment, security, and privacy</li>\n<li>Establish and support patterns and architectures for our front-end, backend, future applications, and our multi-and-single-tenant instances across cloud providers/platforms</li>\n</ul>\n<h2>About you:</h2>\n<ul>\n<li>10+ years of both backend and frontend software engineering experience</li>\n<li>Prior experience as a Staff or Principal Engineer or similar role</li>\n<li>Experience with SaaS, marketing tools, creator tools, and/or machine learning products is a plus</li>\n<li>Experience with the entire product development lifecycle, including early-stage</li>\n<li>Proficiency in ReactJS/NextJS/Typescript/NodeJS</li>\n<li>Previous experience at rapidly scaling SaaS startups</li>\n<li>Bonus if you&#8217;re based in the San Francisco Bay Area</li>\n</ul>\n<p>Copy.ai is an Equal Opportunity Employer. We’re committed to building a diverse and inclusive team. We encourage applications from people of all races, religions, national origins, genders, sexual orientations, gender identities, gender expressions and ages, as well as veterans and individuals with disabilities.</p>\n<h2>What We Offer:</h2>\n<ul>\n<li> A close-knit and collaborative early-stage startup environment where every voice is heard and every opinion matters; 50 team members as of 11/2024</li>\n<li> Competitive salary and stock option equity packages; We&#8217;re a Series A startup</li>\n<li>  Excellent Medical Plans to choose from including HSA plans, PPOs, and HMOs from Kaiser and Aetna; Dental and Vision insurance through Guardian; Copy.ai pays up to $800/month per employee for monthly premiums</li>\n<li> 100% REMOTE startup! Our team is distributed all over the US and Canada</li>\n<li>UNLIMITED PTO; We truly believe in work-life balance and that hard work should be balanced with time for rest and rejuvenation</li>\n<li> 401k plan and automatic 3% employer contribution from Day 1!!!!</li>\n<li> Brand new work-sponsored computer</li>\n<li>  IRL / In-Person retreats throughout the year</li>\n</ul>",
        "url": "https://jobicy.com/jobs/114068-staff-engineer-2",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:39:03",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/03/5fb63579fc981698f97d55bfecb213ea.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Mental Health Therapist - Telehealth",
        "company": "Lyra Health",
        "location": "USA",
        "description": "Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With&amp;#8230;",
        "html_description": "<p>Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With our innovative digital care platform and global provider network, 10 million people can receive the best care and feel better, faster. Founded by David Ebersman, former CFO of Facebook and Genentech, Lyra has raised more than $900 million in funding to support our mission of improving access to high quality mental healthcare.</p>\n<p><b>FURTHER EXPANDING ACCESS</b>: We are currently prioritizing hiring clinicians, counselors, mental health providers, psychologists, and therapists in Oregon, Tennessee, Massachusetts, Maryland, Indiana, Arizona, Kansas and Wisconsin.</p>\n<p>We will continue to welcome applications from all other states, and sponsor cross-licensure across selected states to ensure clinicians are set up for success to support caseload goals. As always, thank you for your continued interest in Lyra Health!</p>\n<h2><b>About the Role:</b></h2>\n<p>Lyra developed an innovative video therapy program called Lyra Care Therapy: blending live video sessions with between-session digital psychoeducation and customizable skill building tools. With this program, you’ll have the resources and support you need to ensure that your clients get better—all while improving access to mental health care from your home or preferred setting.</p>\n<p><b>Daily:</b> As a Lyra Care Therapist, you’ll provide short-term, evidence-based treatment via live video. You’ll assign digital lessons, videos, and assessments to your clients to enhance learnings and monitor outcomes between sessions. <b>An important note: </b>Lyra&#8217;s clients come from a multitude of different backgrounds and experiences, and have varying needs and abilities. We strive to continue to meet their unique needs by delivering culturally responsive care—an approach that accounts for the impact of cultural backgrounds on each person’s care experience.</p>\n<p><b>Regularly:</b> Our therapists enjoy connecting with their peers, who share a passion for providing evidence-based care. You’ll attend one-on-one and peer group clinical consultation meetings, conduct peer-based quality assurance reviews, and attend robust training to enhance your clinical skills. You always have a team behind you if a crisis comes up. You’re never alone, even while working remotely within the U.S.</p>\n<p><b>This role is a great fit</b> if you&#8217;re a licensed clinician with excellent interpersonal skills, who wants continuous growth and development in their professional career, and thrives in a feedback rich environment. If you&#8217;re comfortable with evolving processes and excited by a rapidly growing business, then this role is for you!</p>\n<h2>Requirements:</h2>\n<ul>\n<li>Master’s degree from a clinical track (e.g., MSW, MFT, MC, MMHC)</li>\n<li><b>Unrestricted LCSW, LMFT, LPC, PsyD, PhD, or equivalent license (i.e., able to work independently, without supervision from a licensed supervisor) without current, past, or pending disciplinary action</b></li>\n<li>Experience and commitment to providing evidence-based treatments (e.g., ACT, CBT, CPT, DBT) and clinical best practices (e.g., measurement based care, promoting skills practice)</li>\n<li>Experience providing video therapy</li>\n<li>Experience maintaining a full clinical caseload of adult and/or adolescent clients/week</li>\n<li>Access to a stable and reliable internet connection is necessary to perform all work activities</li>\n<li>Ability to work full-time, approximately 40 hours per week</li>\n<li>Full-time resident of the United States</li>\n</ul>\n<p>As a full-time Licensed Mental Health Therapist, you will be employed by Lyra Clinical Associates P.C. We manage the business operations so you can focus on providing high-quality mental health care.</p>\n<h2>Here are just some of our perks and benefits:</h2>\n<ul>\n<li>Competitive compensation for your session work and administrative work</li>\n<li>Comprehensive healthcare coverage (including medical, dental, and vision, FSA/HSA life and disability insurance)</li>\n<li>Lyra for Lyrians; coaching and therapy services</li>\n<li>Flexible scheduling to set your own availability for full-time hours/week</li>\n<li>Competitive time off with pay policies, including 4 weeks vacation, sick days, and company holidays</li>\n<li>Paid Parental Leave</li>\n<li>401K</li>\n<li>Retirement benefits</li>\n<li>Equity in the company through discretionary restricted stock units</li>\n<li>Free live and recorded webinars with CE approval from APA, ASWB, and NBCC</li>\n<li>Malpractice liability insurance policy</li>\n<li>Licensure renewal reimbursement—up to 5 state licenses</li>\n<li>Opportunity for cross-licensure sponsorship and support, if eligible</li>\n<li>A caseload of motivated clients from diverse industries and backgrounds</li>\n<li>A new Chromebook, dedicated business support from Operations, HR, and IT professionals, and  a monthly technology stipend</li>\n<li>We like to spread joy throughout the year with well-being perks and activities, surprise swag, regular community celebration…and more!</li>\n</ul>\n<p>The anticipated starting base salary range for a full-time Licensed Mental Health Therapist at Lyra is between $62,000 &#8211; $84,000 annually. The base salary is determined by role, and placement within the range and will depend on a number of job-related factors, including but not limited to your skills, qualifications and location.</p>\n<p><b>At Lyra, base salary is only one aspect of an employee&#8217;s total compensation package, which may additionally include annual variable performance-based compensation earnings of on average $23,000</b>, discretionary restricted stock unit awards, comprehensive healthcare coverage, retirement benefits and time off with pay. The role may also be eligible for a discretionary bonus.</p>",
        "url": "https://jobicy.com/jobs/102988-mental-health-therapist-telehealth",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:38:52",
        "salary": "USD 62,000 - 84,000",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/1594f6d9649b131ca2414928bd60caac.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Product Designer, Design Systems",
        "company": "Stripe",
        "location": "Canada",
        "description": "Our Design Systems team is responsible for design systems and user experiences across various products, including the Stripe Dashboard, internal tools, and external developer resources. You&amp;#8217;ll collaborate with other designers and managers on a broad range of design challenges, as we strive to create user-friendly experiences for our audience of product builders. What you’ll do&amp;#8230;",
        "html_description": "<p>Our Design Systems team is responsible for design systems and user experiences across various products, including the Stripe Dashboard, internal tools, and external developer resources. You&#8217;ll collaborate with other designers and managers on a broad range of design challenges, as we strive to create user-friendly experiences for our audience of product builders.</p>\n<h2>What you’ll do</h2>\n<p>We’re looking for an experienced product designer to design UI components, patterns, and tools that enable designers and engineers at Stripe to create consistent, high quality user experiences. This includes working on Sail, the design system and component library that all of Stripe’s products are built on.</p>\n<p>As a product designer on the team, you’ll work at the intersection of design and engineering, driving both decisions that directly impact the design and code quality of Stripe products. You’ll be asked to collaborate with designers and product teams from across the company to design systems, components, and tools that raise the quality and consistency of Stripe product experiences.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Design reusable components and patterns that align with Stripe’s design principles.</li>\n<li>Prototype components and reusable end-to-end experiences, contribute to design system repositories, and support engineering efforts.</li>\n<li>Create and maintain clear, comprehensive documentation to enable teams across the organization to adopt and extend the design system effectively.</li>\n<li>Create and maintain shared UI libraries, patterns, and templates in Figma.</li>\n<li>Facilitate training sessions to educate and onboard teams on using the design system.</li>\n<li>Advocate for accessibility in all aspects of the design system</li>\n</ul>\n<h2>Who you are</h2>\n<p>We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.</p>\n<h2>Minimum Requirements</h2>\n<ul>\n<li>4+ years relevant design experience at a product-driven tech company.</li>\n<li>Strong skills in visual design, interaction design, and prototyping demonstrated through a portfolio of work, spanning desktop and mobile surfaces.</li>\n<li>Experience collaborating closely with engineering teams.</li>\n<li>Experience leading changes to a design system.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience working on design systems at scale, including creating and managing shared libraries, templates, and tokens in Figma.</li>\n<li>Proficiency in coding for UI prototyping and contribution to front-end implementation (e.g. HTML, CSS, or React).</li>\n<li>Understanding of accessibility standards (e.g. WCAG).</li>\n<li>Familiarity with design tokens, version control systems (e.g. GIT), and tools for maintaining design system documentation.</li>\n<li>Excellent communication and collaboration skills, with the ability to articulate design decisions and system concepts to diverse stakeholders.</li>\n<li>Passion for mentoring and educating teams on leveraging design systems to improve workflow efficiency and consistency.</li>\n</ul>\n<p>This role is available either in an office or a remote location (typically, 35+ miles or 56+ km from a Stripe office).</p>\n<p>Office-assigned Stripes spend at least 50% of the time in a given month in their local office or with users. This hits a balance between bringing people together for in-person collaboration and learning from each other, while supporting flexibility about how to do this in a way that makes sense for individuals and their teams.</p>\n<p>A remote location, in most cases, is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on-sites, meet-ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently or plan to live.</p>\n<header>\n<h2>Pay and benefits</h2>\n</header>\n<p>The annual salary range for this role in the primary location is C$150,900 &#8211; C$226,300. This range may change if you are hired in another location. For sales roles, the range provided is the role’s On Target Earnings (“OTE”) range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and specific location. Applicants interested in this role and who are not located in the primary location may request the annual salary range for their location during the interview process.</p>\n<p>Specific benefits and details about what compensation is included in the salary range listed above will vary depending on the applicant’s location and can be discussed in more detail during the interview process. Benefits/additional compensation for this role may include: equity, company bonus or sales commissions/bonuses; retirement plans; health benefits; and wellness stipends.</p>",
        "url": "https://jobicy.com/jobs/106463-brand-designer",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:37:52",
        "salary": "CAD 150,900 - 226,300",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201011073943-272457.png",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Research Engineer",
        "company": "Chainlink Labs",
        "location": "Anywhere",
        "description": "Chainlink Labs is seeking Research Engineers to support its mission of building the world’s most secure and flexible decentralized oracle technologies. Research Engineers will work directly with top domain experts in applied cryptography, mechanism design (crypto economics), distributed systems, and other disciplines to identify and solve key research challenges and build production solutions that keep Chainlink at&amp;#8230;",
        "html_description": "<p>Chainlink Labs is seeking Research Engineers to support its mission of building the world’s most secure and flexible decentralized oracle technologies. Research Engineers will work directly with top domain experts in applied cryptography, mechanism design (crypto economics), distributed systems, and other disciplines to identify and solve key research challenges and build production solutions that keep Chainlink at the forefront of oracle system deployment and fuel the success of the smart contract ecosystem.</p>\n<h2><strong>Your Impact:</strong></h2>\n<ul>\n<li>Working with Chainlink core engineering to identify short- and long-term research challenges critical to the company’s success and to transition innovations from Chainlink Labs into production.</li>\n<li>Working with research scientists and technical advisors to study, invent, and build cutting-edge oracle technologies for the benefit of the company and community.</li>\n<li>Staying abreast of the evolution of relevant technology ecosystems and participating in relevant technical communities for more effective application development and to guide research toward practical and impactful work.</li>\n</ul>\n<h2><strong>Required Qualifications:</strong></h2>\n<ul>\n<li>B.S. in computer science or equivalent professional experience along with coursework in algorithms and data structures and discrete math.</li>\n<li>Familiarity with academic process and ability to engage with existing literature on relevant research topics, e.g. by performing literature searches and comprehending papers in a wider context.</li>\n<li>Professional software development experience is required.</li>\n</ul>\n<h2><strong>Preferred Qualifications:</strong></h2>\n<ul>\n<li>Advanced computer science or related degree, coursework in applied and theoretical cryptography, mechanism design, distributed systems, or related fields.</li>\n<li>Familiarity with Go or Rust.</li>\n<li>Broad knowledge of blockchain technologies and familiarity specifically with smart contracts.</li>\n</ul>\n<h2><strong>Our Stack:</strong></h2>\n<ul>\n<li>We use Go, Typescript, Solidity, Python, LATEX, git, and Linux/Unix.</li>\n</ul>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).</em></p>\n<h2><strong>Commitment to Equal Opportunity:</strong></h2>\n<p>Chainlink Labs is an equal opportunity employer. All qualified applicants will receive equal consideration for employment in compliance with applicable laws, regulations, or ordinances.</p>",
        "url": "https://jobicy.com/jobs/73899-research-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:36:06",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Copywriter, Health",
        "company": "WebFX",
        "location": "APAC",
        "description": "For 9 years in a row, WebFX has been named the #1 Best Place to Work in Pennsylvania, which is our headquarters’ home state! As a company, we pride ourselves on being able to offer the same culture and benefits to our global team members. In addition to very competitive base pay, we offer company&amp;#8230;",
        "html_description": "<p>For 9 years in a row, WebFX has been named the #1 Best Place to Work in Pennsylvania, which is our headquarters’ home state! As a company, we pride ourselves on being able to offer the same culture and benefits to our global team members. In addition to very competitive base pay, we offer company profit-sharing, performance bonuses, and health insurance (including dental, vision, remote doctor, etc.). To aid in your success, we provide world-class digital marketing training (Organic SEO, Local SEO, PPC, Google Analytics + Studio, etc.), long-term career track opportunities, and ongoing learning bonuses (yes, you can get paid to learn!), along with numerous other benefits!</p>\n<h2><b>Read below to learn about some of the benefits you can expect when working with WebFX</b></h2>\n<ul>\n<li>No matter where you are located or your position, WebFX offers long-term stability to all of our FXFamily members. In fact, many of our global/remote team members have been with WebFX for 10+ years, and we’re hoping you can be too! </li>\n<li>We put our people first. It’s as simple as that. You’re never on your own &#8211; when you run into inevitable challenges, we’re there to support you along the way!</li>\n<li>Long-lasting relationships with clients and team members due to consistently low turnover rates that are simply unheard of in our industry because, again, we put our people first.</li>\n<li>When you join WebFX, you don’t just join a company; you join a community! We value all of our team members the same, regardless of their position or where they call home. We truly look forward to learning about you and your background, and we will be there to celebrate the milestones in your life together, no matter how big or small! </li>\n<li>Save your time and money by skipping the commute to an office. This role allows you to work from the comfort of your home! </li>\n<li>Fully equipped in-home office setup including computer, dual large monitors, headset, and more to ensure you have all you need to work from home! ️</li>\n<li>Be part of a rapidly growing company that, at the same time, only partners with clients who share our values</li>\n<li>Merit-based promotional structure</li>\n<li>Annual merit-based compensation increases! </li>\n<li>We are committed to giving back globally &#8211; in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals &#8211; since 2014, we’ve committed to donating globally through our FXBuilds program.</li>\n</ul>\n<h2>What You&#8217;ll Get</h2>\n<p>World-Class Training and Ongoing Career Development</p>\n<ul>\n<li>No matter your level of experience, our “Bootcamp” web marketing training program is provided for all new WebFX “family members” to learn, grow, and develop in and out of the office with the hard skills necessary to be successful in their position.</li>\n<li>From training with our Sr Digital Marketers to access to countless industry-leading online training resources/courses/tutorials to getting experience with nearly 1,500+ different clients with various platforms, digital services, and in every industry you can think of (and then some), our training program is simply unrivaled!</li>\n<li>Training doesn’t stop after your initial training period; we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental training, industry-related updates, and more!</li>\n<li>FXLearns program – where you get incentives for taking advantage of our countless industry training resources</li>\n<li>After 1,500+ clients, we’ve been able to truly master our processes and procedures – you will be trained on all of those &#8211; no need to develop how to do things (unless you want to help us continually improve that process!) – because we refuse to ever stagnate, we are always pushing the envelope to make those processes 1% better too!</li>\n</ul>\n<h2>Opportunities for Growth</h2>\n<p>WebFX grew 250%+ over the past 3 years both locally and globally, and merit-based promotional opportunities are abundant if you&#8217;re meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands. And what’s more, you’re not expected to know it all &#8211; we believe in continually striving to be an expert in your subject matter of expertise – so while we will purposely challenge you to grow in SEO/PPC/Google Analytics, we are a full-service agency that has experts in other departments that handle everything else &#8211; from link building, social media, web design, and web development. So you can truly master your trade.</p>\n<h2>What We&#8217;re Looking For</h2>\n<p>The worlds of health and healthcare are incredibly nuanced – and the stakes are high for ensuring online health content is expertly researched, accurate, and falls in line with industry best practices and compliance requirements. At WebFX, we’re looking for a talented, research-minded writer who’s excited to explore the worlds of health and healthcare in their work. Someone passionate about covering everything from dental services to botox treatments, from mental health to rehabilitation clinics, and from hospital systems to health management and consulting.</p>\n<p>We want you to be driven by a love for knowledge in the healthcare and overall health spaces and have a knack for asking the right questions to fuel your research. Whatever the topic, you are experienced in reading and parsing professional/academic research, authoritative sources, and data sets. Yet, in your writing, you also know how to translate that information into copy that’s user-friendly and in line with a client’s specific voice and style.</p>\n<p>We’re looking for someone who’s excited by the idea of diving deep into topics in this industry and helping drive results with the copy you write. If this sounds like you, get in touch!</p>\n<h2><b>Desired Skills</b></h2>\n<ul>\n<li>Backgrounds spanning any and all industries- Preference given to digital and B2B experience</li>\n<li>Exceptional communication skills</li>\n<li>Fulltime 40 hours of remote availability per week</li>\n<li>Extreme care of content to capture the voice and style of our clients</li>\n<li>Please submit your resume or CV (in English) to be considered for this opportunity</li>\n<li>18+ months of professional writing experience</li>\n</ul>\n<h2>What You&#8217;ll Do</h2>\n<p><b>Responsibilities</b></p>\n<ul>\n<li>If you’re seeking a long-term partnership, we’d love to hear from you.</li>\n<li>Write and self-edit an array of content types, from blog posts to sales copy to long-form content, etc.</li>\n<li>Work with over 1,000+ different publishers on the web/in the media, ranging from entertainment and lifestyle to industry-specific opportunities</li>\n<li>Find flexibility in a 40-hour/week independent contractor position as you tackle assignments from the comfort of your home.</li>\n</ul>\n<p><b>Training: </b>Our “Bootcamp” web marketing training program will be provided for new WebFX “family members” to learn, grow, and develop in and out of the office with the hard skills necessary to be successful in their positions.</p>\n<p>State-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and monthly Lunch-and-Learns.</p>\n<p><b>Opportunities for Growth: </b>WebFX grew 250%+ over the past 3 years, and merit-based promotional opportunities are abundant for new family members who meet or exceed position performance metrics.</p>\n<h2>What You&#8217;ll Get</h2>\n<p><b>Grow in Your Career:</b> Each of our partners benefits from our world-class training program. As part of our mission, we commit to helping our team and partners stay on the leading edge of the industry. We achieve this through ongoing training programs, incentives for learning, and more.</p>\n<p><b>Longevity:</b> Current team members in this position have been in the role for over 10 years.</p>\n<p><b>Make a Difference:</b> WebFX strives to not only improve the lives of our clients and everyone who works for them, but to make a tangible difference on a global level as well. Through #FXBuilds, our goal is to positively change the lives of 10,000 people by 2024. Your work will contribute to #FXBuilds by helping us reach client goals!</p>\n<p><b>Performance Bonuses: </b>Eligible for performance bonuses.</p>\n<p><b>Compensation: </b>Negotiable, based on experience</p>\n<p><strong>Working Hours: </strong>3:30 pm &#8211; 12 Midnight <u>your local time</u> (3:30 am &#8211; noon EDT, or 2:30 am &#8211; 11 am EST depending on the time of year). The half-hour break may be taken anytime between 6 pm &#8211; 8 pm local time.</p>\n<p><i>*You don&#8217;t need to apply more than once, even if you&#8217;re interested in multiple positions &#8211; you can simply let us know! We consider all open roles when reviewing resumes and applications!</i></p>",
        "url": "https://jobicy.com/jobs/9279-copywriter-21",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:31:59",
        "salary": "",
        "job_type": "contract, part-time",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/1dfcadbc6c3fe11bd30efd9231c348d2.png",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Expert Advisor, Health",
        "company": "WebFX",
        "location": "Anywhere",
        "description": "Hi there! We&amp;#8217;re WebFX, a full-service digital marketing agency based in the US. We&amp;#8217;ve been named the Best Place To Work in Pennsylvania 8 years in a row and we&amp;#8217;d love to meet you. We&amp;#8217;re looking for people to join our mission to provide world-class digital marketing solutions to mid-size businesses around the world. We&amp;#8230;",
        "html_description": "<p>Hi there! We&#8217;re WebFX, a full-service digital marketing agency based in the US. We&#8217;ve been named the Best Place To Work in Pennsylvania 8 years in a row and we&#8217;d love to meet you. We&#8217;re looking for people to join our mission to provide world-class digital marketing solutions to mid-size businesses around the world. We get super excited about driving business growth for our clients and are looking for people who take pride in their marketing work and enjoy having a little fun at the same time.</p>\n<h2><b>What We&#8217;re Looking For</b></h2>\n<h3><b>Do you have one of these desired skills, licenses or certifications?</b></h3>\n<ul>\n<li>Doctor of Medicine (M.D.)</li>\n<li>Doctor of Osteopathic Medicine (D.O.)</li>\n<li>Doctor of Pharmacy (Pharm.D.)</li>\n<li>Registered Nurse (R.N.)</li>\n<li>Nurse Practitioner (N.P.)</li>\n<li>Advanced Practice Nurse Practitioner (A.P.R.N.)</li>\n<li>Certified Nurse-Midwife (C.N.M.)</li>\n<li>Certified Nurse Practitioner (C.N.P./N.P.C./N.P.B.C.)</li>\n<li>Certified Registered Nurse Anesthetist (C.R.N.A.)</li>\n<li>Doctor of Nursing Practice (D.N.P.)</li>\n<li>Licensed Practical Nurse (L.P.N.)</li>\n<li>Physician Assistant (P.A.)</li>\n<li>Certified Physician Assistant (P.A.-C.)</li>\n<li>Master’s degree or higher in fields like nursing, medicine and pharmacy</li>\n<li>Current professional certification with a relevant board in your field of practice</li>\n</ul>\n<h2><b>Here’s what else you’ll need for this position</b></h2>\n<p>Flexible scheduling — this position requires a minimum of 4 hours of remote availability per week.</p>\n<p>Thoughtful written communication practices and a knack for explaining complex concepts in an accessible manner.</p>\n<h2><b>What You&#8217;ll Do</b></h2>\n<p>Would you like a long-term freelance partnership?</p>\n<p>Are you looking for projects you can complete from the comfort of your current location?</p>\n<p>Does the flexibility of setting your own schedule and hours worked per week sound like a fit for you?</p>\n<h2><b>Responsibilities</b></h2>\n<p>As an experienced professional in your field, you’ll get to review a variety of interesting content projects to verify industry accuracy. You will:</p>\n<ul>\n<li>Review content for correctness. Is the information in a project true for your industry?</li>\n<li>Identify sections or points in copy that need clarification. Can a concept be better explained, and how?</li>\n<li>Recommend and suggest changes that our top-notch team of writers and editors can implement within projects. What needs to change, and how, to ensure content is educational and factually accurate?</li>\n</ul>\n<p>Conveying factual health information can help people realize they may need a medical provider. The scientific, health-focused content you’ll review is meant to be educational — and help people seek out a medical provider who can assess their potential needs. Alongside these projects, you&#8217;ll also likely see content discussing surgical procedures, provider-side concerns, billing, insurance, medical equipment, biomedical research, technology platforms, and legal changes and challenges in this field.</p>\n<h2><b>Location</b></h2>\n<p>This position is fully remote! Work from anywhere as long as you have a great internet connection and a comfortable workspace.</p>\n<h2><b>Time commitment</b></h2>\n<p>How much time can you commit per week? We&#8217;re looking for someone who can confidently commit at least ~4 hours per week — and if our client demand expands, increase to as much as ~15 hours per week.</p>\n<p>Our project management team will align your workload based on your scheduling availability, which you’ll communicate to us each week. Here’s a review of the workflow:</p>\n<ul>\n<li>Projects should be accepted or declined within 48 hours of receiving them.</li>\n<li>After 48 hours with no response, they will be removed from your queue.</li>\n<li>If you accept the project, you will have 48 hours from the day of acceptance to complete your project review.</li>\n</ul>\n<h2><b>What You&#8217;ll Get</b></h2>\n<p><b>Longevity:</b> We love working with committed team members! Current team members in this position have been in the role for over 10 years.</p>\n<p><b>Competitive Flexible Schedule: </b>As an independent contractor, you get to choose your optimal work schedule and have the convenience of working from home.</p>\n<p><b>Compensation:</b> Hourly rates from $40 to $150 per hour. Compensation depends on certifications, education and work experience.</p>\n<p><b>Make a Difference: </b>WebFX strives to not only improve the lives of our clients and everyone who works for them, but to make a tangible difference on a global level as well. Through #FXBuilds, our goal is to positively change the lives of 10,000 people by 2024. Your work will contribute to #FXBuilds by helping us reach client goals!</p>\n<p><b>Please note: Expert Advisor position openings are based on project demand. If you do not hear from a recruiter within one month of submitting your application, the position may have been filled. Please know that your information is kept on file and you will be the first to be contacted when a position becomes available!</b></p>",
        "url": "https://jobicy.com/jobs/88418-expert-advisor-health",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:31:01",
        "salary": "",
        "job_type": "contract, part-time",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/1dfcadbc6c3fe11bd30efd9231c348d2.png",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Manager, Production &amp; Quality",
        "company": "StackAdapt",
        "location": "Canada",
        "description": "As Manager, Production &amp;amp; Quality at StackAdapt, your role will be the heartbeat of our creative engine, where you&amp;#8217;ll manage a portion of our talented Production team to deliver outstanding work. You&amp;#8217;ll orchestrate resources with finesse, ensuring every project is executed flawlessly, on time, and to the highest standards. As the maestro of our creative symphony,&amp;#8230;",
        "html_description": "<p>As Manager, Production &amp; Quality at StackAdapt, your role will be the heartbeat of our creative engine, where you&#8217;ll manage a portion of our talented Production team to deliver outstanding work. You&#8217;ll orchestrate resources with finesse, ensuring every project is executed flawlessly, on time, and to the highest standards. As the maestro of our creative symphony, you&#8217;ll streamline workflows, optimize processes, and ensure seamless communication and execution. You will be the guardian of our digital assets, ensuring accessibility and organization, while also managing our technical resources to keep our systems running efficiently.</p>\n<p>If you&#8217;re ready to help shape the future of our Creative Studio team, collaborating with other managers to fuel growth and success, then we want to hear from you.  Join us in creating a world where creativity knows no bounds!</p>\n<p>StackAdapt is a remote-first company, we are open to candidates located anywhere in Canada for this position.</p>\n<h2>What you&#8217;ll be doing:</h2>\n<ul>\n<li>Lead, develop, and mentor a team of creative professionals including graphic designers, motion designers, developers, and other creative roles.</li>\n<li>Set clear performance expectations, provide regular feedback, and conduct performance reviews.</li>\n<li>Effectively forecasting, allocating, and monitoring staff resources based on skills, interests, and workload to ensure all projects are completed on time, on spec, and to the highest quality.</li>\n<li>Overseeing and proactively improving workflows for briefing, creative development, resourcing, scheduling, quality control, reviews, sign-off, and asset delivery.</li>\n<li>Oversee and streamline communication, manage rush requests, and handle escalations for a high-volume creative team, ensuring efficient workflow and timely project completion.</li>\n<li>Sourcing, evaluating, negotiating rates, and managing vendors to fulfill production needs or expand services.</li>\n<li>Monitor and motivate through the impact of change initiatives and adjust strategies as needed.</li>\n</ul>\n<h2>What you’ll bring to the table:</h2>\n<ul>\n<li>Minimum of 3 years experience in a people manager role within the creative or advertising industries, ideally specializing in digital executions or creative resourcing.</li>\n<li>Proven track record of managing creative teams and delivering successful projects on time and within budget.</li>\n<li>Strong leadership skills with the ability to inspire and motivate a diverse team, while mentoring and developing team members’ skills.</li>\n<li>Possess a curious and analytical mindset with proficiency in project management software and digital advertising platforms, enabling data-driven decisions to optimize production processes</li>\n<li>Comprehensive knowledge of the programmatic and advertising industries, technologies, and processes.</li>\n<li>Proven experience managing client and vendor relationships.</li>\n<li>Exceptional verbal and written communication skills including ability to convey complex ideas clearly and persuasively to various stakeholders.</li>\n<li>Strong interpersonal skills for effective collaboration with team members, clients, and senior management.</li>\n</ul>\n<h2>StackAdapters Enjoy:</h2>\n<ul>\n<li>Highly competitive salary + commission structure</li>\n<li>RRSP matching</li>\n<li>3 weeks vacation + 3 personal care days + 1 Culture &amp; Belief day + birthdays off</li>\n<li>Access to a comprehensive mental health care platform</li>\n<li>Health benefits from day one of employment</li>\n<li>Work from home reimbursements</li>\n<li>Optional global WeWork membership for those who want a change from their home office</li>\n<li>Robust training and onboarding program</li>\n<li>Coverage and support of personal development initiatives (conferences, courses, etc)</li>\n<li>Access to StackAdapt programmatic courses and certifications to support continuous learning</li>\n<li>An awesome parental leave policy</li>\n<li>A friendly, welcoming, and supportive culture</li>\n<li>Our social and team events!</li>\n</ul>\n<p><i>StackAdapt is a diverse and inclusive team of collaborative, hardworking individuals trying to make a dent in the universe. No matter who you are, where you are from, who you love, follow in faith, disability (or superpower) status, ethnicity, or the gender you identify with (if you’re comfortable, let us know your pronouns), you are welcome at StackAdapt. If you have any requests or requirements to support you throughout any part of the interview process, please let our Talent team know.</i></p>",
        "url": "https://jobicy.com/jobs/114092-manager-creative-services",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:18:27",
        "salary": "",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/bf5f2bb689c6f35f6cab5459f3eff869.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Associate Support Engineer",
        "company": "GitLab",
        "location": "EMEA",
        "description": "Support Engineering at GitLab isn’t just a title &amp;#8211; you will be embedded within the Engineering department and will truly operate in an environment where Support and Engineering meet. You’ll interact with customers daily as they encounter the difficult edge cases of running GitLab in complex environments. In the space of a day, you might&amp;#8230;",
        "html_description": "<p>Support Engineering at GitLab isn’t just a title &#8211; you will be embedded within the Engineering department and will truly operate in an environment where Support and Engineering meet. You’ll interact with customers daily as they encounter the difficult edge cases of running GitLab in complex environments. In the space of a day, you might be doing behind the scenes work of a Linux administrator troubleshooting performance problems by using strace on a particular process, interacting with the Product team to ensure that steps in a bug report are reproducible, or interacting with the Engineering team itself by diving deep into our codebase and putting together a merge request to actually fix a customer issue.</p>\n<p>That’s not all though &#8211; you’d equally be invited to contribute to the source code, improve our documentation, and help build out more efficient support processes in our issue tracker. We want to live in a world where everyone can contribute, and as a member of the Support team, there are no barriers to using your skills to improve the experience of our users and customers.</p>\n<h2><strong>What you’ll do:</strong></h2>\n<ul>\n<li>Support a mix of Self-managed and GitLab.com (SaaS) customers and resolve their issues via Zendesk tickets, merge requests, email and video conferencing</li>\n<li>Collaborate with our Product, Development, Infrastructure, Customer Success and Sales Teams to build new features and fix bugs, define and shape the product goals, roadmap, priorities, and strategy</li>\n<li>Create and update documentation based on customer interactions</li>\n<li>Collaborate with Support team members (through Pairing Sessions) and other GitLab team members (for example: as a Support Stable Counterpart)</li>\n<li>Participate in regular rotations for weekday and weekend on-call coverage (daytime only), providing emergency support to our Self-managed and SaaS customers, or working with our SaaS Production team to coordinate incident communications</li>\n</ul>\n<h2><strong>What you’ll bring:</strong></h2>\n<ul>\n<li>Experience in and passion for managing customer-facing cases throughout the entire support lifecycle from initial customer inquiry to triage and reproduction, writing bug reports for handoff to the development team, and case resolution</li>\n<li>Basic Linux systems knowledge</li>\n<li>Basic familiarity/knowledge of scripting languages (preferably Ruby or Bash)</li>\n<li>Basic understanding of Git</li>\n<li>Ability to communicate technical topics to customers and coworkers of varying technical skill level</li>\n</ul>\n<h2><strong>About the team:</strong></h2>\n<p>The Support team is distributed all over the world across AMER, EMEA, and APAC regions. Support Engineers work on Support Tickets and helping GitLab’s customers, but they also dig into the code and logs to find out why something is not working as expected. The Collaboration here at GitLab is extraordinary and exciting &#8211; Support Engineers solve complex problems together and participate in regular pairing sessions and 1:1s, as well as coffee chats and Slack conversations that help them stay connected.</p>\n<p><em>Please note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from </em><em>underrepresented groups</em><em> are less likely to apply to a job unless they meet every single qualification. If you&#8217;re excited about this role, please apply and allow our recruiters to assess your application.</em></p>\n<p><strong>Country Hiring Guidelines: </strong>GitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.</p>\n<p>GitLab is proud to be an equal opportunity workplace and is an affirmative action employer. GitLab’s policies and practices relating to recruitment, employment, career development and advancement, promotion, and retirement are based solely on merit, regardless of race, color, religion, ancestry, sex (including pregnancy, lactation, sexual orientation, gender identity, or gender expression), national origin, age, citizenship, marital status, mental or physical disability, genetic information (including family medical history), discharge status from the military, protected veteran status (which includes disabled veterans, recently separated veterans, active duty wartime or campaign badge veterans, and Armed Forces service medal veterans), or any other basis protected by law. GitLab will not tolerate discrimination or harassment based on any of these characteristics.</p>",
        "url": "https://jobicy.com/jobs/111688-intermediate-support-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:16:40",
        "salary": "",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201207055737-109952.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Unity Developer",
        "company": "Teaching.com",
        "location": "USA",
        "description": "We are looking for an additional Unity developer to support the building of a product from the ground-up that will impact millions of children through engaging play-based experiences. You’re not concerned with patting yourself on the back for perfect code and you often find that other developers in the organization come to you for advice&amp;#8230;.",
        "html_description": "<p>We are looking for an additional Unity developer to support the building of a product from the ground-up that will impact millions of children through engaging play-based experiences. You’re not concerned with patting yourself on the back for perfect code and you often find that other developers in the organization come to you for advice. The ideal candidate has strong skills and experience developing UI, particularly with Unity UI and Unity 2D.</p>\n<p>We are looking for an experienced Unity developer who is excited by the prospect of building features on a product that will impact millions of children through engaging play-based experiences. You’re not concerned with patting yourself on the back for perfect code and you often find that other developers in the organization come to you for advice. The ideal candidate has experience working with products at scale, the nitty-gritty details of performance optimization, and is capable of single-handedly architecting a complex mobile app.</p>\n<h2><b><strong>Skills &amp; Background</strong></b></h2>\n<ul>\n<li>5+ years of experience developing 2D Unity games for native iOS/Android deployment</li>\n<li>Experience architecting a 2D Unity game from scratch</li>\n<li>Flexible, well-organized and experience working in a fast-paced small company environment</li>\n<li>Exceptional communication skills, particularly written (as a remote company, we value clear and concise communication across all departments)</li>\n<li>Able to meet deadlines in a fast-paced quickly changing environment</li>\n<li>Approaches problem-solving proactively with strong decision-making skills</li>\n<li>Positive attitude and entrepreneurial spirit</li>\n</ul>\n<h2><b><strong>Bonus Points</strong></b></h2>\n<ul>\n<li>Experience working in education</li>\n</ul>\n<h2><b><strong>Compensation, Benefits &amp; Perks</strong></b></h2>\n<ul>\n<li>Competitive salary</li>\n<li>Fully-vested 401k with matching contributions</li>\n<li>Annual cash profit sharing</li>\n<li>Medical and dental benefits</li>\n<li>Flexible office hours</li>\n<li>Ongoing education assistance</li>\n<li>Flexible PTO</li>\n<li>Remote office hardware reimbursement</li>\n<li>Company-owned laptop</li>\n<li>Monthly meal adventure</li>\n<li>Annual company retreat</li>\n</ul>\n<p>Everyone at Teaching.com is empowered to move quickly, make decisions, and get things done so we can continue to make learning accessible to our growing community of more than 75 million students and teachers internationally.</p>\n<p><b><strong>Join the fully-remote team at Teaching.com to create, develop, and deliver fun and engaging games for students and educators!</strong></b></p>\n<p><b><strong>NO RECRUITERS</strong></b></p>\n<p>Sorry, we will not transfer or sponsor visas.</p>\n<p>We are an Equal Opportunity Employer.</p>",
        "url": "https://jobicy.com/jobs/117043-unity-developer",
        "source": "Jobicy",
        "posted_at": "2025-04-22 04:09:32",
        "salary": "",
        "job_type": "full-time",
        "category": "Programming",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/6f0ff3294c2d22960e0766a0a08caaa5.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Senior Software Engineer",
        "company": "FullStory",
        "location": "USA",
        "description": "As a Fullstack engineer on the Application Experience team, you will play a pivotal role in building systems and features that provide a consistent and lovable experience across all Fullstory products. You will collaborate closely with senior leaders, cross-functional engineers, designers, and product management to develop mission-critical features that drive enterprise adoption and create significant&amp;#8230;",
        "html_description": "<p>As a Fullstack engineer on the Application Experience team, you will play a pivotal role in building systems and features that provide a consistent and lovable experience across all Fullstory products. You will collaborate closely with senior leaders, cross-functional engineers, designers, and product management to develop mission-critical features that drive enterprise adoption and create significant business impact with some of the world&#8217;s leading brands</p>\n<h2><strong>In a typical day, you might:</strong></h2>\n<ul>\n<li>Collaborate with Design, PM, and Engineering teammates to plan and build new features in a tight feedback loop with our customers. Well written communication goes a long way.</li>\n<li>Architect and scale systems (operating at hundreds of thousands of requests per second) that unlock key functionality across all of our products and teams.</li>\n<li>Lead end to end projects, designing customer workflows in React and Typescript with backend work in Go.</li>\n<li>Own multi-product architecture, such as the Design System (“Grammar”), that helps other teams build impressive capabilities.</li>\n<li>Maintain and troubleshoot parts of Fullstory’s production environment.</li>\n</ul>\n<h2><strong>Here’s what we’re looking for:</strong></h2>\n<ul>\n<li>Passion for building end to end experiences with good UX and attention to detail.</li>\n<li>Experience building enterprise grade solutions and web systems at scale.</li>\n<li>A problem-solver who challenges the status quo, driving innovative solutions to create meaningful change.</li>\n<li>Proficiency in one or more of the following: Typescript/Javascript, React, Go</li>\n<li>Bachelor&#8217;s degree in Computer Science or a related field.</li>\n<li>Nice to have: Experience with design systems</li>\n</ul>\n<p>You’ll be joining a very tight knit team filled with passionate, collaborative people, all of whom are excited to meet you!</p>\n<p>The base salary for this position ranges between $160,000 &#8211; $190,000 USD. Base salary will vary based on relevant experience, job-related skills and qualifications.</p>\n<h2><strong>About Fullstory</strong></h2>\n<p>Fullstory is on a mission to help technology leaders make better, more informed decisions by injecting behavioral data into their analytics stack. The company’s patented technology unlocks the power of quality behavioral data at scale by transforming every digital visit into actionable data and insights. With Fullstory, enterprises can get closer to their customers’ true sentiment and intentions to predict what they want, create personalized experiences, and drive conversion, loyalty, and revenue. Fullstory is headquartered in Atlanta, USA, with regional teams across North America, EMEA and APAC.</p>\n<h2><strong>How we support you:</strong></h2>\n<p>Fullstorians are committed to building something better—from how we approach our product, to how we care for our customers and each other. Better is only possible when we can bring our full selves to work. Along these lines, we offer:</p>\n<ul>\n<li><strong>Autonomy and flexibility.</strong> From a remote-first work environment and flexible paid time off, to an annual company-wide closure – Fullstorians can focus on the moments that matter.</li>\n<li><strong>Benefits.</strong> Take care of the whole you. FullStory offers sponsored benefit packages for US-based Fullstorians, and supplemental coverage options for international Fullstorians.</li>\n<li><strong>Learning opportunities.</strong> We provide professional development opportunities through training programs, career coaching sessions, and an annual learning subsidy.</li>\n<li><strong>Productivity support.</strong> We provide all Fullstorians with a monthly productivity stipend and reimburse remote colleagues for their initial home office set up.</li>\n<li><strong>Team events.</strong> Connect with fellow Fullstorians through Employee Resource Group events, Listening &amp; Alignment weeks, and team off-sites.</li>\n<li><strong>Paid parental leave.</strong> Fullstorians have the flexibility to balance the needs of their growing families without the added stress of figuring out work and finances.</li>\n<li><strong>Grow your family. </strong>We offer a global fertility and family building benefit that encompasses all journeys to growing your family.</li>\n<li><strong>Bereavement leave.</strong> Every family is different; we leave it to you to define who your family is, and support you when you need it most.</li>\n<li><strong>Miscarriage/Pregnancy loss leave.</strong> Whether it is for a Fullstorian or their partner – take the time you need.</li>\n</ul>\n<p><em>Fullstory is proud to be an equal opportunity workplace dedicated to fostering an increasingly diverse community. We want candidates of all human varieties, backgrounds, and lifestyles. There’s no problem that can’t be made better by bringing together people with a broader set of perspectives. <strong>If our product, values, and community resonate with you, please apply &#8211; we&#8217;d love to hear from you!</strong></em></p>",
        "url": "https://jobicy.com/jobs/117040-senior-software-engineer-11",
        "source": "Jobicy",
        "posted_at": "2025-04-22 03:57:06",
        "salary": "USD 160,000 - 190,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210319095053-738582.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Senior iOS Engineer",
        "company": "Life360",
        "location": "Canada,  USA",
        "description": "This role is for an iOS engineer within the Life360 Growth team. This person will be an integral part of the core of our applications, as they will be required to become experts in subscriber growth and premium offerings. As a member of the team, you are expected to be highly involved in architecting, designing,&amp;#8230;",
        "html_description": "<p>This role is for an iOS engineer within the Life360 Growth team. This person will be an integral part of the core of our applications, as they will be required to become experts in subscriber growth and premium offerings. As a member of the team, you are expected to be highly involved in architecting, designing, and leading the development of the next generation of our systems and features.</p>\n<p><strong><em>The US based salary range for this position is $123,000 to 180,500.</em></strong> <strong><em>The Canada-based salary range for this position is 145,000 to 180,000 CAD. </em></strong>We take into consideration an individual&#8217;s background and experience in determining final salary- therefore, base pay offered may vary considerably depending on geographic location, job-related knowledge, skills, and experience. The compensation package includes a wide range of medical, dental, vision, financial, and other benefits, as well as equity.</p>\n<h2>What You’ll Do</h2>\n<ul>\n<li>Work with a cross-functional team and collaborate closely with design, back-end engineering, marketing, data science, and product.</li>\n<li>Design and maintain Growth specific features and experiments for iOS using tools such as XCTest, XCUITest, or other relevant frameworks.</li>\n<li>Create foundational automation workflows that lead to better product quality and reliability.</li>\n<li>Opportunity to be on the leading edge of Growth experiences in a high-visibility team</li>\n<li>Roadmap innovative features to bring families closer together through contextual awareness, improved geolocation, and better communication</li>\n<li>Identify and work on key improvements to make application more scalable</li>\n</ul>\n<h2>What We’re Looking For</h2>\n<ul>\n<li>Bachelor&#8217;s Degree or equivalent experience</li>\n<li>Growth mindset\n<ul>\n<li>Eager to work with engineering leadership and product on experiments</li>\n<li>Experience working with experimentation platform and A/B testing</li>\n</ul>\n</li>\n<li>Strong debugging skills\n<ul>\n<li>Many problems in the sensor frameworks require understanding hard-to-pinpoint and non-reproducible problems.</li>\n<li>Identify and correct bottlenecks and fix bugs to improve application performance and responsiveness.</li>\n</ul>\n</li>\n<li>Problem-solving\n<ul>\n<li>We will be solving problems that do not have clear solutions with limited resources available online.</li>\n</ul>\n</li>\n<li>Architecture mindset\n<ul>\n<li>Will be spending equally as much time designing and prototyping as writing production code</li>\n<li>Strong understanding of software architecture principles and experience in making codebases more testable</li>\n</ul>\n</li>\n<li>Strong understanding of the iOS ecosystem</li>\n</ul>\n<h2><strong>Expert knowledge of Swift and familiarity with iOS frameworks and APIs.</strong></h2>\n<ul>\n<li>Design, build, and maintain advanced applications for the iOS platform with a focus on location-based services</li>\n<li>Adaptable and able to pick up new concepts</li>\n<li>Drive to level up\n<ul>\n<li>Conduct code reviews and mentor junior engineers to promote best practices and improve code quality.</li>\n<li>Work closely with product managers, designers, and engineers to define, design, and ship new features and test strategies.</li>\n</ul>\n</li>\n<li>A Passion for quality\n<ul>\n<li>We want someone who will take the craftsmanship of their work seriously and strive to improve the areas they work in continually.</li>\n<li>Pioneer new test strategies via automation to enhance the reliability and efficiency of our testing processes.</li>\n<li>Proven experience in developing and implementing automated test strategies</li>\n</ul>\n</li>\n<li>Strong communication\n<ul>\n<li>Will communicate with multiple teams, including both systems and product teams</li>\n<li>At times, may need to communicate with external partners</li>\n</ul>\n</li>\n</ul>\n<h2>Bonus</h2>\n<ul>\n<li>Familiarity with data analytics and marketing tools</li>\n<li>Familiarity with location and other sensors</li>\n<li>Familiarity with background running tasks/services on iOS</li>\n<li>Familiarity with networking and persistence technologies</li>\n<li>Familiarity with reactive programming, RxSwift, or combine</li>\n<li>Familiarity with developing highly polished user interfaces and animations</li>\n<li>Familiarity with all levels of automated testing</li>\n</ul>\n<h2>Our Benefits</h2>\n<ul>\n<li>Competitive pay and benefits</li>\n<li>Medical, dental, vision, life, and disability insurance plans (100% paid for US employees). We offer supplemental medical and dental plans for Canadian employees.</li>\n<li>RRSP plan with DPSP company matching program</li>\n<li>Employee Assistance Program (EAP) for mental wellness.</li>\n<li>Flexible PTO and 12 company-wide days off throughout the year]</li>\n<li>Learning &amp; Development programs</li>\n<li>Equipment, tools, and reimbursement support for a productive remote environment</li>\n<li>Free Life360 Platinum Membership for your preferred circle</li>\n</ul>\n<h2>Life360 Values</h2>\n<p>Our company’s mission-driven culture is guided by our shared values to create a trusted work environment where you can bring your authentic self to work and make a positive difference.</p>\n<ul>\n<li>Be a Good Person &#8211; We have a team of people with high integrity who you can trust.</li>\n<li>Be Direct With Respect &#8211; We communicate directly, even when it’s hard.</li>\n<li>Members Before Metrics &#8211; We focus on building an exceptional experience for families.</li>\n<li>High-Intensity High Impact &#8211; We do whatever it takes to get the job done.</li>\n</ul>\n<h2>Our Commitment to Diversity</h2>\n<p>We believe that different ideas, perspectives, and backgrounds create a stronger, more creative work environment that delivers better results. Together, we continue to build an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. It fuels our innovation and connects us closer to our customers and the communities we serve. We strive to create a workplace that reflects the communities we serve and where everyone feels empowered to bring their authentic best selves to work.</p>\n<p><em>We are an equal-opportunity employer and value diversity at Life360. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any legally protected status.  </em></p>\n<p><em>We encourage people of all backgrounds to apply. We believe that a diversity of perspectives and experiences creates a foundation for the best ideas. Come join us in building something meaningful. Even if you don’t meet 100% of the qualifications below, you should still seriously consider applying!</em></p>",
        "url": "https://jobicy.com/jobs/117039-senior-ios-engineer-7",
        "source": "Jobicy",
        "posted_at": "2025-04-22 03:54:12",
        "salary": "CAD 145,000 - 180,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/f269bad3-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Trust Junior Accountant",
        "company": "Ascensus",
        "location": "USA",
        "description": "Responsible for performing financial, administrative, and clerical services for multiple employer benefit trust clients, including: Gathering and processing financial data to assist Senior Accountant in completion of periodic financial statements, preparing reports of financial and statistical data and assisting/supporting the Senior Accountant in various general accounting duties such as journal entries, account reconciliations, and other&amp;#8230;",
        "html_description": "<p>Responsible for performing financial, administrative, and clerical services for multiple employer benefit trust clients, including: Gathering and processing financial data to assist Senior Accountant in completion of periodic financial statements, preparing reports of financial and statistical data and assisting/supporting the Senior Accountant in various general accounting duties such as journal entries, account reconciliations, and other month-end or periodic processes. Effectively communicate with internal sources as well as Clients, Trustees and other business partners.</p>\n<h2><b>Job Functions, Essential Duties and Responsibilities</b></h2>\n<p>Accounts Payable</p>\n<ul>\n<li>Accurately code invoices for correct G/L posting, as needed</li>\n<li>Enter invoices in Peachtree and Business Works for payment</li>\n<li>Manage the various payments via check or wire transfer, including attaining trustee signature and mailing to appropriate vendors</li>\n<li>Communicate effectively with Clients and Vendors regarding accounts payable</li>\n<li>Maintain vendor account information</li>\n<li>Research and resolve vendor issues</li>\n<li>Prepare and issue annual 1099s, W2s, and W3s as needed</li>\n<li>Payroll Processing for Trust Client Employees, as required</li>\n</ul>\n<p>Remit payroll taxes</p>\n<ul>\n<li>General Ledger/Month-End Process for Multiple Trust Clients</li>\n<li>Research and resolve discrepancies in financial data related to A/P</li>\n<li>Verify and post bank transfer activity as required</li>\n<li>Accumulate data and post journal entries (recurring and as directed by Senior Accountant)</li>\n<li>Calculate broker commissions as needed, print checks and prepare accompanying letters</li>\n<li>Prepare required monthly financial reports for trustees, as requested</li>\n</ul>\n<p>Audit Assistance</p>\n<ul>\n<li>Maintain financial files and documents according to established guidelines</li>\n<li>Ensure thorough and complete audit trail for all journal entries and adjustments</li>\n<li>Assist in producing requested documentation for annual trust audits</li>\n<li>Assist Sr Accountant in answering auditor questions regarding internal controls, etc.</li>\n<li>Maintain audit file of backup documentation</li>\n</ul>\n<p>General Ledger</p>\n<ul>\n<li>Post Cash Receipts for Trusts, as required</li>\n<li>Prepare bi-weekly journal entries for Payroll</li>\n<li>Prepare and post journal entires of all monthly expenses per bank statements, as required</li>\n<li>Prepare retirement, dental and medical benefits worksheets for AP</li>\n<li>Prepare quarterly  and Year end EDD and IRS payroll Reports</li>\n</ul>\n<p>Other</p>\n<ul>\n<li>Ensure proper maintenance and online storage of financial data</li>\n<li>Monitor Cash position of various trust operating accounts</li>\n</ul>\n<p>May be required to work extra hours during peak periods</p>\n<ul>\n<li>Responsible for protecting, securing, and proper handling of all confidential data held by Ascensus to ensure against unauthorized access, improper transmission, and/or unapproved disclosure of information that could result in harm to Ascensus or our clients.</li>\n<li>Our I-Client service philosophy and our Core Values of People Matter, Quality First and Integrity Always® should be visible in your actions on a day to day basis showing your support of our organizational culture.</li>\n<li>Assist with other tasks and projects as assigned</li>\n</ul>\n<h2><b>Experience, Skills, Knowledge Requirements</b></h2>\n<ul>\n<li> Minimum of three years accounting experience,  Trust administration or related environment is a plus</li>\n<li>Critical thinking, analysis, detail orientation and customer service preferred</li>\n<li>Four year accounting degree preferred</li>\n<li>Knowledge of Generally Accepted Accounting Principles</li>\n<li>Strong knowledge of math and accounting functions required to reconcile accounts and prepare monthly financials</li>\n<li>Knowledge of multiple employer benefit trust tax reporting and audit requirements including deadlines and related penalties is a big plus</li>\n<li>Knowledge of methods for goal setting</li>\n<li>Organizational skills and ability to set priorities consistent with service standards</li>\n<li>Excellent attention to detail and ability to review and ensure quality of team member work</li>\n<li>Self-starter with ability to take initiative, effectively evaluate situations and implement solutions</li>\n<li>Ability to multi-task, meet deadlines and work closely with others in a team setting</li>\n<li>Ability to effectively communicate, both in writing and orally, with a wide range of  contacts in a professional manner</li>\n<li>Ability to maintain a positive attitude when addressing client questions and problems</li>\n<li>Accounting and Math Skills:  required for reconciling bank accounts and preparing cash basis and accrual basis financials in accordance with GAAP</li>\n<li>Software Skills: MS Office 2007 (Excel, Word, Outlook) with intermediate to advanced Excel skills,  Peachtree and Business Works</li>\n<li>Accounting system conversion skills a big plus</li>\n<li>Ability to document and maintain operations and accounting procedures</li>\n<li>Promote a positive and professional working environment</li>\n</ul>\n<p>We are proud to be an Equal Opportunity Employer</p>\n<p><i>Be aware of employment fraud. All email communications from Ascensus or its hiring managers originate from @ascensus.com </i><i>or @futureplan.com</i> <i>email addresses. We will never ask you for payment or require you to purchase any equipment. If you are suspicious or unsure about validity of a job posting, we strongly encourage you to apply directly through our website.</i></p>\n<p>For all virtual remote positions, in order to ensure associates can effectively perform their job duties with no distractions, we require an uninterrupted virtual work space and there is also an expectation of family care being in place during business hours. Additionally, there is an internet work speed requirement of 25 MBps or better for individual use. If more than one person is utilizing the same internet connection in the same household or building, then a stronger connection is required. If you are unsure of your internet speed, please check with your service provider. Note: For call center roles specifically, it is a requirement to either hardwire your equipment directly to the internet router or ensure your workstation is in close proximity to the router. Please ensure that you are able to meet these expectations before applying.</p>\n<p>At Ascensus, we aspire to make a difference for others. We are a technology-enabled services company that helps people save for a better future through our network of institutional, financial advisor, and state partners. Our culture is guided by sound principles, is committed to high standards, operates with transparency, and welcomes diversity—housed within our Core Values: People Matter. Quality First. Integrity Always.®</p>",
        "url": "https://jobicy.com/jobs/117029-trust-junior-accountant",
        "source": "Jobicy",
        "posted_at": "2025-04-21 13:36:12",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/06/65d9926631569e434a59253a83f286dc.jpg",
        "job_level": "Junior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Full Stack Developer",
        "company": "LimeSurvey",
        "location": "Anywhere",
        "description": "Our LimeSurvey survey platform is providing capabilities to create and collect online surveys and analyse and share survey data. The survey platform can be used to conduct simple questionnaires with just a couple of questions or advanced assessments with conditionals and quota management. We work closely with our community and partner network to co-create, fix&amp;#8230;",
        "html_description": "<p>Our LimeSurvey survey platform is providing capabilities to create and collect online surveys and analyse and share survey data. The survey platform can be used to conduct simple questionnaires with just a couple of questions or advanced assessments with conditionals and quota management.</p>\n<p>We work closely with our community and partner network to co-create, fix bugs, translate, and share knowledge. You will join our creative team and get involved in building the world’s #1 open-source survey platform.</p>\n<p>As the Software Engineer, you will have a key position in our Survey Platform Development team.  You will help build a versatile, open-source survey tool for newcomers and professionals. So they can get the freshest insights &#8211; as easy as squeezing a lime. Well, for the latter ‘easy’ part we could really use your help.</p>\n<h2><b>This will be your challenge:</b></h2>\n<ul>\n<li>You will be involved in the entire development cycle for frontend and backend topics</li>\n<li>You need to stay on top of new technologies and seek for possible improvements</li>\n<li>You will build new features and break them down from our product roadmap</li>\n<li>You will align back and forwards with team members and product owner</li>\n<li>You will come up with technical solutions for implementation and implement accordingly</li>\n<li>You will write technical requirements and implement them together with our team</li>\n<li>You are responsible for the code you write in line with our LimeSurvey coding guidelines</li>\n<li>Manage application maintenance and their environments</li>\n<li>Your code will be showcased to the rest of the world, since we’re open source</li>\n</ul>\n<h2><b>This is you:</b></h2>\n<ul>\n<li>You have worked on B2B, SaaS or Dev Tools</li>\n<li>You have solid programming skills and master PHP frameworks, Yii would be great but is always learnable</li>\n<li>You foster relationships with your team and have great communication skills + a getting things done mentality</li>\n<li>You understand technologies supporting the LimeSurvey ecosystem</li>\n<li>You are an active contributor to open source projects (or will be in the future ;-))</li>\n<li>You have a good sense of humour, and you stay calm in stressful situations</li>\n<li>You want to be part of a distributed down to earth team on a mission to create the world&#8217;s #1 open survey platform</li>\n</ul>\n<h2><b>Tech we use:</b></h2>\n<ul>\n<li>Yii-3 PHP Framework</li>\n<li>React JS</li>\n<li>Typescript</li>\n<li>Bootstrap 5</li>\n<li>Redis</li>\n<li>MySQL, MSSQL and Postgres</li>\n</ul>\n<p>Varied, interesting and challenging tasks, the chance to work with a growing dynamic distributed international team, room for creativity and your own ideas. We offer a wide range of training courses including language classes.</p>\n<p>We work flexible hours, distributed, from home or in the office. We offer a dynamic working environment with flexible hours remote, from home, or in the office if you’re nearby at headquarters in Hamburg. As well as an appropriate salary package based on cost of living including paid vacation, local public holidays, paid sick leave &amp; parental leave, employment &amp; contractor options.</p>\n<p>Be sure to mention the magic word IAMLIME when applying to show you read the job post completely. This is a beta feature to avoid spam applicants.</p>",
        "url": "https://jobicy.com/jobs/115704-full-stack-developer-4",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:33:59",
        "salary": "",
        "job_type": "full-time",
        "category": "Programming",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/04/d73f1339fb962579112a49efd2e825ef.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Global Marketing Program Sr. Manager",
        "company": "ServiceNow",
        "location": "Canada,  USA",
        "description": "The Global Marketing Program Senior Manager is responsible for the orchestration and operations that support the design, execution, and performance of ServiceNow’s global integrated marketing programs tailored to our most critical persona groups. This role requires strong project management expertise and end-to-end marketing program and/or campaign experience.  As a Sr. Program Manager, you are responsible&amp;#8230;",
        "html_description": "<p>The Global Marketing Program Senior Manager is responsible for the orchestration and operations that support the design, execution, and performance of ServiceNow’s global integrated marketing programs tailored to our most critical persona groups.</p>\n<p>This role requires strong project management expertise and end-to-end marketing program and/or campaign experience.  As a Sr. Program Manager, you are responsible for holding teams accountable to realize the end-to-end plan, as well as managing the overarching project plan, agencies, internal processes, internal communications, and budget.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<p>With a keen eye for detail and project management prowess, this role works across marketing teams to facilitate the execution of global integrated marketing program plans that support brand awareness, demand generation and pipeline acceleration, and adoption and renewals goals.</p>\n<h2>Operations responsibilities include</h2>\n<ul>\n<li>Facilitates and leads cross-functional working sessions, including managing the agenda, working files, action items, and plan components</li>\n<li>Designs and manages the comprehensive project plan including the campaign roadmap and deliverables timelines</li>\n<li>Manages the overall program budget details, including working with agencies and our internal resource management and finance teams to complete SOWs, POs, and invoices</li>\n<li>Ensures marketing plan is being socialized and measured as part of the organization’s overall rhythm of the business and QBRs.</li>\n<li>Ensures program plan and its components are accurately captured and tracked in appropriate tools and reporting.</li>\n<li>Designs and drives internal communications to ensure visibility of the plan to the appropriate audiences, including providing regular updates to Marketing leadership on plan and risks</li>\n<li>Holds cross-functional team accountable to the execution and performance of the aligned plan</li>\n</ul>\n<h2><strong>Cross-Functional Stakeholder Management</strong></h2>\n<p>This role requires a strong ability to lead by influence across various teams and levels. Cross-functional teams include members from:</p>\n<ul>\n<li>Brand, Creative &amp; Thought Leadership</li>\n<li>Digital &amp; Social</li>\n<li>Product &amp; Solution Marketing</li>\n<li>Field &amp; Demand Marketing</li>\n<li>Partner Marketing</li>\n<li>Events</li>\n<li>Analytics &amp; Insights</li>\n</ul>\n<p>This role would also collaborate within a team of Marketing Program Managers to share best practices, drive standards for excellence, and connect dots across global programs and campaign plans.</p>\n<h2>Qualifications</h2>\n<p><strong>Skill &amp; Experience Requirements </strong></p>\n<ul>\n<li>Experience in leveraging or critically thinking about how to integrate AI into work processes, decision-making, or problem-solving. This may include using AI-powered tools, automating workflows, analyzing AI-driven insights, or exploring AI’s potential impact on the function or industry.</li>\n<li><strong>Curiosity for AI &amp; Innovation</strong>: We’re looking for candidates who are excited about AI and love experimenting with new ideas and tools. A passion for learning and innovation is a must!</li>\n<li>Proven marketing program management experience, including excellent project plan skills</li>\n<li>Experience driving, designing or executing integrated marketing programs and/or campaigns</li>\n<li>Understanding of marketing campaign performance and ability to translate it into business impact</li>\n<li>Strong stakeholder management skills with ability to lead by influence to successfully drive cross-functional collaboration</li>\n<li>Strong written and verbal communication skills</li>\n<li>Marketing campaign and program management within the enterprise software industry is preferred</li>\n<li>Domain knowledge in brand and creative, field marketing, digital marketing, and product and solution messaging to successfully facilitate collaboration and alignment is also ideal</li>\n<li>Bachelor’s degree with 12+ years of marketing experience</li>\n</ul>\n<p><em>Not sure if you meet every qualification? We still encourage you to apply! We value inclusivity, welcoming candidates from diverse backgrounds, including non-traditional paths. Unique experiences enrich our team, and the willingness to dream big makes you an exceptional candidate!</em></p>\n<h2>Additional Information</h2>\n<p><strong>Work Personas</strong></p>\n<p>We approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work.</p>\n<p><strong>Equal Opportunity Employer</strong></p>\n<p>ServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements.</p>",
        "url": "https://jobicy.com/jobs/115012-global-partner-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:32:56",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/3f9f6951a15d7f9fff1e42f86a01430e.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Sr. Data Analyst",
        "company": "Tremendous",
        "location": "USA",
        "description": "We are hiring an experienced data analyst to partner with our internal stakeholders and own internal data-modeling. Tremendous values data as a first-class citizen and believes insights unlock significant growth. You will collaborate closely with the data team and company-wide stakeholders. In this role, you’ll get to: Apply various analytics methods to gain critical business&amp;#8230;",
        "html_description": "<p>We are hiring an experienced data analyst to partner with our internal stakeholders and own internal data-modeling. Tremendous values data as a first-class citizen and believes insights unlock significant growth. You will collaborate closely with the data team and company-wide stakeholders.</p>\n<h2><strong>In this role, you’ll get to:</strong></h2>\n<ul>\n<li>Apply various analytics methods to gain critical business insights</li>\n<li>Consolidate diverse facts and findings into compelling narratives that can be applied across Tremendous.</li>\n<li>Drive growth by collaborating with cross-functional teams</li>\n<li>Advocate for data-informed decisions by partnering with key stakeholders and senior leaders.</li>\n<li>Identify and implement improvements within the Data team by standardizing processes, developing innovative practices, providing mentorship, and fostering new expertise.</li>\n<li>Join a growing team of analysts and actively contribute to team collaboration and culture.</li>\n</ul>\n<h2><strong>More about you:</strong></h2>\n<ul>\n<li>You write sophisticated SQL with a preference for well-architected data models, optimized query performance, and documented code.</li>\n<li>You are proficient with at least one visualization &amp; business intelligence platform (e.g., Tableau, Looker, Mode).</li>\n<li>Strong verbal and communication skills. You can articulate why something should be built a certain way and how it will impact the business.</li>\n<li>You expedite projects forward, favoring rapid and incremental development in parallel with problem-solving short-term obstacles.</li>\n<li>You employ a structured approach to handle ambiguous exploratory analysis, balancing thoroughness with the MVP mindset.</li>\n<li>You use data to drive customer and product teams to achieve ambitious goals and influence company-level outcomes. Experience as a technical lead or manager is a plus.</li>\n<li>You use excellent judgment and sharp business and product instincts that allow you to prioritize.</li>\n</ul>\n<h2><strong>Bonus:</strong></h2>\n<ul>\n<li>Experience with operational tools and systems like Amplitude, Zendesk, or Segment.</li>\n<li>Experience with dbt.</li>\n<li>Experience in Python or R.</li>\n<li>Experience with customer or product analytics working with a B2B software product.</li>\n<li>Experience with designing multivariate tests, synthesizing results, and frameworks for data-informed decisions to launch.</li>\n</ul>\n<h2><strong>What&#8217;s cool about the role:</strong></h2>\n<ul>\n<li>You&#8217;ll work at a company growing quickly yet sustainably. We’re profitable with plenty more opportunity ahead. That’s good news for your career growth.</li>\n<li>Competitive pay, equity and benefits. The base salary for this role is $160,000 &#8211; $210,000.</li>\n<li>We&#8217;re a remote company. Work from wherever you want in the Americas — we have collaboration hours from around 12-3 PM Eastern time.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115020-senior-data-analyst-4",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:31:27",
        "salary": "USD 160,000 - 210,000",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/01/c2bd8be5-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Enterprise Account Executive",
        "company": "Tremendous",
        "location": "Europe",
        "description": "Tremendous is the fast, free, flexible way to send bulk payouts to people in over 200 countries. 10,000+ companies ranging from mom-and-pops to Google, MIT, and United Way have sent over $1 billion, saving 15 hours a month on average. In both our product and our workplace, we’re intentional about making work more efficient, flexible,&amp;#8230;",
        "html_description": "<p>Tremendous is the fast, free, flexible way to send bulk payouts to people in over 200 countries. 10,000+ companies ranging from mom-and-pops to Google, MIT, and United Way have sent over $1 billion, saving 15 hours a month on average.</p>\n<p>In both our product and our workplace, we’re intentional about making work more efficient, flexible, and fulfilling. Tremendous is a fully remote, high-documentation, low-meeting culture, which means more time for what matters in both your professional and personal life.</p>\n<p>Our customers, who include marketers, researchers, HR teams, and nonprofits, rave about how quick and easy it is to use Tremendous — <strong>check the ratings on G2</strong>. Yet there’s a lot of complexity under the hood, including over 2,000 redemption options and plenty of banking infrastructure. This duality makes working here a fun challenge.</p>\n<p>Tremendous is profitable and growing without outside investors. Join us before our next international offsite.</p>\n<h2><strong>What you’ll do</strong></h2>\n<p>We’re looking for an Enterprise Account Executive to drive our expansion into Europe. As the first international sales hire, you’ll be responsible for identifying, prospecting, and securing new business across Western Europe. You&#8217;ll also partner with sales, marketing, and product teams to align our product with the unique demands of new markets. As part of the founding team, you’ll have a unique opportunity to shape the direction of our international sales strategy from the ground up.</p>\n<h2><strong>About you</strong></h2>\n<ul>\n<li>5+ years of experience in software sales, with a focus on Western European markets. Experience expanding into new geographies strongly preferred.</li>\n<li>Fluency in English is required and workplace proficiency in French, German, or Spanish.</li>\n<li>Based in a Western Europe time zone (WET or CET).</li>\n<li>Ability to travel domestically and internationally.</li>\n<li>Strong written communication skills. We’re a documentation-first culture.</li>\n<li>Desire and ability to work autonomously and drive your work. Tremendous is not a great fit for people who default to waiting for instructions.</li>\n<li>High empathy. You care about your teammates and our users. You can put yourself in their shoes.</li>\n</ul>\n<h2><strong>What’s cool about the role</strong></h2>\n<ul>\n<li>Be a key player in our global expansion efforts with the chance to shape the future of the company.</li>\n<li>We’re profitable with plenty more opportunity ahead, which is good news for your career growth.</li>\n<li>We offer competitive pay, equity and benefits. The OTE for this role is £180,000 &#8211; £220,000.</li>\n<li>We&#8217;re a fully remote company.</li>\n<li>We’ve got smart people and a great culture.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115702-enterprise-account-executive-6",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:31:19",
        "salary": "GBP 180,000 - 220,000",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/01/c2bd8be5-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Fintech Account Executive",
        "company": "WorkWave",
        "location": "USA",
        "description": "WorkWave is seeking a results-driven Enterprise Fintech Account Executive with exceptional technical knowledge and presentation skills. At WorkWave, we empower industries such as Field Service, Pest Control, Lawn and Landscape, and Logistics to achieve their full potential through our cutting-edge SaaS solutions. Our fintech team works to help our customers grow their businesses and save&amp;#8230;",
        "html_description": "<p>WorkWave is seeking a results-driven Enterprise Fintech Account Executive with exceptional technical knowledge and presentation skills. At WorkWave, we empower industries such as Field Service, Pest Control, Lawn and Landscape, and Logistics to achieve their full potential through our cutting-edge SaaS solutions. Our fintech team works to help our customers grow their businesses and save time and money through WorkWave’s suite of financial products. As part of our new and fast-growing fintech team, you’ll contribute to WorkWave’s initiative to help our largest customers to find the right fintech solution for their business.</p>\n<h2>WHAT YOU&#8217;LL DO:</h2>\n<ul>\n<li>Partner with our sales and account management teams to pitch WorkWave’s fintech offerings to our existing and net-new customers within the framework of our broader sales processes</li>\n<li>Consult with purpose: conduct discovery calls to deeply understand prospects’ fintech needs and challenges, positioning WorkWave as their trusted partner</li>\n<li>Deliver impactful presentations: prepare and lead engaging product demonstrations and solution recommendations that showcases WorkWave’s growing portfolio of fintech solutions</li>\n<li>Work with existing fintech users to ensure continued usage and success</li>\n<li>Own your results: consistently meet and exceed quarterly goals, both in terms of new signups and product usage</li>\n<li>Collaborate with teams across the organization, including but not limited to: sales, product, operations, and finance, as well as with our partners</li>\n<li>Leverage technology to drive success: Build and manage a robust sales pipeline within Salesforce CRM, ensuring accurate tracking of opportunities, forecasts, and closed deals.</li>\n</ul>\n<h2>WHAT YOU&#8217;LL BRING:</h2>\n<ul>\n<li>Proven Industry Expertise: 5+ years of success in a SaaS or fintech revenue role, with a demonstrated history of exceeding goals. Bonus points for home services experience.</li>\n<li>Deep understanding of the payments and/or lending spaces.</li>\n<li>Exceptional Communication Skills: Outstanding verbal and written communication, negotiation, and interpersonal skills that foster trust and drive results.</li>\n<li>Strong Business Acumen: Ability to independently strategize, multi-task, and manage multiple prospective clients simultaneously.</li>\n<li>Pipeline Mastery: Experience managing and driving a sales pipeline with consistent execution.</li>\n<li>Education: Bachelor’s degree or equivalent experience.</li>\n</ul>\n<p>$65,000 &#8211; $92,500 a year</p>\n<p>In our dedication to salary transparency, we provide a compensation range for sales roles, which is a base salary in addition to commission. The final offer will be dependent on various factors, including the candidate&#8217;s qualifications, relevant experience, and the organization&#8217;s budget. Our Talent Acquisition team will provide more information about the compensation package for this position during the interview process.</p>\n<h2><b>WHAT YOU SHOULD KNOW ABOUT US:</b></h2>\n<ul>\n<li>• We are laid back but buttoned up. We offer a casual work environment and remote work flexibility and have a passion for developing creative, innovative best in class solutions that directly contribute to the success of our customers</li>\n<li>• We care deeply and deliver service and solutions that make a real difference in the lives of our clients and their businesses</li>\n<li>• We openly accept others as they are and build strong partnerships based on trust</li>\n<li>• Teamwork and collaboration is key to help our colleagues and customers solve their challenges</li>\n<li>• Our team is energetic, fun, naturally inquisitive and eager to make an impact, we invite you to join us!</li>\n</ul>\n<p><b><i>We’re an equal opportunity employer. All applicants will be considered for employment without attention to race, color, age, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status:</i></b><i> </i>Don&#8217;t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At WorkWave, we are dedicated to building a diverse, inclusive and authentic workplace, so if you feel like you could make a great impact in this role but your past experience doesn&#8217;t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may just be the right candidate for this or other roles!</p>\n<p><i>WorkWave supports salary transparency, however please note that salary estimates provided by websites (LinkedIn, Glassdoor, etc.) and not by WorkWave may not accurately reflect the actual salary range for the position.</i></p>",
        "url": "https://jobicy.com/jobs/115700-fintech-account-executive",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:30:55",
        "salary": "USD 65,000 - 92,500",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/78458cfe50d13ec79a5afc7a7a557272.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Sr. Frontend Engineer",
        "company": "Roofr",
        "location": "Canada",
        "description": "Building a powerful user experience is what sets Roofr apart from all other roofing platforms. As an Engineer in an early-stage and high-growth company, you will have a large impact on both technical implementation and help steer our technology roadmap. What You&amp;#8217;ll Get to Do Help drive frontend architecture to the next stage of Roof’s&amp;#8230;",
        "html_description": "<p>Building a powerful user experience is what sets Roofr apart from all other roofing platforms. As an Engineer in an early-stage and high-growth company, you will have a large impact on both technical implementation and help steer our technology roadmap.</p>\n<h2><strong>What You&#8217;ll Get to Do</strong></h2>\n<ul>\n<li>Help drive frontend architecture to the next stage of Roof’s systems</li>\n<li>Work in a fast-paced cross-functional team that values doing things ‘the right way’</li>\n<li>Contribute to an early-stage company with engineering first culture</li>\n<li>Contributing to all aspects of the Software Development Lifecycle, from planning to delivery</li>\n<li>Collaborating with cross-functional team members to develop technical requirements</li>\n<li>Writing clean code to develop functional web applications and reusable libraries</li>\n<li>Writing unit, functional, and acceptance tests</li>\n<li>Troubleshooting and supporting production applications</li>\n</ul>\n<h2><strong>What You&#8217;ll Bring to the Role</strong></h2>\n<ul>\n<li>3+ years of experience holding a <strong>Senior</strong> Engineering title</li>\n<li>Has 5+ years of software development experience</li>\n<li>Is a champion of agile methodologies, and enjoys shipping code often and confidently</li>\n<li>Has a track record of breaking down complex problems as incremental solutions</li>\n<li>Proactively recommends initiatives to improve our engineering technologies and culture</li>\n<li>Enjoys working in a collaborative environment where everyone helps each other grow</li>\n<li>Takes ownership of the product and is proud of the quality of their work</li>\n<li>Has excellent communication skills, and appreciates the value of good documentation</li>\n<li>Understands the challenges of early-stage company priorities</li>\n<li><strong>Strong</strong> experience with Javascript language &amp; <strong>React + Redux</strong> framework</li>\n<li>Experience with SCSS</li>\n<li>Experience with interacting with RESTful APIs</li>\n<li>Experience building frontend testing and automation systems for unit tests, integration tests, regression tests, and user acceptance tests</li>\n</ul>\n<h2><strong> What we offer</strong></h2>\n<p>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:</p>\n<h2><strong>️ Vacation/Paid Time Off</strong></h2>\n<ul>\n<li>1st week of employment is mandatory PTO! Start your journey with Roofr by decompressing and recharging &#8211; we will see you in week 2!</li>\n<li>1 Friday off per month (we call those our laundry days!)</li>\n<li>Company wide paid shutdown for the week between Christmas and New Years</li>\n<li>Flexible time off</li>\n<li>80% employer paid benefits</li>\n<li>RRSP/401k match</li>\n<li>Generous Parental Leave policy</li>\n</ul>\n<h2><strong> Perks</strong></h2>\n<ul>\n<li>We host 2 retreats per year and great team building activities</li>\n<li>Ample learning and development opportunities to continue growing your career</li>\n<li>Home office setup stipend</li>\n<li>Internet and phone allowance</li>\n<li>Remote first culture</li>\n<li>Weekly Friday paydays!</li>\n</ul>\n<p><em>At Roofr, we celebrate individuality and uniqueness. Roofr is proud to be an equal opportunity employer. We are committed to building an organization that empowers inclusion and diversity. We encourage candidates and employees to be true to themselves and express all aspects of their identities. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.</em></p>",
        "url": "https://jobicy.com/jobs/116457-senior-frontend-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:29:22",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/03/1a4a90db-221.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Paid Search Manager",
        "company": "Wpromote",
        "location": "USA",
        "description": "We’re looking for a Paid Search Manager to join the rapidly expanding team that is the backbone of our company. You’ll directly manage search engine marketing (SEM) campaigns across both Google Ads and Microsoft Ads, making optimizations and updates daily. Your client will be in the fin tech space that constantly challenges you, and with extensive&amp;#8230;",
        "html_description": "<p>We’re looking for a Paid Search Manager to join the rapidly expanding team that is the backbone of our company. You’ll directly manage search engine marketing (SEM) campaigns across both Google Ads and Microsoft Ads, making optimizations and updates daily. Your client will be in the fin tech space that constantly challenges you, and with extensive experience and/or a proven track record, you could be working with some of our biggest brands. You’ll be trusted to oversee all account activity, collaborate with managers from other channels, and come up with campaign strategies for this client.</p>\n<p>At Wpromote, we believe that great work is only possible with great people. Our goal is to build a better, more inclusive work environment and support our people at every stage of their careers by prioritizing a strong work-life balance through our policies and benefits listed below. As a Best Place to Work according to both Ad Age and Glassdoor and Adweek’s Fastest Growing Digital Agency, we are moving fast to expand our teams and bring new experts into the fold to keep pushing the boundaries of what’s possible in marketing.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>Remote-first culture</li>\n<li>Unlimited PTO</li>\n<li>Extended Holiday break (Winter)</li>\n<li>Flexible schedules</li>\n<li>Work from anywhere options*</li>\n<li>100% paid parental leave</li>\n<li>401(k) matching</li>\n<li>Medical, Dental, Vision, Life, Pet Insurance</li>\n<li>Sponsored life insurance</li>\n<li>Short Term Disability insurance and additional voluntary insurance</li>\n<li>Annual Class Pass credits and more!</li>\n</ul>\n<p>The anticipated annual salary for this role will range from $72,500 &#8211; $85,000, based on a variety of factors unique to each candidate, including skill set, years and depth of experience, education and certifications, competitive benchmarks, scope of responsibility, market dynamics, geographic location, and the respective state’s salary threshold for exempt employees. At Wpromote, pay ranges are subject to change and are based on specific market medians for similar jobs according to third-party salary benchmark surveys. Individual pay within that range can vary due to skills, experience, and available budget.  The total compensation package for this role will include benefits (listed above).</p>\n<p>*This position may be performed remotely in most states within the US, with some exclusions</p>\n<p>**While this role offers the flexibility to work remotely, we have office hubs in Los Angeles, Chicago, and New York, where you can join in on learning and development opportunities, fun events, take advantage of a space to work, and collaborate in person!</p>\n<p>***This position is not eligible for immigration sponsorship</p>\n<h2>You Will Be</h2>\n<ul>\n<li>Planning, developing, and implementing comprehensive paid search strategies to drive direct response and new user acquisition for your client.</li>\n<li>Utilizing business acumen to work closely with client teams to identify and fully understand business needs, campaign performance objectives, and opportunities to grow the relationship and client investments.</li>\n<li>Creating and managing paid search accounts/campaigns via various paid search marketing platforms including but not limited to: Google Ads®, Microsoft Ads®, Criteo®, etc.</li>\n<li>Managing Search, Shopping, Display, Remarketing, App Install and Video advertising campaigns.</li>\n<li>Working with direct response advertising strategies to drive sales revenue and/or qualified leads.</li>\n<li>Conducting keyword research, writing ad copy, and establishing bidding strategies to meet and exceed client KPIs.</li>\n<li>Creating and implementing campaign A/B test experiments to identify optimal campaign settings</li>\n<li>Using Google Analytics to develop insights and action items intended to improve paid search performance and meet client goals.</li>\n<li>Analyzing paid search campaign results and adjust strategy and budgets accordingly.</li>\n<li>Communicating with clients regularly to discuss goals and deliver results.</li>\n<li>Developing strategies across all marketing channels to improve client goals (eg. CPA, ROAS) and achieve maximum efficiency.</li>\n</ul>\n<h2>You Must Have</h2>\n<ul>\n<li>1.5-3 years of experience managing multiple client portfolios in paid search industry</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Excellent analytical skills</li>\n<li>Deep knowledge of the SEM industry and the paid search advertising model</li>\n<li>Experience with keyword research tools and web analytics tools (Google Analytics), as well as how to use these tools in paid search campaigns</li>\n<li>General knowledge of search engine optimization (SEO), social advertising, and web usability</li>\n<li>Strong Microsoft Excel skills: pivot tables, VLOOKUPS and chart building</li>\n<li>Extremely well organized, able to balance client timelines and business needs, possibly across multiple clients</li>\n<li>Work comfortably in dynamic, time-intensive environments where consistent fire drills and competing priorities are commonplace</li>\n<li>An understanding of customer lifetime value and optimizing towards profits based on client margins</li>\n<li>Ability to manage expectations and priorities</li>\n<li>Experience presenting to senior-level client contacts</li>\n<li>Agency experience preferred with managing multiple clients with monthly budgets ranging between $50,000-$500,000 per client</li>\n<li>Experience with Google Suite</li>\n</ul>\n<p>Wpromote is committed to bringing together individuals from different backgrounds and perspectives, providing employees with a safe and welcoming environment free of discrimination and harassment. We strive to create a diverse &amp; inclusive environment where everyone can thrive, feel a sense of belonging, and do impactful work together. As an equal opportunity employer, we prohibit any unlawful discrimination against a job applicant on the basis of their race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, family or parental status, disability*, age, veteran status, or any other status protected by the laws or regulations in the locations where we operate. We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our workplace.</p>\n<p>Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. A reasonable accommodation is a change in the way things are normally done which will ensure an equal employment opportunity without imposing undue hardship on Wpromote.</p>\n<p>This employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. If E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment. Employers can only use E-Verify once you have accepted a job offer and completed the Form I-9. For more information on E Verify, or if you believe that your employer has violated its E-Verify responsibilities, please contact DHS.</p>",
        "url": "https://jobicy.com/jobs/117019-paid-social-senior-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:27:47",
        "salary": "USD 72,500 - 85,000",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/e1003ec6a2d34525775d0bc7912ced79.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Sr. Data Engineer",
        "company": "Fleetio",
        "location": "Canada,  Mexico,  USA",
        "description": "We are looking for a senior data engineer to join our data and analytics team to help us build the next generation of our data platform and product. Together with the rest of the team, you will be responsible for the design and implementation of our data platform while also building data products for marketplaces,&amp;#8230;",
        "html_description": "<p>We are looking for a senior data engineer to join our data and analytics team to help us build the next generation of our data platform and product. Together with the rest of the team, you will be responsible for the design and implementation of our data platform while also building data products for marketplaces, integrations and analytics. Your work will encompass the full spectrum of data engineering while also crossing over into areas of software and analytical engineering.</p>\n<p>You will report to Fleetio’s Manager, Data Engineering and partner closely with our product and engineering teams as well as other internal stakeholders. This is an exciting opportunity to join a growing data-first company and push the boundaries of the modern data stack and deliver data products to our customers in new and exciting ways.</p>\n<h2>Who you are:</h2>\n<p>The ideal candidate for this role is business savvy, senior-level data engineer with experience owning and building complex data platforms and pipelines. You have a deep understanding of the data modeling, data warehousing and modern data platforms. You have experience with not just data, but back-end or full-stack development and have worked on true customer-facing products. You possess strong, but loosely held opinions about design patterns, architecture and modeling. You are passionate about solving business challenges with data and take pride in implementing scalable solutions. You have the skills to translate ambiguous and non-technical asks to specific technical tasks and deliver it incrementally . You are product-minded and team-oriented, willing to hear others&#8217; opinions and educate on best practices. You have excellent communication skills (particularly written).</p>\n<h2>Your impact:</h2>\n<ul>\n<li>Enable and scale self-serve analytics for all Fleetio team members. You&#8217;ll architect clean data sets by modeling data and metrics via tools like dbt to empower employees to make data-driven decisions with accurate information.</li>\n<li>Develop data destinations, custom integrations and maintain open source packages that allow our customers to easily integrate Fleetio data with the modern data stack.</li>\n<li>Maintain and develop custom data pipelines from operational source systems to our data platform for both streaming and batch sources.</li>\n<li>Work on development of our internal data infrastructure stack. Improve the hygiene and integrity of our data platform and ancillary tools by maintaining and monitoring the ELT pipeline.</li>\n<li>Architect, design and implement core components of our data platform beyond the traditional warehouse to include data observability, experimentation, data science and other data products.</li>\n<li>Develop and maintain streaming data pipelines from a variety of databases and data sources</li>\n<li>Collaborate with other Fleetians around the company to understand data needs and ensure required data is collected, modeled, and available to team members.</li>\n<li>Document best practices and coach/advise other data analysts, product managers, engineers, etc. on data modeling, SQL query optimization &amp; reusability, etc. Keep our data platform tidy by managing roles and permissions and deprecating old projects.</li>\n</ul>\n<h2>Your experience:</h2>\n<ul>\n<li>5+ years experience working in a data engineering or data-focused software engineering role.</li>\n<li>Experience transforming raw data into clean models using standard tools of the modern data stack and deep understanding of ELT and data modeling concepts.</li>\n<li>Experience with streaming data and pipelines such as kafka or kinesis.</li>\n<li>Proficiency in python and proven track record of delivering production-ready python applications.</li>\n<li>Experience in designing, building, and administering modern data pipelines and data warehouses</li>\n<li>Experience with dbt.</li>\n<li>Experience with semantic layers like cube or metricflow.</li>\n<li>Experience with Snowflake, BigQuery, or Redshift.</li>\n<li>Experience with version control tools such as Github or Gitlab.</li>\n<li>Experience with ELT tools such as Stitch or Fivetran.</li>\n<li>Experience with orchestration tools such as Prefect or Dagster.</li>\n<li>Experience with CI/CD and IaaC tooling such as github Actions and Terraform.</li>\n<li>Experience with business intelligence solutions (Metabase, Looker, Tableau, Periscope, Mode)</li>\n<li>Experience with serverless cloud functions (AWS Lambda, Google Cloud Functions, etc.)</li>\n<li>Excellent communication and project management skills with a customer service focused mindset.</li>\n<li>Be sure to mention &#8220;coffee&#8221; in your application so we know you read this</li>\n</ul>\n<h2>Considered a plus:</h2>\n<ul>\n<li>Experience with data marketplaces/private sharing technologies such as snowflake marketplace or AWS data exchange.</li>\n<li>Experience contributing to open-source projects.</li>\n<li>Experience with full-stack engineering.</li>\n<li>Experience with technical blogging and/or presenting at conferences.</li>\n</ul>\n<h2>Benefits:</h2>\n<ul>\n<li>Multiple health/dental coverage options</li>\n<li>Vision insurance</li>\n<li>Incentive stock options</li>\n<li>401(k) match of 4%</li>\n<li>PTO &#8211; 4 weeks</li>\n<li>12 company holidays + 2 floating holidays</li>\n<li>Parental leave- birthing parent (16 weeks paid) non-birthing (4 weeks)</li>\n<li>FSA &amp; HSA options</li>\n<li>Short and long term disability (short term 100% paid)</li>\n<li>Community service funds</li>\n<li>Professional development funds</li>\n<li>Wellbeing fund &#8211; $150 quarterly</li>\n<li>Business expense stipend- $125 quarterly</li>\n<li>Mac laptop + new hire equipment stipend</li>\n<li>Monthly catered lunches</li>\n<li>Fully stocked kitchen with tons of drinks &amp; snacks</li>\n<li>Remote working friendly since 2012 #LI-REMOTE</li>\n</ul>\n<p><em>Fleetio provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment. We celebrate diversity and are committed to creating an inclusive environment for all. All employment is decided on the basis of qualifications, merit and business need.</em></p>\n<p><em>This application is not intended to and does not create a contract or offer of employment. Employment with Fleetio is at will.</em></p>",
        "url": "https://jobicy.com/jobs/116421-senior-data-engineer-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:56:01",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/e571b83c37e0ed5371754d319be16e76.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Data Engineer",
        "company": "Branch",
        "location": "USA",
        "description": "Branch is on a mission to empower workers with financial freedom. We do this by helping companies accelerate payments and providing working Americans with accessible, free financial services. We’re committed to building and delivering more inclusive, transparent, and frictionless financial products. Our goal of empowerment extends to our own employees, too. Have a great idea?&amp;#8230;",
        "html_description": "<p>Branch is on a mission to empower workers with financial freedom. We do this by helping companies accelerate payments and providing working Americans with accessible, free financial services. We’re committed to building and delivering more inclusive, transparent, and frictionless financial products.</p>\n<p>Our goal of empowerment extends to our own employees, too. Have a great idea? Share it today and it might just get implemented tomorrow. As a member of our team, your voice and creativity matter—and they can directly impact our products, company, and culture.</p>\n<p>We not only focus on attracting great talent from across the country, but also on building teams that help that talent thrive. That means valuing a diversity of opinions and working styles, while creating a shared belief in innovation, initiative, and winning together.</p>\n<p>Come join our team as we develop new ways to improve the lives of working Americans.</p>\n<h2><strong>Responsibilities include, but are not limited to</strong></h2>\n<ul>\n<li>Develop, maintain, and optimize data pipelines to support analytics, reporting, and business intelligence needs.</li>\n<li>Design and implement data integrations across multiple backend business systems, ensuring efficient and reliable data flows.</li>\n<li>Work on streaming data processing using frameworks like Apache Beam to handle real-time data ingestion and transformation.</li>\n<li>Build and maintain APIs to enable seamless data access and sharing across internal teams and platforms.</li>\n<li>Manage orchestration and automation of workflows using Airflow on Kubernetes.</li>\n<li>Ensure data quality, security, and compliance by implementing best practices for monitoring, testing, and governance.</li>\n<li>Collaborate with analytics and engineering teams to optimize data models and improve system performance.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>3+ years of experience as a Data Engineer</li>\n<li>3+ years of using Apache Airflow in a production setting.</li>\n<li>Expert in Python and SQL</li>\n<li>Hands-on experience with cloud platforms such as Google Cloud (GCP) or AWS.</li>\n<li>Familiarity with our modern data stack:\n<ul>\n<li>Snowflake, Airflow, Apache Beam, DBT, Looker, Secoda, Fivetran, hightouch</li>\n</ul>\n</li>\n<li>BS in Computer Science or equivalent program</li>\n<li>Bonus points for:\n<ul>\n<li>Payments experience (or related industry)</li>\n<li>Experience with streaming data architectures</li>\n</ul>\n</li>\n</ul>\n<p>Ideal candidates will bring a blend of technical expertise, industry knowledge, and a deep understanding of analytics engineering best practices. Familiarity with leading-edge tools and technologies in the data landscape is essential for driving insights and innovations within our team.</p>\n<h2><strong>Compensation</strong></h2>\n<p>The base compensation range for this role is 135-150k.  The salary range displayed reflects an average base salary range for the position across all the US. The base salary offered to an applicant could be higher or lower based on each applicants’ specific skill set, depth of experience, relevant education or training, etc. The base salary range listed excludes commission/ bonus/ equity or benefits.</p>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Branch-paid medical, dental, and vision insurance</li>\n<li>Remote-first (domestic USA)</li>\n<li>Equity</li>\n<li>401k</li>\n<li>Flexible time off</li>\n<li>Paid company holidays</li>\n<li>Paid parental leave (eligible after 6 months of employment)</li>\n</ul>\n<h2><strong>Working at Branch</strong></h2>\n<p>A remote-first company with employees located throughout the U.S., Branch emphasizes transparency, accountability, and trust to create a collaborative environment where our product, engineering, marketing, customer support, customer success, and sales teams can all thrive together.  Learn more about what we do in this <a href=\"https://cdn.bfldr.com/CUTY2K5N/as/jrr3hk6csnwjhrx8phg6ppnj/The_Branch_Manifesto\">video</a>!</p>\n<p>Our collaborative spirit has helped us become an award-winning fintech company, with Branch’s innovation and workplace recognized across industries. Branch has been honored by Inc., the Webby Awards, Benzinga Fintech Awards, Fintech Breakthrough Awards, Top Workplaces USA, Great Places to Work, and EY Entrepreneur of the Year, Heartland, among others.</p>\n<p>Branch is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/115696-analytics-engineer-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:55:51",
        "salary": "USD 135,000 - 150,000",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/3b9dc47a09a30846e3c1355b50098b18.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Front End Engineer",
        "company": "Files.com",
        "location": "USA",
        "description": "We are a SaaS, Cloud-Based Managed File Transfer platform that enables organizations to securely transfer, share, and store files between users, teams, and organizations. We are looking for seasoned Front End Engineers to join our team and help us build features into our already great app. You will be working on the Files.com platform, including&amp;#8230;",
        "html_description": "<p>We are a SaaS, Cloud-Based Managed File Transfer platform that enables organizations to securely transfer, share, and store files between users, teams, and organizations. We are looking for seasoned Front End Engineers to join our team and help us build features into our already great app. You will be working on the Files.com platform, including all our client-facing web browser applications written primarily in JavaScript using React.</p>\n<h2><strong>World Class Pay and Benefits</strong></h2>\n<p>Earn a &#8220;Bay Area&#8221; Salary from Anywhere. Our pay is competitive with the top software companies in the world, with generous base salary plus equity compensation.</p>\n<p><strong>Big Company Benefits:</strong> You&#8217;ll get full  Health/Dental/Vision Insurance coverage (plus 75% of Spouse/Family coverage too),  401(k) with generous matching, 11 Company Holidays per year, and  20 PTO/Vacation days, plus we give employees off for Winter Break at the end of the year!</p>\n<p><strong>Company Macbook Pro and $1,000:</strong> We&#8217;ll send you a company issued contemporary Macbook Pro as well as $1,000 sign-on bonus as a welcome to Files.com.</p>\n<p><strong>Tight-Knit Fun-Loving Team:</strong> You will be joining a fun-loving team that works together very closely, despite the remote work environment.</p>\n<h2><strong>100% Remote Opportunity</strong></h2>\n<p>The Files.com Engineering team is 100% remote. However, we travel for regular in-person meetings with the team and the entire company to meet and work together face to face. These meetings are in cities around the US, including Scottsdale, Austin, Orlando, New Orleans, San Diego, Las Vegas, and New York City.</p>\n<p>In-person events combine work and fun and are designed to make up for the in-person interaction that occurs in an office job.</p>\n<h2><strong>About the Role</strong></h2>\n<p>As a Front End Engineer at Files.com, you will take the lead on helping build cutting edge features into the Files.com product that drive value for the 4,000 businesses that use our platform.</p>\n<p>Our API receives hundreds of requests per second and is used by both internal and external developers.</p>\n<p>Professional experience with React is a requirement for this position.</p>\n<p>Here are some examples of projects that our Developers have recently completed:</p>\n<ul>\n<li>Implementing Single-Sign-On via OAuth, SAML, and SCIM.</li>\n<li>Building a scalable engine that can convert nearly any type of files to PDF for in-browser previews (like the former Crocodoc service).</li>\n<li>Upgrading our API documentation to be automatically generated using the OpenAPI standard, and the creation of automatically-generated SDKs.</li>\n<li>Building our Universal Sync engine, which is a tool that allows Files.com users to synchronize their files to other cloud services such as S3, Azure, and Rackspace.</li>\n<li>And here are some examples of projects that our Developers will be tackling in the next 6-12 months:</li>\n<li>Implementing in-file search using Elasticsearch with custom input filters to index a plethora of document types.</li>\n<li>Building a file versioning tool that uses Git behind the scenes to give customers easy tracking of file versions.</li>\n<li>Additionally, you&#8217;ll contribute to our ongoing projects for improving security, monitoring, and performance.</li>\n</ul>\n<p>We are seeing an increase in fraudulent applications. Please note that we take preventive measures in our hiring process to authenticate a person&#8217;s identity before we hire.</p>",
        "url": "https://jobicy.com/jobs/115677-front-end-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:55:14",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/06/918df61d22e8170f1166fb6e010aaa9a.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Software Architect",
        "company": "Pearson",
        "location": "USA",
        "description": "As a Software Architect for the ExamDeveloper product, you will own the overall system design and architecture for Pearson VUE’s SaaS tool for creating exams.  In this individual contributor role you’ll be the visionary for future architecture state of ExamDeveloper and ensure that current work of the teams is aligned your architecture direction.  You’ll spend&amp;#8230;",
        "html_description": "<p>As a Software Architect for the ExamDeveloper product, you will own the overall system design and architecture for Pearson VUE’s SaaS tool for creating exams.  In this individual contributor role you’ll be the visionary for future architecture state of ExamDeveloper and ensure that current work of the teams is aligned your architecture direction.  You’ll spend most of your time on planning and design activities in close collaboration with other technical and non-technical people.</p>\n<h2><strong>The Product</strong></h2>\n<p>ExamDeveloper is a web-based exam development platform that allows our customers to write, review and manage questions on their exams.  ExamDeveloper is the leading web-based tool for creating tests to certify test-takers in the professional skills they require.   Customers rely on ExamDeveloper to support their entire workflow around question writing, collaborative review, scoring, and test management.  It is currently undergoing a significant modernization effort and there are constant opportunities to add value to this core Pearson VUE product.</p>\n<p>ExamDeveloper’s primary tech stack is .NET and C# on the backend and Angular on the frontend hosted in Microsoft Azure.  You’ll work with containerized services and Microsoft SQL Server.  Some of the work will involve .NET Framework 4.x and ASP.NET Web Forms as we are in progress with modernization.</p>\n<h2><strong>Teams</strong></h2>\n<p>The majority of the development and QA engineers are consultants located in India.  Because of this, clear communication (especially written) is important.  There is a small team of USA-based employee developers.  Support and leadership roles like Project Managers and Business Analysts are employees based in the USA.</p>\n<h2><strong>Work Location</strong></h2>\n<p>In this role it is possible to work remotely anywhere in the USA, but many people you’d regularly work with are based in the Central USA timezone in the Minneapolis, MN area.  It is required to work during most of Central USA’s normal business hours.</p>\n<h2><strong>Duties</strong></h2>\n<ul>\n<li>Create technical plans that provide for future development and operations of the ExamDeveloper product.  Proactively work to anticipate and prepare for upcoming needs.</li>\n<li>Lead the solutioning process to define and estimate the work required for upcoming features.  Act to advance our business objectives from ambiguous high-level goals into specific achievable plans.</li>\n<li>Review technical designs created by others for compatibility with current and future architecture direction.</li>\n<li>Partner closely with business stakeholders to understand customer needs and incorporate their vision into your technical direction.</li>\n<li>Act as a trusted driving force for achieving business goals.</li>\n<li>Oversee the operational costs of ExamDeveloper to ensure that our resource usage (ex: Azure cloud costs) are optimal.</li>\n<li>Set technical standards for the engineering teams together with the participation and engagement of senior engineers.</li>\n<li>Socialize and explain your decisions to other architects, managers, and business analysts in the VUE Technology organization and beyond.</li>\n<li>Build consensus for your technical vision, but also be open to competing points of view.  Suggest and justify alternatives.</li>\n<li>Collaborate effectively across many roles and across organizational boundaries.</li>\n<li>Respond to technical needs and concerns from the engineering team and give clear explanations where necessary.</li>\n<li>Communicate effectively at various levels of technical sophistication and understanding, from high-level explanations tailored to executives to “lines of code”-level explanations that junior developers can understand.</li>\n<li>Participate in development and QA work in a limited way to maintain a connection and a strong understanding of the teams’ processes and challenges.</li>\n<li>Coach other team members to help them grow and bring out their best work.</li>\n<li>React to urgent Production issues as part of a group of rotating on-call engineers.</li>\n</ul>\n<h2><strong>Required Education and Experience</strong></h2>\n<ul>\n<li>7+ years work experience as a software developer</li>\n<li>2+ years work experience as a software architect</li>\n<li>2+ years experience with Angular or similar front-end software frameworks (like React, Svelte, etc)</li>\n<li>2+ years experience with C# or similar back-end languages</li>\n<li>Experience supervising the work of technical staff either formally or informally</li>\n<li>Bachelor degree in Computer Science, MIS, or equivalent technology discipline</li>\n</ul>\n<h2><strong>Desired Knowledge, Skills, and Abilities</strong></h2>\n<ul>\n<li>Ability to produce technical designs and plans to meet business needs</li>\n<li>Experience and knowledge of cloud providers’ capabilities</li>\n<li>Relational databases</li>\n<li>DevOps workflows related to cloud-based development and deployment</li>\n<li>Experience in an Agile software development environment</li>\n<li>Demonstrated technical leadership</li>\n<li>Clear communication skills to various types of audiences</li>\n<li>History of continuous improvement</li>\n</ul>\n<p>Pearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All employment is decided based on qualifications, merit, and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status, or any other group protected by law.</p>\n<p>Learning is the most powerful force for change in the world. More than 20,000 Pearson employees deliver our products and services in nearly 200 countries, all working towards a common purpose – to help everyone achieve their potential through learning. We do that by providing high quality, digital content and learning experiences, as well as assessments and qualifications that help people build their skills and grow with the world around them. We are the world’s leading learning company. Learn more at pearsonplc.com.</p>\n<p>Pearson believes that wherever learning flourishes, so do people. We are committed to being an anti-racist company in everything we do. We value the power of an inclusive culture and a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm, and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity, and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to a sustainable environment and workplace where talent can learn, grow, and thrive.</p>",
        "url": "https://jobicy.com/jobs/116422-software-architect-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:54:44",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/c80907b6d4b64a0bd9295e304bf1ac8a.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Customer Success Manager - French or German Speaker",
        "company": "Deel",
        "location": "EMEA,  Europe",
        "description": "As a Deel IT Customer Success Manager you will be responsible for onboarding, growing and the success and satisfaction of Deel IT customers, focused on improving retention and contributing to the overall company revenue targets. You identify with the following Develop and nurture: You love to build and strengthen client relationships with your book of&amp;#8230;",
        "html_description": "<p>As a Deel IT Customer Success Manager you will be responsible for onboarding, growing and the success and satisfaction of Deel IT customers, focused on improving retention and contributing to the overall company revenue targets.</p>\n<h2>You identify with the following</h2>\n<ul>\n<li><strong>Develop and nurture:</strong> You love to build and strengthen client relationships with your book of business and do so with the long-term in mind.</li>\n<li><strong>Onboard and grow</strong>: You will onboard Deel IT customers successfully and will partner for long term growth.</li>\n<li><strong>Guide and coach:</strong> You provide tailored support, onboarding guidance and training to ensure customers are set up from for success from day one.</li>\n<li><strong>Trusted</strong> <strong>Partner:</strong> Become a trusted partner to your accounts and really give a white-glove service, where you truly understand their business needs, present and future.</li>\n<li><strong>Advocate for good:</strong> You can be the voice of the customer in Deel IT so we best understand how we can improve and deliver excellence throughout, and proactively work as project manager.</li>\n<li><strong>Ahead of the curve:</strong> You proactively identify opportunities where we can expand and grow our offering within the client.</li>\n<li><strong>Owner mindset:</strong> You’ll learn Deel&#8217;s wider product offerings inside and out to ensure that you can support your accounts in their Deel IT journey supported by our Customer Service and Operations teams.</li>\n</ul>\n<h2>What you need to succeed</h2>\n<ul>\n<li><strong>Walked the walk</strong> &#8211; You have at least 2+ years of experience in customer/client success role and really understand how to solve complex problems.</li>\n<li><strong>Competent communicator</strong> &#8211; You are an excellent communicator and you will either be fluent in French or German as well as English.</li>\n<li><strong>Expert Insight</strong> &#8211; Experience in managing a complex B2B SaaS product and quickly ramping up to becoming a product expert.</li>\n<li><strong>Creativity and drive</strong> &#8211; You have a creative approach to problem-solving and embrace the challenge with the tools at your disposal.</li>\n</ul>\n<h2><strong>Bonus Experience</strong></h2>\n<ul>\n<li>Previous experience in MDM, End Point security or SaaS for IT teams</li>\n</ul>\n<h2><strong>Total Rewards</strong></h2>\n<p>Our workforce deserves fair and competitive pay that meets them where they are. With scalable benefits, rewards, and perks, our total rewards programs reflect our commitment to inclusivity and access for all.</p>\n<h2><strong>Some things you’ll enjoy</strong></h2>\n<ul>\n<li>Provided computer equipment tailored to your role</li>\n<li>Stock grant opportunities dependent on your role, employment status and location</li>\n<li>Additional perks and benefits based on your employment status and country</li>\n<li>The flexibility of remote work, including WeWork access where available</li>\n</ul>\n<p><strong>DISCLOSURE </strong></p>\n<p>We use Covey as part of our hiring and/or promotional processes. As part of the evaluation process, we provide Covey with job requirements and candidate-submitted applications.Certain features of the platform may qualify it as an Automated Employment Decision Tool (AEDT) under applicable regulations. For positions in New York City, our use of Covey complies with NYC Local Law 144.</p>\n<p>At Deel, we’re an equal-opportunity employer that values diversity and positively encourage applications from suitably qualified and eligible candidates regardless of  race, religion, sex, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, pregnancy or maternity or other applicable legally protected characteristics.</p>\n<p><em>Deel is an equal-opportunity employer and is committed to cultivating a diverse and inclusive workplace that reflects different abilities, backgrounds, beliefs, experiences, identities and perspectives.</em></p>\n<p>Deel will provide accommodation on request throughout the recruitment, selection and assessment process for applicants with disabilities. If you require accommodation, please inform our Talent Acquisition Team at recruiting@deel.com of the nature of the accommodation that you may require, to ensure your equal participation.</p>",
        "url": "https://jobicy.com/jobs/114018-customer-success-manager-emea",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:53:30",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/282df8b52b60f8a324714ffa21cb4ed5.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Sr. Data Scientist / Staff Data Scientist",
        "company": "StackAdapt",
        "location": "UK",
        "description": "StackAdapt is a self-serve advertising platform that specializes in multi-channel solutions including native, display, video, connected TV, audio, in-game, and digital out-of-home ads. We empower hundreds of digitally-focused companies to deliver outcomes and exceptional campaign performance everyday. StackAdapt was founded with a vision to be more than an advertising platform, it’s a hub of innovation,&amp;#8230;",
        "html_description": "<p>StackAdapt is a self-serve advertising platform that specializes in multi-channel solutions including native, display, video, connected TV, audio, in-game, and digital out-of-home ads. We empower hundreds of digitally-focused companies to deliver outcomes and exceptional campaign performance everyday. StackAdapt was founded with a vision to be more than an advertising platform, it’s a hub of innovation, imagination and creativity.</p>\n<p>We are searching for a talented Data Scientist to join our engineering team as we continue to expand our data science efforts. Our platform is connected to thousands of publishers and advertisers worldwide and as a result, we&#8217;re dealing with millions of requests each second, making billions of decisions. We utilize the latest technologies to solve challenges in traffic, data storage, machine learning, and scalability.</p>\n<p>StackAdapt is a Remote First company, and we are open to candidates located anywhere in the UK for this position.</p>\n<h2>What you&#8217;ll be doing:</h2>\n<ul>\n<li>Innovate ML algorithms to maximize ROI and advertising performance. This ranges from creating entirely new algorithms, to improvements on state-of-the art methods, to development using a deep understanding of classic methods</li>\n<li>Write production code, sometimes collaborating with Data Engineers, to implement the novel ML algorithms</li>\n<li>Prototype potential algorithms and pipelines, test them using historical data, and iterate to modify based on insights</li>\n</ul>\n<h2>What you&#8217;ll bring to the table:</h2>\n<ul>\n<li>Have a Masters degree or PhD in Computer Science, Statistics, Operations Research, or a related field, with dual degrees a plus.</li>\n<li>Have the ability to take an ambiguously defined task, and break it down into actionable steps</li>\n<li>Have a comprehensive understanding of statistics, optimization and machine learning</li>\n<li>Are proficient in coding, data structures, and algorithms</li>\n<li>Enjoy working in a friendly, collaborative environment with others</li>\n</ul>\n<h2>StackAdapters enjoy:</h2>\n<ul>\n<li>Competitive salary</li>\n<li>Private Medical Insurance cover</li>\n<li>Auto-enrolment into the company pension scheme</li>\n<li>Work from home reimbursements</li>\n<li>Coverage and support of personal development initiatives (conferences, courses, etc)</li>\n<li>An awesome parental leave policy</li>\n<li>A friendly, welcoming, and supportive culture</li>\n<li>Our social and team events (virtually!)</li>\n<li>Take part in our walk and wander policy and work anywhere in the world for up to 90 days a year</li>\n</ul>\n<p>If this role speaks to you then please submit an application &#8211; we&#8217;d love to speak with you. Due to a high volume of interest, only those shortlisted for interview will be contacted.</p>\n<p><i>StackAdapt is a diverse and inclusive team of collaborative, hardworking individuals trying to make a dent in the universe. No matter who you are, where you are from, who you love, follow in faith, disability (or superpower) status, ethnicity, or the gender you identify with (if you’re comfortable, let us know your pronouns), you are welcome at StackAdapt. If you have any requests or requirements to support you throughout any part of the interview process, please let our Talent team know.</i></p>",
        "url": "https://jobicy.com/jobs/114081-sr-data-scientist-staff-data-scientist",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:52:46",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/bf5f2bb689c6f35f6cab5459f3eff869.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "People Operations Manager",
        "company": "NationBuilder",
        "location": "USA",
        "description": "At NationBuilder we create software for leaders. We work with advocacy groups, nonprofit organizations, political candidates and parties, community organizers, and anyone else trying to make something happen in the world. Our customers come in all shapes and sizes, from small town organizers trying to win their school board election, to the largest political parties,&amp;#8230;",
        "html_description": "<p>At NationBuilder we create software for leaders. We work with advocacy groups, nonprofit organizations, political candidates and parties, community organizers, and anyone else trying to make something happen in the world. Our customers come in all shapes and sizes, from small town organizers trying to win their school board election, to the largest political parties, candidates, and NGOs around the world. To learn more about NationBuilder, read about our mission, beliefs and values.</p>\n<p>NationBuilder is actively seeking a People Operations Manager. You will report directly to the VP of People &amp; Operations. You are a hands-on HR professional looking for an opportunity to learn and contribute to a thriving community culture. You will execute and optimize day-to-day HR operations across functional areas including: people analytics, compliance, HRIS/payroll system maintenance, administration of employee benefits, and internal communications.</p>\n<h2><strong>You will:</strong></h2>\n<ul>\n<li>Ensure people systems are configured and maintained in alignment with business strategies and compliance/operational requirements.</li>\n<li>Serve as subject matter expert on the HRIS and payroll infrastructure.</li>\n<li>Partner with finance to prepare domestic and global payroll.</li>\n<li>Partner with IT, finance and other department leaders to successfully execute projects and design sustainable workflows across the people tech stack.</li>\n<li>Lead the testing and promotion of new releases, configuration changes, integrations and other applicable functionality.</li>\n<li>Monitor and triage interface issues with compliance and third party vendor solutions.</li>\n<li>Work with data sources to support reporting and analytics that can be leveraged for meaningful action to impact business results and to meet all compliance requirements.</li>\n<li>Collaborate with teammates to ensure consistency, share best practices, improve processes and develop system knowledge.</li>\n<li>Partner with our Employee Benefit broker to manage the Employee Benefit program.</li>\n<li>Manage all leaves of absence.</li>\n<li>Communicate with staff on people-related matters.</li>\n</ul>\n<h2><strong>To be successful in the role, you will have:</strong></h2>\n<ul>\n<li>Ability to analyze situations and propose thoughtful solutions quickly.</li>\n<li>Highly developed communication skills, with a rich relationship to reflective listening.</li>\n<li>Ability to work collaboratively and productively with outside partners and our global team.</li>\n<li>Critical thinking and problem-solving skills that equip you to generate creative solutions to complex challenges.</li>\n<li>Current knowledge of federal and state laws, statutes, regulations, policies and directives pertaining to benefits, payroll, and human resources practices and procedures.</li>\n<li>At least 5 years of experience in HRIS administration, configuration, user administration and maintenance supported by data loads, end-user troubleshooting, etc.</li>\n<li>Skill in managing HRIS operations across organizations and managing HR systems projects with attention to detail and accuracy.</li>\n<li>Experience using best practices to increase efficiency and effectiveness of people operations and programs through technology solutions.</li>\n<li>Skill in project management and effective written functional/technical communications.</li>\n<li>A minimum of 2 years of experience administering Employee Benefits programs and leaves of absence.</li>\n</ul>\n<h2><strong>You:</strong></h2>\n<ul>\n<li>Are a community builder aligned with NationBuilder’s mission and values.</li>\n<li>Are passionate about growing people.</li>\n<li>Are conscientious.</li>\n<li>Are always learning new things independently.</li>\n<li>Are a pragmatic problem solver.</li>\n<li>Appreciate and practice direct communication.</li>\n<li>Are both an eager listener and an active communicator.</li>\n<li>Can see the big picture and execute it in fine detail.</li>\n<li>Are able to be open and creative in idea generation and methodical in execution.</li>\n<li>Have positive energy and a sense of humor.</li>\n<li>See setbacks as an opportunity to grow and to, ultimately, transform.</li>\n<li>Have a “can do” attitude.</li>\n<li>Have the insight to know what’s most important for stakeholders.</li>\n<li>Are not afraid of owning a problem and seeing it through all the way to the end.</li>\n</ul>\n<p>Remote &#8211; United States (People Operations Manager) $115,000—$145,000 USD</p>\n<p>NationBuilder is an equal opportunity employer and we value inclusion. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/114086-people-operations-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:51:20",
        "salary": "USD 115,000 - 145,000",
        "job_type": "full-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/68a45e27595eb7676a299325fadb3f89.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Email Marketing Manager - DTC E-commerce",
        "company": "Foxelli Group",
        "location": "Europe",
        "description": "As the Email Marketing Manager, you&amp;#8217;ll be a key driver in developing and executing email strategies for multiple brands. In this role, You&amp;#8217;ll oversee the end-to-end email marketing process—from crafting engaging, targeted campaigns to analyzing performance metrics, optimizing outcomes, and making data-driven decisions. This is a hands-on position where you&amp;#8217;ll take full ownership of email&amp;#8230;",
        "html_description": "<p>As the <strong>Email Marketing Manager</strong>, you&#8217;ll be a key driver in<strong> developing and executing email strategies</strong> for multiple brands. In this role, You&#8217;ll <strong>oversee the end-to-end email marketing process</strong>—from crafting engaging, targeted campaigns to <strong>analyzing performance metrics, optimizing outcomes, and making data-driven decisions</strong>.</p>\n<p>This is a hands-on position where you&#8217;ll take full ownership of email marketing across several brands, creating personalized, results-oriented experiences for a diverse customer base.</p>\n<h2><strong>RESPONSIBILITIES:</strong></h2>\n<ul>\n<li>Drive results through data-driven strategies, setting clear KPIs and guiding the team to optimize email campaigns that deliver measurable improvements in engagement, conversion, and overall ROI.</li>\n<li>Develop and execute compelling email marketing campaigns across multiple brands, delivering personalized, results-driven content that resonates with our audience.</li>\n<li>Manage and segment our email list to ensure accurate targeting, growth, and optimal performance.</li>\n<li>Craft engaging content for email campaigns that speak directly to our subscribers, using AI tools to generate copy and collaborating closely with the design team to deliver visually compelling, relevant campaigns.</li>\n<li>Oversee the email marketing calendar, ensuring timely execution of campaigns within budget and aligned with business goals.</li>\n<li>Optimize email deliverability, engagement, and conversion rates by continuously testing, refining, and implementing Klaviyo automations.</li>\n<li>Collaborate cross-functionally with other teams to ensure email strategies align with broader marketing initiatives and company objectives.</li>\n</ul>\n<h2><strong>SKILLS &amp; EXPERIENCE:</strong></h2>\n<ul>\n<li><strong>3+ years of experience in email marketing</strong>, ideally within e-commerce or digital marketing, with a proven ability to develop and execute strategic campaigns that drive engagement, conversions, and revenue growth.</li>\n<li>Expert proficiency in Klaviyo, using advanced features like segmentation, A/B testing, and automation workflows to develop highly targeted, data-driven campaigns that align with business goals and maximize ROI.</li>\n<li>Strong analytical mindset, with the ability to assess key performance metrics (e.g., open rates, click-through rates, conversions, and revenue), derive actionable insights, and pivot strategy to continually improve campaign performance and achieve strategic business targets.</li>\n<li>Exceptional written and verbal communication skills, capable of crafting compelling, on-brand email copy that not only engages but converts, tailoring messaging to different customer personas to drive high-impact results.</li>\n</ul>\n<h2><strong>THE RECRUITMENT PROCESS:</strong></h2>\n<ul>\n<li>10 min online DISC assessment to identify your behavioral style, as we strongly believe in the power of diverse teams.</li>\n<li>15-30 min intro e-meet with Foxelli Group Talent Acquisition team to discuss company, role, your experiences, and expectations.</li>\n<li>Home Task.</li>\n<li>60 min e-meet with the Hiring Manager and Foxelli Group CPO to discuss the vision of the role, your competencies, and technical skills, followed by a two-way Q&amp;A session.</li>\n<li>Decision &amp; Feedback from us.</li>\n</ul>\n<h2><strong>SALARY:</strong></h2>\n<p>Starting from €2500 after taxes, depending on your skills, competencies, and experience, with the potential for quarterly performance-based bonuses tied to KPIs.</p>\n<p>❕Please note that this role requires a self-employment certificate.</p>\n<h2><strong>PERKS &amp; BENEFITS:</strong></h2>\n<ul>\n<li>Complimentary gym memberships and company-sponsored outdoor adventures for <strong>your strength</strong> and keeping your physical well-being in check.</li>\n<li>A personal development budget is at your disposal for <strong>your</strong> <strong>personal and professional growth</strong> to ensure you keep continuously growing.</li>\n<li>Generous paid time off, including parental leave and vacation days, to recharge and rejuvenate and ensure <strong>you’re well-rested</strong>.</li>\n<li>A budget for your home office setup so <strong>you’re comfortable</strong> working how you like and where you like.</li>\n<li>Strong company <strong>culture</strong> <strong>and</strong> a <strong>network </strong>of unique individuals<strong> that celebrates you</strong>.</li>\n<li>Full flexibility with your schedule in a fully remote setting for <strong>your control</strong> of a working day, powered by Hubstaff for transparency and fairness.</li>\n</ul>\n<h2><strong>ELIGIBILITY &amp; LOCATION REQUIREMENTS:</strong></h2>\n<p>At Foxelli Group, our team operates primarily in the Eastern European Time Zone (EET), which is<strong> UTC+2</strong> and<strong> UTC+3</strong>. We also use Revolut for payments, so we are open to hiring candidates in countries where Revolut payments are supported.</p>\n<p>Currently, <strong>we are hiring in</strong> Albania, Bosnia and Herzegovina, Croatia, Czech Republic, Estonia, Greece, Georgia, Kosovo, Latvia, Lithuania, Moldova, Montenegro, North Macedonia, Poland, Portugal, Romania, Slovakia, Malta, Slovenia, Serbia, Cyprus, Bulgaria, Hungary, Netherlands, the United Kingdom, and South Africa.</p>\n<p><strong>Ready to lead Foxelli’s growth journey? Apply now!</strong></p>",
        "url": "https://jobicy.com/jobs/116437-email-marketing-manager-d2c-e-commerce-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:50:48",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/04/1854e44325283f4e2e72d126afe2c631.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    },
    {
        "title": "Executive Assistant",
        "company": "Chainlink Labs",
        "location": "Canada,  USA",
        "description": "Join Chainlink Labs, a leading decentralized oracle network company, as a high-impact Executive Assistant and strategic thought partner to our senior leadership. In this dynamic role, you’ll go beyond traditional support—serving as the right hand to our executives and playing a key role in driving operational excellence. From managing complex calendars and high-stakes meetings to&amp;#8230;",
        "html_description": "<p>Join Chainlink Labs, a leading decentralized oracle network company, as a high-impact Executive Assistant and strategic thought partner to our senior leadership. In this dynamic role, you’ll go beyond traditional support—serving as the right hand to our executives and playing a key role in driving operational excellence. From managing complex calendars and high-stakes meetings to navigating sensitive information with discretion, you’ll be trusted to anticipate needs, streamline workflows, and help power our fast-paced, high-performance journey. If you’re proactive, sharp, and thrive in an environment where every day is different, we want to meet you. This role will primarily be supporting either our Product or Engineering organizations The core hours for this role are likely to be EST or CST, but we will certainly consider other timezones.</p>\n<h2><strong>Your Impact</strong></h2>\n<ul>\n<li>Act as a gatekeeper for the executive’s time and focus &#8211; managing and prioritizing requests from across the business and the external ecosystem</li>\n<li>Successfully coordinate and execute department meetings and communications, ensuring smooth collaboration and efficient information flow</li>\n<li>Demonstrate the highest level of discretion when handling sensitive information, recognizing the importance of safeguarding the interests of Chainlink Labs</li>\n<li>Exhibit excellent written communication skills, as you will be communicating largely in text and taking important notes for various engagements</li>\n<li>Be a right-hand person to the executive team, partnering with them to help efficiently navigate their private and professional lives</li>\n<li>Own and deliver on a wide variety of projects and initiatives for the executive team</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>At least 5+ years of experience as an Executive Assistant</li>\n<li>Strong track record of supporting multiple executives either in Product or Engineering organizations</li>\n<li>Experience delivering a high touch support model, anticipating needs, and establishing seamless processes across core executive support tasks, e.g. scheduling, travel, communications, records, and reports</li>\n<li>Experience as an Executive Assistant managing sensitive data and commitment to maintaining confidentiality within a security-focused company environment</li>\n<li>Experience in a multi-time-zone/global setting</li>\n<li>Willingness to work outside usual business hours with a high sense of urgency</li>\n<li>Strong self-management, time management, and organizational skills to effectively handle multiple tasks</li>\n<li>Excellent written communication level, capable of articulating ideas and communicating clearly in writing</li>\n<li>Experience using tact, sound business judgment, a solid understanding of our business, and impeccable time management, managing and prioritizing the C-Suite’s schedule and business obligations</li>\n</ul>\n<h2><strong>Preferred Requirements</strong></h2>\n<ul>\n<li>Experience in small-medium tech startup environments, accustomed to working in agile and ownership-driven settings</li>\n<li>Event planning experience, demonstrating the ability to organize successful team off-sites for the executive’s department</li>\n<li>Experience working on a team of highly collaborative EA’s, sharing insights, representing the executives effectively, and contributing positively to our company culture</li>\n<li>Being located in EST is very strongly preferred</li>\n</ul>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).</em></p>\n<h2><strong>Commitment to Equal Opportunity</strong></h2>\n<p>Chainlink Labs is an equal opportunity employer. All qualified applicants will receive equal consideration for employment in compliance with applicable laws, regulations, or ordinances. If you need assistance or accommodation due to a disability or special need when applying for a role or in our recruitment process, please contact us via this <a href=\"https://docs.google.com/forms/d/1wrB1WRRxShkLHI7roFKlyWDobNc3ex_wfGX2Eau5FLc/edit\" target=\"_blank\" rel=\"noopener\"><u>form</u></a>.</p>",
        "url": "https://jobicy.com/jobs/117012-executive-assistant-4",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:32:04",
        "salary": "",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-22"
    }
]