[
    {
        "title": "International Freelance Recruiter (Startups and Scaleups &amp;#8211; Remote BR)",
        "company": "Companeo",
        "location": "Brazil",
        "description": "A-ha! Ready to work with a different recruitment animal?We&amp;#8217;re ambi.careers – not an average recruitment agency. We&amp;#8217;re building a talent marketplace that connects brilliant non-tech professionals with startups and scaleups that are changing the game.No BS here. After years in executive recruitment and building startups from scratch, we&amp;#8217;re sick of the empty promises, cookie-cutter approaches,...",
        "html_description": "<strong>A-ha! Ready to work with a different recruitment animal?</strong><p>We&#8217;re ambi.careers – not an average recruitment agency. We&#8217;re building a talent marketplace that connects brilliant non-tech professionals with startups and scaleups that are changing the game.<br><strong>No BS here.</strong> After years in executive recruitment and building startups from scratch, we&#8217;re sick of the empty promises, cookie-cutter approaches, and soul-crushing corporate speak that plagues this industry.We&#8217;re combining cutting-edge tech with real human insight to create something that actually works for our clients.</p><p></p><p><strong>The job</strong></p><p>It is really simple: as we are growing our candidate database and increasing clients&#8217; demand, we need support in finding, qualifying, and conducting full-cycle tech and non-tech recruitment for specific jobs. So if you feel like generating extra revenue (from 20 to 40% of the position gross fee per placed candidate &#8211; around 600 to 4.000 dollars per closed job) working remotely within a completely autonomous schedule, and have the chance to be part of something big, apply and let&#8217;s have a virtual coffee! Important to reinforce that this is a success-based freelancing role, paid by closed jobs.</p><p></p><p><strong>The job is for you if&#8230;</strong><br><strong>You have previous experience as a Freelancer Recruiter speaks Portuguese and English.</strong></p><p>You speak fluent English and Portuguese. Most of our clients and candidates are native English speakers.</p><p>You have a growth mindset. You are also contributing to building ambi.careers from the beginning, so new opportunities could appear in the mid-term.</p><p>You are fine working as a freelance contractor. Yes, no fixed salary, no benefits, no full-time employment for the moment. You take the risk as we do, and we all get paid based on the placements. We aim to be the #1 agency and marketplace for startups and scaleups, so we work with a few, but great freelance recruiters, based on a respectful and trustworthy relationship.</p><p>You have some extra time that you could invest in this, not just 15 minutes a day.</p><p></p><p><strong>﻿The job IS NOT for you if&#8230;</strong></p><p>You hate speaking with candidates and clients.</p><p>You don´t like the idea of freelancing or getting success-based commissions</p><p>You are arrogant and don´t know what empathy is</p><p></p><p>Again, <strong>English is a must</strong>, and another fluent language would be awesome. It&#8217;s quite important to have previous experience in sourcing and interviewing candidates, but if you don&#8217;t have and you learn fast and think you can f&#8230;. do it, apply, why not?</p>",
        "url": "https://jobicy.com/jobs/125182-international-freelance-recruiter-startups-and-scaleups-remote-br",
        "source": "Jobicy",
        "posted_at": "2025-07-09T20:16:45+00:00",
        "salary": "",
        "job_type": "part-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/7f3bca79-221.png",
        "job_level": "Entry-Level, Junior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "International Freelance Recruiter (Startups and Scaleups &amp;#8211; Remote Lis)",
        "company": "Companeo",
        "location": "Portugal",
        "description": "A-ha! Ready to work with a different recruitment animal?We&amp;#8217;re ambi.careers – not an average recruitment agency. We&amp;#8217;re building a talent marketplace that connects brilliant non-tech professionals with startups and scaleups that are changing the game.No BS here. After years in executive recruitment and building startups from scratch, we&amp;#8217;re sick of the empty promises, cookie-cutter approaches,...",
        "html_description": "<strong>A-ha! Ready to work with a different recruitment animal?</strong><p>We&#8217;re ambi.careers – not an average recruitment agency. We&#8217;re building a talent marketplace that connects brilliant non-tech professionals with startups and scaleups that are changing the game.<br><strong>No BS here.</strong> After years in executive recruitment and building startups from scratch, we&#8217;re sick of the empty promises, cookie-cutter approaches, and soul-crushing corporate speak that plagues this industry.We&#8217;re combining cutting-edge tech with real human insight to create something that actually works for our clients.</p><p></p><p><strong>The job</strong></p><p>It is really simple: as we are growing our candidate database and increasing clients&#8217; demand, we need support in finding, qualifying, and conducting full-cycle tech and non-tech recruitment for specific jobs. So if you feel like generating extra revenue (from 20 to 40% of the position gross fee per placed candidate &#8211; around 600 to 4.000 dollars per closed job) working remotely within a completely autonomous schedule, and have the chance to be part of something big, apply and let&#8217;s have a virtual coffee! Important to reinforce that this is a success-based freelancing role, paid by closed jobs.</p><p></p><p><strong>The job is for you if&#8230;</strong><br><strong>You have previous experience as a Freelancer Recruiter speaks Portuguese and English.</strong></p><p>You speak fluent English and Portuguese. Most of our clients and candidates are native English speakers.</p><p>You have a growth mindset. You are also contributing to building ambi.careers from the beginning, so new opportunities could appear in the mid-term.</p><p>You are fine working as a freelance contractor. Yes, no fixed salary, no benefits, no full-time employment for the moment. You take the risk as we do, and we all get paid based on the placements. We aim to be the #1 agency and marketplace for startups and scaleups, so we work with a few, but great freelance recruiters, based on a respectful and trustworthy relationship.</p><p>You have some extra time that you could invest in this, not just 15 minutes a day.</p><p></p><p><strong>﻿The job IS NOT for you if&#8230;</strong></p><p>You hate speaking with candidates and clients.</p><p>You don´t like the idea of freelancing or getting success-based commissions</p><p>You are arrogant and don´t know what empathy is</p><p></p><p>Again, <strong>English is a must</strong>, and another fluent language would be awesome. It&#8217;s quite important to have previous experience in sourcing and interviewing candidates, but if you don&#8217;t have and you learn fast and think you can f&#8230;. do it, apply, why not?</p>",
        "url": "https://jobicy.com/jobs/125181-international-freelance-recruiter-startups-and-scaleups-remote-lis",
        "source": "Jobicy",
        "posted_at": "2025-07-09T20:16:43+00:00",
        "salary": "",
        "job_type": "part-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/7f3bca79-221.png",
        "job_level": "Entry-Level, Junior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Marketing Manager (Nebius Academy, Remote)",
        "company": "TripleTen",
        "location": "Spain",
        "description": "DescriptionAbout Nebius AcademyNebius Academy (staffed by TripleTen) is an independent educational and research division of Nebius, a global AI infrastructure company. We create accessible learning programs and foster research collaborations at the intersection of AI and emerging technologies. Our team works across locations and backgrounds, united by the goal of empowering talent to build, understand,...",
        "html_description": "<h2>Description</h2><p><strong>About Nebius Academy</strong></p><p><a href=\"https://academy.nebius.com/\" rel=\"nofollow ugc noopener\" target=\"_blank\">Nebius Academy</a> (staffed by TripleTen) is an independent educational and research division of <a href=\"https://nebius.com/\" rel=\"nofollow ugc noopener\" target=\"_blank\">Nebius</a>, a global AI infrastructure company. We create accessible learning programs and foster research collaborations at the intersection of AI and emerging technologies. Our team works across locations and backgrounds, united by the goal of empowering talent to build, understand, and apply advanced AI systems.</p><p></p><p>We collaborate with top academic institutions and industry leaders, and operate with the mindset of a product-driven, impact-oriented team — valuing initiative, curiosity, and clarity of execution.</p><p></p><p>We are looking for a proactive Marketing Manager to join our core team and help scale our educational programs through strategic launches, channel experimentation, and performance-driven campaigns.</p><p></p><p></p><h2>What you will do</h2><p><strong>Core Responsibilities:</strong></p><ul><li>Plan and execute marketing campaigns: growth experiments, launches, channel testing.</li><li>Collaborate with internal teams (product, design, content, PR).</li><li>Coordinate cross-functional efforts with marketing teams from business units across the group.</li><li>Coordinate and oversee creation of marketing materials for email, landing pages, CRM, and messaging channels.</li><li>Prioritize production tasks for visuals, copy, and promo content.</li><li>Manage agency and contractors workflows for landing pages and creative assets.</li><li>Analyze marketing performance and improve funnels.</li><li>Support scaling of educational products across channels and formats.</li><li>Tailor messaging to different segments.</li><li>Conducting A/B tests for banners and messages, analyze the results, and draw conclusions</li></ul><p></p><h2>Requirements</h2><ul><li>3+ years of experience in marketing roles.</li><li>Strong project ownership and initiative.</li><li>Confident campaigns management.</li><li>Experience with CRM and automation tools (e.g. HubSpot).</li><li>Skilled in cross-functional collaboration.</li><li>Solid time management and ability to prioritize.</li><li>Upper-Intermediate or higher English level.</li><li>Background or interest in AI-powered products.</li><li>Experience using analytics to drive marketing decisions.</li><li>Attention to detail and commitment to quality.</li></ul><p></p><h2>What we can offer you</h2><ul><li>Full-time remote contract with a flexible schedule.</li><li>3.5k &#8211; 4.5k euro monthly gross pay, based on experience and demonstrated business impact. </li><li>A close-knit, international team of thoughtful and driven professionals.</li><li>All software licenses and remote work tools you need to be successful in a remote working environment (Slack, Miro, Notion, Zoom, etc)</li><li>Room for growth as we scale our portfolio of educational products and formats.</li></ul>",
        "url": "https://jobicy.com/jobs/125107-marketing-manager-nebius-academy-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-09T05:48:43+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/69106838-221.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Staff Product Designer (100% remote role in EMEA)",
        "company": "Testlio",
        "location": "EMEA",
        "description": "Location: Remote in EMEA.About the job Testlio’s fully managed crowdsourced testing platform integrates expert, on-demand testers directly into your release process. Ship faster and more confidently with global coverage across 600,000+ devices, 800+ payment methods, 150+ countries, and 100+ languages. To learn more, visit www.testlio.com.We’re looking for a Staff Product Designer to own end-to-end design across our...",
        "html_description": "<p>Location: Remote in EMEA.</p><h2>About the job </h2><p>Testlio’s fully managed crowdsourced testing platform integrates expert, on-demand testers directly into your release process. Ship faster and more confidently with global coverage across 600,000+ devices, 800+ payment methods, 150+ countries, and 100+ languages. To learn more, visit <a href=\"https://testlio.com/\" rel=\"nofollow ugc noopener\" target=\"_blank\">www.testlio.com</a>.</p><p>We’re looking for a <strong>Staff Product Designer</strong> to own end-to-end design across our product and help define how design works at Testlio.</p><h2>Why you will love this job?</h2><ul>\n<li><strong>You’ll shape the product, not just design it</strong>. With no product managers, design leads the work. You’ll drive direction, own decisions, and collaborate directly with engineers who care about quality.</li>\n<li><strong>You’ll work on everything</strong>. From redesigning legacy tools to launching new features and improving design systems. Your work will shape how the platform feels end to end.</li>\n<li><strong>You’ll help define the design culture</strong>. You’re joining early and will set the standard for how we work.</li>\n</ul><h2>Why you will love being a part of Testlio?</h2><ul>\n<li><strong>Great Culture:</strong> Testlio is a female-founded company, and half our team identifies as women. We’re proud of our <a href=\"https://testlio.com/culture/\" rel=\"nofollow ugc noopener\" target=\"_blank\">inclusive, purpose-driven culture </a>where people genuinely enjoy collaborating. As part of our team (we call ourselves TestLions), you’ll help create exceptional digital experiences for our customers, while also contributing to our freelance network and social impact initiatives like <a href=\"https://testlio.com/ignite/\" rel=\"nofollow ugc noopener\" target=\"_blank\">Ignite.</a></li>\n<li><strong>Remote Work: </strong>Our culture is built around remote work. We’ve created systems to allow us to successfully work together asynchronously as a <a href=\"https://testlio.com/blog/building-a-strong-culture-remotely/\" rel=\"nofollow ugc noopener\" target=\"_blank\">fully remote and globally distributed team. </a>Testlio provides the tools and guidance for everyone to succeed in their careers in a fully remote setting. Our working style encourages everyone to make decisions, communicate effectively, and work at a sustainable pace. </li>\n<li><strong>Investment in You: </strong>Your growth and well-being matter to us. You’ll have flexible paid time off—including national holidays, personal days, and sick days—plus stock options so you can grow with Testlio. We also provide a $300 annual learning stipend to support your personal and professional development.</li>\n<li><strong>Winning Business:</strong> Testlio is growing, profitable, and cash-strong. We are leading our industry with <a href=\"https://testlio.com/customers/\" rel=\"nofollow ugc noopener\" target=\"_blank\">exceptional clients</a> who provide us with a high NPS score and a 4.7 rating on G2. Our business model is global, enterprise, and subscription-based. Several of our largest clients have been with us for 7+ years, and many spend $500K+/year with Testlio. </li>\n</ul><h2>What would your day look like?</h2><ul>\n<li>Leading cross-functional discussions to define product functionality and user flows.</li>\n<li>Making strategic product decisions alongside engineering.</li>\n<li>Crafting high-fidelity, production-ready designs that meet both user and business needs, with strong attention to detail, visual polish, and usability.</li>\n<li>Prototyping and iterating on new features to explore ideas and validate interactions</li>\n<li>Creating clear, useful documentation to support implementation and ensure alignment, helping to foster a culture of constructive critique and iteration.</li>\n<li>Collaborating with engineers to refine edge cases, ensure feasibility, and uphold design quality.</li>\n<li>You’ll evolve our design system to support scalability and consistency across the platform.</li>\n</ul><h2>What do you need to succeed?</h2><p><strong>Technical Skills</strong></p><ul>\n<li><strong>Extensive Design Experience</strong>: 7+ years in product design, with a portfolio showing end-to-end ownership of complex products, especially in B2B SaaS.</li>\n<li><strong>Design Systems Expertise</strong>: Proven expertise in building and scaling design systems, evolving them without creating overhead.</li>\n<li><strong>Cross-Functional Collaboration</strong>: Strong collaboration with engineering teams, with the ability to communicate design intent clearly and effectively.</li>\n<li><strong>User-Centered Design</strong>: Confident application of UX principles to deliver user-focused solutions, balancing experience, intuition, and established patterns over formal research when appropriate.</li>\n</ul><p><strong>Human Skills</strong></p><ul>\n<li>Strategic mindset to connect design decisions with product and business outcomes.</li>\n<li>Comfort working in ambiguous situations, proactively driving projects forward without complete information.</li>\n<li>Clear and concise written and verbal communication skills, with openness to feedback and critical questions.</li>\n<li>Leadership through context and example, setting high standards through individual contributions and collaboration.</li>\n<li>Curiosity and commitment to continuous learning, staying up to date with tools and trends in design systems, front-end development, and AI.</li>\n</ul><h2>What is the application process?</h2><p>We do our best to bring on individuals who will be excited about their role and have the potential for a great future with Testlio. Since we are 100% distributed, we’d like you to meet with multiple people from our organization to give you an idea of who you would be working with, your role expectations, etc. Our interview process can take about 3 to 4 weeks to complete. </p><ul>\n<li>Application</li>\n<li>Recruiter interview</li>\n<li>TestGorilla assessment</li>\n<li>~ 3# Team and Stakeholder interviews</li>\n<li>Reference checks</li>\n<li>Offer</li>\n</ul><h2>Diversity and Inclusion</h2><p>Testlio is an equal-opportunity employer deeply committed to creating an inclusive environment for people of all backgrounds and identities. We are female-founded, and 46% of our team members identify as women. For more information, see the <a href=\"https://testlio.com/diversity-equity-and-inclusion/\" rel=\"nofollow ugc noopener\" target=\"_blank\">DEI section</a> of our website.</p>",
        "url": "https://jobicy.com/jobs/124989-staff-product-designer-100-remote-role-in-emea",
        "source": "Jobicy",
        "posted_at": "2025-07-08T05:22:57+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/11024036-221.png",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Sr. Security Researcher (Remote, GBR)",
        "company": "CrowdStrike",
        "location": "UK",
        "description": "As a global leader in cybersecurity, CrowdStrike protects the people, processes and technologies that drive modern organizations. Since 2011, our mission hasn’t changed — we’re here to stop breaches, and we’ve redefined modern security with the world’s most advanced AI-native platform. Our customers span all industries, and they count on CrowdStrike to keep their businesses...",
        "html_description": "<p>As a global leader in cybersecurity, CrowdStrike protects the people, processes and technologies that drive modern organizations. Since 2011, our mission hasn’t changed — we’re here to stop breaches, and we’ve redefined modern security with the world’s most advanced AI-native platform. Our customers span all industries, and they count on CrowdStrike to keep their businesses running, their communities safe and their lives moving forward. We’re also a mission-driven company. We cultivate a culture that gives every CrowdStriker both the flexibility and autonomy to own their careers. We’re always looking to add talented CrowdStrikers to the team who have limitless passion, a relentless focus on innovation and a fanatical commitment to our customers, our community and each other. Ready to join a mission that matters? The future of cybersecurity starts with you.</p><p><b>About the Role:</b></p><p>CrowdStrike is looking for a self-starting, action-oriented, and highly motivated Senior Security Researcher to join our Counter Adversary Operations Team. This position will require the candidate to track and collect information related to Russian-language eCrime actors, tools, tradecraft, and techniques in a wide variety of environments, to include the deep and dark web and is instrumental in providing unique insight into finished Intelligence products used by CrowdStrike customers and stakeholders.</p><p>The successful candidate will be an operational security (OPSEC)-savvy, detail-oriented problem solver, and have substantial experience driving concurrent projects and execute assigned tasks to completion with minimal direction.</p><p>Highly qualified candidates will be a subject matter expert on Russian/Eastern-European eCrime cyber threat actors, have significant experience conducting advanced engagement and research pertaining to Russian/Eastern-European eCrime activity, possess a solid understanding of threat intelligence, have strong open source (OSINT) research skills, and be comfortable with internal and cross-team collaboration.</p><p><b>What You&#8217;ll Do</b>:</p><ul><li><p>Collect unique, relevant actionable, and timely information to answer established standing and ad hoc requirements related to Russian/Eastern-European eCrime actors.</p></li><li><p>Leverage advanced engagement skills and OSINT tradecraft to follow up on leads and identify Russian/Eastern-European eCrime threat actors and track them in various online communities.</p></li><li><p>Identify current and emerging cyber threats and trends pertaining to Russian/Eastern-European eCrime, including technical information.</p></li><li><p>Create consistently clear, highly-contextualised internal reports of collected information in a way that enables robust analysis.</p></li><li><p>Collaborate with teams producing analytical reports and threat estimates pertaining to Russian/Eastern-European eCrime topics.</p></li><li><p>Employ secure virtual operational tradecraft methods and practices.</p></li></ul><p><b>What You&#8217;ll Need:</b></p><p><b>Required: </b></p><ul><li><p>Extensive experience navigating a wide variety of cyber threat actor environments, to include social media, hidden services, and forums.</p></li><li><p>In-depth familiarity with a wide variety of Russian-language eCrime groups.</p></li><li><p>Practical knowledge of technical terminology, tools, and tactics employed by eCrime actors, particularly those used by Russian-language eCrime actors.</p></li><li><p>Ability to perform comprehensive direct engagement and OSINT investigations using Russian-language skills.</p></li><li><p>Ability to adapt quickly to changing environments and identify creative solutions to difficult problems and scenarios with persistence. Tenacity is key.</p></li><li><p>Ability to work as part of a team, as well as independently and proactively.</p></li><li><p>Ability to work effectively under tight deadlines with minimal guidance.</p></li><li><p>Excellent attention to detail.</p></li></ul><p><b>Preferred:</b></p><ul><li><p>Additional background in Russian/Eastern European geopolitical issues and language capabilities including, but not limited to, Russian and Ukrainian.</p></li><li><p>Prior intelligence community, human intelligence (HUMINT), or cyber threat intelligence background highly preferred. Practical experience with virtual HUMINT is highly desirable.</p></li></ul><p>#LI-EV1</p><p>#LI-Remote</p><p><b>Benefits of Working at CrowdStrike: </b></p><ul><li><p>Remote-friendly and flexible work culture</p></li><li><p>Market leader in compensation and equity awards</p></li><li><p>Comprehensive physical and mental wellness programs</p></li><li><p>Competitive vacation and holidays for recharge</p></li><li><p>Paid parental and adoption leaves</p></li><li><p>Professional development opportunities for all employees regardless of level or role</p></li><li><p>Employee Networks, geographic neighborhood groups, and volunteer opportunities to build connections</p></li><li><p>Vibrant office culture with world class amenities</p></li><li><p>Great Place to Work Certified™ across the globe </p></li></ul><p>CrowdStrike is proud to be an equal opportunity employer. We are committed to fostering a culture of belonging where everyone is valued for who they are and empowered to succeed. We support veterans and individuals with disabilities through our affirmative action program.</p><p>CrowdStrike is committed to providing equal employment opportunity for all employees and applicants for employment. The Company does not discriminate in employment opportunities or practices on the basis of race, color, creed, ethnicity, religion, sex (including pregnancy or pregnancy-related medical conditions), sexual orientation, gender identity, marital or family status, veteran status, age, national origin, ancestry, physical disability (including HIV and AIDS), mental disability, medical condition, genetic information, membership or activity in a local human rights commission, status with regard to public assistance, or any other characteristic protected by law. We base all employment decisions&#8211;including recruitment, selection, training, compensation, benefits, discipline, promotions, transfers, lay-offs, return from lay-off, terminations and social/recreational programs&#8211;on valid job requirements.</p><p>If you need assistance accessing or reviewing the information on this website or need help submitting an application for employment or requesting an accommodation, please contact us at <a href=\"mailto:recruiting@crowdstrike.com\" rel=\"nofollow ugc noopener\" target=\"_blank\">recruiting@crowdstrike.com</a> for further assistance.</p>",
        "url": "https://jobicy.com/jobs/124957-sr-security-researcher-remote-gbr",
        "source": "Jobicy",
        "posted_at": "2025-07-07T18:37:04+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/1d9a6db9-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Tech Lead – .Net / C# (Remote &amp;#8211; Mexico Only)",
        "company": "Varicent",
        "location": "Mexico",
        "description": "At Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the 2025 Forrester Wave Report...",
        "html_description": "<p>\nAt Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the <em>2025 Forrester Wave Report for SPM</em>, <em>2023 Ventana Research Revenue Performance Management (RPM) Value Index</em>, <em>Gartner Peer Insights</em>, <em>2024 Gartner SPM Market Guide</em>, and <em>G2. </em>Our solutions are trusted by a diverse range of global industry leaders like T-Mobile, ServiceNow, Wawanesa Bank, Shaw Industries, Moody&#8217;s, Stryker and hundreds more. Here’s why you’ll thrive at Varicent:\n</p><ul>\n<li><strong>Innovate with Purpose: Build impactful solutions for customers worldwide.</strong></li>\n<li><strong>Join Excellence: Work in a diverse, collaborative, and innovative team.</strong></li>\n<li><strong>Shape the Future: Lead in redefining revenue optimization.</strong></li>\n<li><strong>Grow Together: Unlock your potential in a supportive environment.</strong></li>\n</ul><p>\nJoin us at Varicent—where your talent and ambition meet limitless opportunities for success!</p><p>Drive innovation. Build scalable systems. Impact real users.<br>Join the Incentives Development team at Varicent, where we combine cutting-edge tech, cross-functional collaboration, and a passion for delivering exceptional user experiences.</p><p>We’re looking for a Backend Tech Lead who’s excited to lead development on a high-scale product using C# and AWS, and who thrives in a fast-moving, remote-first environment.</p><p><strong> What You’ll Work On<br></strong></p><ul>\n<li>Develop and optimize RESTful APIs in C#, supporting a modern React/Redux web app.</li>\n<li>Lead feature development and cloud architecture improvements in AWS (Lambda, S3, DynamoDB, Redshift).</li>\n<li>Contribute to our CI/CD automation and Infrastructure as Code using CloudFormation.</li>\n<li>Collaborate with designers, QA, and product managers to build features that scale.</li>\n<li>Own performance, availability, and security of backend services used by enterprise clients.</li>\n</ul><p>✅ <strong>What You Bring</strong></p><ul>\n<li>7+ years of backend experience (preferably C#), focused on data-heavy applications.</li>\n<li>Strong understanding of scalable systems, microservices, and software design principles.</li>\n<li>Hands-on experience with AWS services and cloud architecture.</li>\n<li>Familiarity with ETL/ELT pipelines, and performance optimization for large datasets.</li>\n<li>Passion for clean code, knowledge sharing, and continuous improvement.</li>\n<li>Fluent in English and effective in remote, collaborative team settings.</li>\n<li>End-to-end experience across the full development lifecycle—from planning and architecture to deployment and optimization.</li>\n</ul><p> <strong>Your First 90 Days</strong></p><p>Day 1–30: Learn the codebase, tools, and team practices. Tackle a few well-scoped tasks.<br>Day 31–60: Independently deliver features. Get active in code reviews. Share input during planning.<br>Day 61–90: Lead development on a major feature. Own performance, testing, and delivery. Start influencing roadmap and architecture.</p><p> <strong>Remote Culture &amp; Flexibility</strong></p><ul>\n<li>This is a remote role—work from anywhere, but align with EST business hours.</li>\n<li>Results over hours: we support autonomy, balance, and continuous learning.</li>\n<li>You’ll be hired through our Professional Employer Organization (PEO) and may later transition to a local Varicent entity with full recognition of your tenure and role.</li>\n</ul><p> Make an impact with a team that values code quality, innovation, and results.</p><p><strong><em> Benefits</em></strong> </p><ul>\n<li>Market Leading Compensation Package.</li>\n<li>Wellness Programs to Support Health and Wellbeing.</li>\n<li>Working with the latest tools and technologies in a fast-paced environment.</li>\n<li>Remote Work Flexibility.</li>\n<li>Comprehensive Employee Insurance Coverage: Medical, Dental, Vision, Life Insurance.</li>\n<li>Annual Time Off: Time off is provided in accordance with applicable legislative requirements.</li>\n<li>Global Connected Culture: Hubs in Romania, UK, US, Canada.</li>\n<li>Dynamic Work Culture: Thrive in our innovative and multicultural environment.</li>\n<li>Grow with Us: Continuous development opportunities.</li>\n</ul><p>\nVaricent is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. If you require accommodation at any time during the recruitment process please email accomodations@varicent.com Varicent is also committed to compliance with all fair employment practices regarding citizenship and immigration status. By applying for a position at Varicent and/or by using this portal, you declare and confirm that you have read and agree to our<a href=\"https://www.varicent.com/recruitment-portal-privacy-notice\" rel=\"nofollow ugc noopener\" target=\"_blank\"> Job Applicant Privacy Notice</a> and that the information provided by you as part of your application is true and complete and includes no misrepresentation or material omission of fact\n</p>",
        "url": "https://jobicy.com/jobs/124751-tech-lead-net-c-remote-mexico-only",
        "source": "Jobicy",
        "posted_at": "2025-07-06T04:56:07+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/c86166a8-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Backend Tech Lead – .Net / C# (Remote &amp;#8211; Mexico Only)",
        "company": "Varicent",
        "location": "Mexico",
        "description": "At Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the 2025 Forrester Wave Report...",
        "html_description": "<p>\nAt Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the <em>2025 Forrester Wave Report for SPM</em>, <em>2023 Ventana Research Revenue Performance Management (RPM) Value Index</em>, <em>Gartner Peer Insights</em>, <em>2024 Gartner SPM Market Guide</em>, and <em>G2. </em>Our solutions are trusted by a diverse range of global industry leaders like T-Mobile, ServiceNow, Wawanesa Bank, Shaw Industries, Moody&#8217;s, Stryker and hundreds more. Here’s why you’ll thrive at Varicent:\n</p><ul>\n<li><strong>Innovate with Purpose: Build impactful solutions for customers worldwide.</strong></li>\n<li><strong>Join Excellence: Work in a diverse, collaborative, and innovative team.</strong></li>\n<li><strong>Shape the Future: Lead in redefining revenue optimization.</strong></li>\n<li><strong>Grow Together: Unlock your potential in a supportive environment.</strong></li>\n</ul><p>\nJoin us at Varicent—where your talent and ambition meet limitless opportunities for success!</p><p>Drive innovation. Build scalable systems. Impact real users.<br>Join the Incentives Development team at Varicent, where we combine cutting-edge tech, cross-functional collaboration, and a passion for delivering exceptional user experiences.</p><p>We’re looking for a Backend Tech Lead who’s excited to lead development on a high-scale product using C# and AWS, and who thrives in a fast-moving, remote-first environment.</p><p><strong> What You’ll Work On<br></strong></p><ul>\n<li>Develop and optimize RESTful APIs in C#, supporting a modern React/Redux web app.</li>\n<li>Lead feature development and cloud architecture improvements in AWS (Lambda, S3, DynamoDB, Redshift).</li>\n<li>Contribute to our CI/CD automation and Infrastructure as Code using CloudFormation.</li>\n<li>Collaborate with designers, QA, and product managers to build features that scale.</li>\n<li>Own performance, availability, and security of backend services used by enterprise clients.</li>\n</ul><p>✅ <strong>What You Bring</strong></p><ul>\n<li>7+ years of backend experience (preferably C#), focused on data-heavy applications.</li>\n<li>Strong understanding of scalable systems, microservices, and software design principles.</li>\n<li>Hands-on experience with AWS services and cloud architecture.</li>\n<li>Familiarity with ETL/ELT pipelines, and performance optimization for large datasets.</li>\n<li>Passion for clean code, knowledge sharing, and continuous improvement.</li>\n<li>English fluency (B2+), and the ability to thrive in a collaborative, remote team.</li>\n</ul><p> <strong>Your First 90 Days</strong></p><p>Day 1–30: Learn the codebase, tools, and team practices. Tackle a few well-scoped tasks.<br>Day 31–60: Independently deliver features. Get active in code reviews. Share input during planning.<br>Day 61–90: Lead development on a major feature. Own performance, testing, and delivery. Start influencing roadmap and architecture.</p><p> <strong>Remote Culture &amp; Flexibility</strong></p><ul>\n<li>This is a remote role—work from anywhere, but align with EST business hours.</li>\n<li>Results over hours: we support autonomy, balance, and continuous learning.</li>\n<li>You’ll be hired through our Professional Employer Organization (PEO) and may later transition to a local Varicent entity with full recognition of your tenure and role.</li>\n</ul><p> Make an impact with a team that values code quality, innovation, and results.</p><p><strong><em> Benefits</em></strong> </p><ul>\n<li>Market Leading Compensation Package.</li>\n<li>Wellness Programs to Support Health and Wellbeing.</li>\n<li>Working with the latest tools and technologies in a fast-paced environment.</li>\n<li>Remote Work Flexibility.</li>\n<li>Comprehensive Employee Insurance Coverage: Medical, Dental, Vision, Life Insurance.</li>\n<li>Annual Time Off: Time off is provided in accordance with applicable legislative requirements.</li>\n<li>Global Connected Culture: Hubs in Romania, UK, US, Canada.</li>\n<li>Dynamic Work Culture: Thrive in our innovative and multicultural environment.</li>\n<li>Grow with Us: Continuous development opportunities.</li>\n</ul><p>\nVaricent is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. If you require accommodation at any time during the recruitment process please email accomodations@varicent.com Varicent is also committed to compliance with all fair employment practices regarding citizenship and immigration status. By applying for a position at Varicent and/or by using this portal, you declare and confirm that you have read and agree to our<a href=\"https://www.varicent.com/recruitment-portal-privacy-notice\" rel=\"nofollow ugc noopener\" target=\"_blank\"> Job Applicant Privacy Notice</a> and that the information provided by you as part of your application is true and complete and includes no misrepresentation or material omission of fact\n</p>",
        "url": "https://jobicy.com/jobs/124750-backend-tech-lead-net-c-remote-mexico-only",
        "source": "Jobicy",
        "posted_at": "2025-07-06T04:56:05+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/c86166a8-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Tech Lead – C# / .Net (Remote &amp;#8211; Mexico Only)",
        "company": "Varicent",
        "location": "Mexico",
        "description": "At Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the 2025 Forrester Wave Report...",
        "html_description": "<p>\nAt Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the <em>2025 Forrester Wave Report for SPM</em>, <em>2023 Ventana Research Revenue Performance Management (RPM) Value Index</em>, <em>Gartner Peer Insights</em>, <em>2024 Gartner SPM Market Guide</em>, and <em>G2. </em>Our solutions are trusted by a diverse range of global industry leaders like T-Mobile, ServiceNow, Wawanesa Bank, Shaw Industries, Moody&#8217;s, Stryker and hundreds more. Here’s why you’ll thrive at Varicent:\n</p><ul>\n<li><strong>Innovate with Purpose: Build impactful solutions for customers worldwide.</strong></li>\n<li><strong>Join Excellence: Work in a diverse, collaborative, and innovative team.</strong></li>\n<li><strong>Shape the Future: Lead in redefining revenue optimization.</strong></li>\n<li><strong>Grow Together: Unlock your potential in a supportive environment.</strong></li>\n</ul><p>\nJoin us at Varicent—where your talent and ambition meet limitless opportunities for success!</p><p>Drive innovation. Build scalable systems. Impact real users.<br>Join the Incentives Development team at Varicent, where we combine cutting-edge tech, cross-functional collaboration, and a passion for delivering exceptional user experiences.</p><p>We’re looking for a Backend Tech Lead who’s excited to lead development on a high-scale product using C# and AWS, and who thrives in a fast-moving, remote-first environment.</p><p><strong> What You’ll Work On<br></strong></p><ul>\n<li>Develop and optimize RESTful APIs in C#, supporting a modern React/Redux web app.</li>\n<li>Lead feature development and cloud architecture improvements in AWS (Lambda, S3, DynamoDB, Redshift).</li>\n<li>Contribute to our CI/CD automation and Infrastructure as Code using CloudFormation.</li>\n<li>Collaborate with designers, QA, and product managers to build features that scale.</li>\n<li>Own performance, availability, and security of backend services used by enterprise clients.</li>\n</ul><p>✅ <strong>What You Bring</strong></p><ul>\n<li>7+ years of backend experience (preferably C#), focused on data-heavy applications.</li>\n<li>Strong understanding of scalable systems, microservices, and software design principles.</li>\n<li>Hands-on experience with AWS services and cloud architecture.</li>\n<li>Familiarity with ETL/ELT pipelines, and performance optimization for large datasets.</li>\n<li>Passion for clean code, knowledge sharing, and continuous improvement.</li>\n<li>Fluent in English and effective in remote, collaborative team settings.</li>\n<li>End-to-end experience across the full development lifecycle—from planning and architecture to deployment and optimization.</li>\n</ul><p> <strong>Your First 90 Days</strong></p><p>Day 1–30: Learn the codebase, tools, and team practices. Tackle a few well-scoped tasks.<br>Day 31–60: Independently deliver features. Get active in code reviews. Share input during planning.<br>Day 61–90: Lead development on a major feature. Own performance, testing, and delivery. Start influencing roadmap and architecture.</p><p> <strong>Remote Culture &amp; Flexibility</strong></p><ul>\n<li>This is a remote role—work from anywhere, but align with EST business hours.</li>\n<li>Results over hours: we support autonomy, balance, and continuous learning.</li>\n<li>You’ll be hired through our Professional Employer Organization (PEO) and may later transition to a local Varicent entity with full recognition of your tenure and role.</li>\n</ul><p> Make an impact with a team that values code quality, innovation, and results.</p><p><strong><em> Benefits</em></strong> </p><ul>\n<li>Market Leading Compensation Package.</li>\n<li>Wellness Programs to Support Health and Wellbeing.</li>\n<li>Working with the latest tools and technologies in a fast-paced environment.</li>\n<li>Remote Work Flexibility.</li>\n<li>Comprehensive Employee Insurance Coverage: Medical, Dental, Vision, Life Insurance.</li>\n<li>Annual Time Off: Time off is provided in accordance with applicable legislative requirements.</li>\n<li>Global Connected Culture: Hubs in Romania, UK, US, Canada.</li>\n<li>Dynamic Work Culture: Thrive in our innovative and multicultural environment.</li>\n<li>Grow with Us: Continuous development opportunities.</li>\n</ul><p>\nVaricent is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. If you require accommodation at any time during the recruitment process please email accomodations@varicent.com Varicent is also committed to compliance with all fair employment practices regarding citizenship and immigration status. By applying for a position at Varicent and/or by using this portal, you declare and confirm that you have read and agree to our<a href=\"https://www.varicent.com/recruitment-portal-privacy-notice\" rel=\"nofollow ugc noopener\" target=\"_blank\"> Job Applicant Privacy Notice</a> and that the information provided by you as part of your application is true and complete and includes no misrepresentation or material omission of fact\n</p>",
        "url": "https://jobicy.com/jobs/124749-tech-lead-c-net-remote-mexico-only",
        "source": "Jobicy",
        "posted_at": "2025-07-06T04:56:04+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/c86166a8-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Senior Business Analyst &amp;#8211; Insurance (Fully Remote)",
        "company": "CoverGo",
        "location": "Thailand",
        "description": "Top 3 Reasons To Join Us Competitive Salary 100% Remote Working on the latest tech for the Insurtech Market Leader About UsAt CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone. We are a leading global no-code insurance platform for health, life, and P&amp;amp;C We’re the...",
        "html_description": "<h2><strong>Top 3 Reasons To Join Us</strong></h2><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h2><strong>About Us</strong></h2><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We&#8217;re an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h2><strong>What You Will Do:</strong></h2><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h2><strong>What We Need:</strong></h2><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required </li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills are a plus</li> <li>Must be based in Thailand</li> <li>Must be fluent in Thai</li> </ul><h2><strong>Why You&#8217;ll Love Working Here</strong></h2><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow ugc noopener\" target=\"_blank\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow ugc noopener\" target=\"_blank\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p>",
        "url": "https://jobicy.com/jobs/124738-senior-business-analyst-insurance-fully-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-06T04:50:18+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Business Development",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/d3d7ed78-221-1.png",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Software Engineer &amp;#8211; System Design &amp;#038; Reliability &amp;#8211; Full remote (H/F)",
        "company": "Voyage Privé",
        "location": "France",
        "description": "Description de l&amp;#8217;entrepriseCompany Description Born in France in 2006, Voyage Privé has grown from an ambitious startup into becoming the Europe&amp;#8217;s leading travel tech platform. Operating across 9 markets with tens of millions of users, we&amp;#8217;re not just another e-commerce success story &amp;#8211; we&amp;#8217;re a tech powerhouse revolutionizing online travel. As a mission-driven company, we&amp;#8217;re unique...",
        "html_description": "<h2>Description de l&#8217;entreprise</h2><p>Company Description </p><p>Born in France in 2006, Voyage Privé has grown from an ambitious startup into becoming the Europe&#8217;s leading travel tech platform. Operating across 9 markets with tens of millions of users, we&#8217;re not just another e-commerce success story &#8211; we&#8217;re a tech powerhouse revolutionizing online travel. </p><p>As a mission-driven company, we&#8217;re unique in combining cutting-edge technology with social impact. Our innovative campus brings together tech talent, professional athletes, students, and artists, creating an ecosystem where digital innovation drives both business growth and positive change. </p><p>We&#8217;re now at an inflection point, upgrading our entire technical foundation with cloud architecture, AI, and real-time systems to become a reference and top-of-mind platform for luxury travel, known by travelers for its for excellent offer and customer experience, and by our providers as a high-performance business development partner. </p><p>Why Join Us?</p><p>Work at the intersection of cutting-edge technology and a mission-driven company, transforming how millions experience travel.</p><p>Be part of an entrepreneurial team of innovators that isn&#8217;t just building technology: we value innovation, ownership, and collaboration, with an emphasis on empowering engineers to make a difference.</p><p>Shape a fast-growing tech company as we embark on an ambitious plan to scale tenfold in the next decade.</p><p>Enjoy a workplace that invests in personal and professional development, offering learning programs, mentorship opportunities, and career growth pathways</p><h2>Description du poste</h2><p><strong>The Opportunity</strong></p><p>At <strong>Voyage Privé</strong>, we are building the next generation of our technology platform to scale our impact and accelerate innovation. As we evolve from a legacy environment to a high-performance architecture, we are forming a team of skilled engineers committed to craftsmanship, ownership, and business impact.</p><p>As a <strong>Senior Software Engineer</strong>, you will play a key role in delivering complex features end-to-end, designing reliable and scalable systems, and helping modernize our software ecosystem. You’ll lead technical delivery within your domain, guide less experienced engineers, and ensure that quality, security, and performance are integral to everything we build.</p><p>You’ll join a culture that values engineering rigor, curiosity, and clear business alignment, and where your code, ideas, and decisions will shape the transformation of our platform and product.</p><p><strong>Your Mission</strong></p><ul><li><strong>Own Systems End-to-End</strong>: Design, develop, and maintain services or features that are scalable, maintainable, and meet business goals.</li><li><strong>Build for Quality</strong>: Write well-structured, tested, and secure code. Help set team standards in test coverage, CI/CD, and observability.</li><li><strong>Be Actively Hands-On</strong>: Deliver complex code contributions, participate in deep code reviews, and drive incremental architectural improvements through implementation.</li><li><strong>Implement Resilient Systems</strong>: Design for high availability and performance using asynchronous patterns, stateless architectures, and fault-tolerant strategies.</li><li><strong>Ensure Data Integrity</strong>: Contribute to system designs that guarantee consistency, accuracy, and safe state transitions across distributed services.</li><li><strong>Collaborate Cross-Functionally</strong>: Partner with Product, QA, DevOps, and other engineers to clarify requirements, refine implementation plans, and deliver high-quality releases.</li><li><strong>Mentor &amp; Uplift</strong>: Provide technical guidance to peers, support onboarding, and help others navigate design decisions with clarity and context.</li><li><strong>Continuously Improve</strong>: Identify refactoring opportunities, challenge unnecessary complexity, and contribute to engineering best practices within the squad.</li></ul><h2>Qualifications</h2><p><strong>Your Engineering Toolbox</strong></p><ul><li>Solid experience in backend or full-stack development, with mastery of at least one modern programming language (e.g., Java, Python, Go, TypeScript)</li><li>Strong understanding of algorithms, data structures, concurrency, and distributed systems fundamentals</li><li>Experience designing RESTful or event-driven services, with knowledge of asynchronous processing via Kafka, RabbitMQ, SQS, or pub/sub</li><li>Hands-on knowledge of scalable, stateless service design and how to maintain consistency across services in real-world production environments</li><li>Applied experience with CI/CD workflows, automated testing (unit, integration, and contract), and infrastructure-as-code</li><li>Familiarity with observability tools (e.g., Grafana, Prometheus, ELK) and post-mortem practices</li><li>Working knowledge of secure coding, data privacy, and engineering in a regulated or high-availability environment</li></ul><p><strong>Collaboration &amp; Culture Fit</strong></p><ul><li>Clear communicator who adapts technical depth to audience context</li><li>Strong collaborator, comfortable leading design discussions and giving structured feedback</li><li>Proactive contributor with a bias for impact, who takes ownership without waiting to be asked</li><li>Open to learning and feedback, actively helps build a high-trust, high-performance culture</li></ul><p><strong>Why Join Us</strong></p><ul><li>Play a key role in the evolution of a business-critical platform, delivering high-impact projects</li><li>Collaborate with talented engineers who value pragmatism, quality, and growth</li><li>Gain exposure to architectural and leadership challenges that prepare you for Staff-level growth</li><li>Work in a product-led, engineering-driven environment with low politics and high standards</li></ul><p><strong>Our Commitment</strong></p><ul><li>A strong engineering culture where learning, growth, and craftsmanship are core values</li><li>Clear technical leadership and career development opportunities</li><li>Competitive compensation and meaningful projects that contribute to real change</li></ul><p><strong>Apply Now</strong></p><p>Submit your application, resume, and any relevant project or code links. We’d love to learn how your experience delivering complex systems can help power the future of Voyage Privé.</p><h2>Informations supplémentaires</h2><p><strong>You&#8217;ll love joining us&#8230; </strong></p><ul><li>At Voyage Privé, the “entrepreneurial adventure” is a reality: take on ambitious and fulfilling projects, while joining a company committed to the growth of its teams. </li><li>HQ in the South of France, in an exceptional natural, economic and cultural environment, on a modern, digital and eco-responsible campus. </li><li>Remote work possible based on location and experience</li><li>Put meaning back into your work and discover a unique ecosystem, creating bridges between worlds that are often far apart: the economic, sporting, academic and social worlds, and take part in one of the Vision projects (Ecole des XV &#8211; Provence Rugby &#8211; VP Green- Les Tremplins &#8211; Chez Pierre). </li><li>Cancel your sports subscription! Access our large Campus gym morning, noon and night, and play Padel whenever you like on our court reserved exclusively for Voyage Privé employees&#8230; </li><li>Live to the rhythm of Voyage Privé&#8217;s various Business &amp; Fun highlights (Company Breaks, Carnival, Annual Convention&#8230;), take part in meetups and talks, and enjoy free tickets to every Provence Rugby home match or dance to the sounds of the Dalida Institute! </li><li>Would you like to take advantage of our getaway offers? Benefit from up to 20% off our irresistible prices. </li></ul>",
        "url": "https://jobicy.com/jobs/124633-software-engineer-system-design-reliability-full-remote-h-f",
        "source": "Jobicy",
        "posted_at": "2025-07-04T14:13:54+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/07/2b1f24db-221.png",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Software Engineer &amp;#8211; Product Delivery &amp;#8211; Full Remote (H/F)",
        "company": "Voyage Privé",
        "location": "France",
        "description": "Description de l&amp;#8217;entrepriseThe Opportunity Voyage Privé is a leader in the travel industry, entering a defining moment of digital transformation. Our ambition is not only to maintain operational excellence, but to completely redefine it, through technical excellence, world-class engineering practices, and pragmatic innovation. As a Software Engineer, you will take end-to-end responsibility for components or services, delivering...",
        "html_description": "<h2>Description de l&#8217;entreprise</h2><p>The Opportunity </p><p>Voyage Privé is a leader in the travel industry, entering a defining moment of digital transformation. Our ambition is not only to maintain operational excellence, but to completely redefine it, through technical excellence, world-class engineering practices, and pragmatic innovation. </p><p>As a Software Engineer, you will take end-to-end responsibility for components or services, delivering clean, maintainable code and collaborating across disciplines to ship features that matter. You’ll play an active role in improving code quality, designing scalable solutions, and helping newer engineers grow, all while developing your own technical depth. </p><p>You’ll join a pragmatic, impact-driven culture that values curiosity, collaboration, and continuous learning. </p><h2>Description du poste</h2><p>Your Mission </p><ul><li><p>Build and Own Systems: Design, implement, and maintain robust and secure services or components, delivering features from spec to production. </p></li></ul><ul><li><p>Improve Code Quality: Write modular, reusable, and well-tested code, ensuring security and performance are considered by design. </p></li></ul><ul><li><p>Drive Incremental Design: Make design choices that balance short-term progress and long-term maintainability, contributing to shared system architecture (e.g. SDDs). </p></li></ul><ul><li><p>Ensure Delivery Reliability: Contribute to healthy CI/CD pipelines, and actively monitor and improve the runtime behavior of your code. </p></li></ul><ul><li><p>Debug and Resolve: Investigate complex issues across services and layers, using observability tools and root cause analysis. </p></li></ul><ul><li><p>Collaborate Widely: Work closely with Product, QA, Data, and DevOps to clarify requirements, align expectations, and iterate quickly. </p></li></ul><ul><li><p>Contribute Beyond Code: Participate in code reviews, share technical context, and support peer growth through mentoring or pairing. </p></li></ul><h2>Qualifications</h2><p>Your Engineering Toolbox </p><ul><li><p>Programming &amp; Languages: You write clean, modular, extensible code using best practices (e.g. Java + Spring Boot, Python, ReactJS, React, SQL/NoSQL, etc.). </p></li></ul><ul><li><p>Architecture &amp; Design: You document and design systems with clear, robust interfaces. You understand service boundaries and design patterns. </p></li></ul><ul><li><p>Data Structures &amp; Algorithms: You select the right data structures, optimize code for performance, and reason about trade-offs. </p></li></ul><ul><li><p>CI/CD &amp; DevOps: You manage and improve pipelines, integrate build/test/deploy tools, and monitor performance in production. </p></li></ul><ul><li><p>Testing &amp; Security: You define testing strategies, write tests at multiple levels, and apply secure-by-design principles. </p></li></ul><ul><li><p>SRE &amp; Observability: You build and maintain dashboards, define SLOs, and conduct post-incident reviews to improve system reliability. </p></li></ul><p>Collaboration &amp; Culture Fit </p><p>We’re looking for engineers who combine technical skill with a constructive and pragmatic mindset, and who actively contribute to a positive team dynamic. </p><ul><li><p>Positive Attitude Toward Legacy: You work with existing systems respectfully and with curiosity, not judgment, and are comfortable doing retro-engineering to build understanding and drive improvement. </p></li></ul><ul><li><p>Solution-Oriented Thinking: You focus on actionable solutions rather than only pointing out problems, and you help move discussions toward progress and outcomes. </p></li></ul><ul><li><p>Collaborative Communication: You express ideas clearly, give and receive feedback with care, and adapt your level of technical detail to your audience. </p></li></ul><ul><li><p>Growth &amp; Transformation Mindset: You’re motivated to help modernize our stack and contribute to our tech evolution with humility, not cynicism. </p></li></ul><ul><li><p>Team Enablement: You mentor, pair, and document thoughtfully to support team learning and shared ownership. </p></li></ul><ul><li><p>Pragmatic Problem Solving: You balance long-term architecture with short-term delivery, and embrace constraints to build the best solution possible within context. </p></li></ul><h2>Informations supplémentaires</h2><p>Why Join Us Now </p><ul><li><p>Join a company where your work improves real experiences for millions of members. </p></li><li><p>You’ll operate at the intersection of business and technology, helping the company scale both sustainably and intelligently </p></li></ul><ul><li><p>This is a rare chance to join a company undergoing a deep technical shift — where engineers don’t just build features, but actively shape the future of the platform, culture, and business. </p></li></ul><p>Our Commitment </p><ul><li><p>A strong engineering culture where learning, growth, and craftsmanship are core values </p></li></ul><ul><li><p>Competitive compensation and meaningful projects that contribute to real change </p></li></ul><p>Apply Now </p><p>Submit your application, resume, and any relevant project or code links. We’d love to learn how your experience delivering complex systems can help power the future of Voyage Privé. </p>",
        "url": "https://jobicy.com/jobs/124632-software-engineer-product-delivery-full-remote-h-f",
        "source": "Jobicy",
        "posted_at": "2025-07-04T14:13:52+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/07/2b1f24db-221.png",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Staff Software Engineer &amp;#8211; Full Remote (H/F)",
        "company": "Voyage Privé",
        "location": "France",
        "description": "Description de l&amp;#8217;entrepriseCompany Description Born in France in 2006, Voyage Privé has grown from an ambitious startup into becoming the Europe&amp;#8217;s leading travel tech platform. Operating across 9 markets with tens of millions of users, we&amp;#8217;re not just another e-commerce success story &amp;#8211; we&amp;#8217;re a tech powerhouse revolutionizing online travel. As a mission-driven company, we&amp;#8217;re unique...",
        "html_description": "<h2>Description de l&#8217;entreprise</h2><p>Company Description </p><p>Born in France in 2006, Voyage Privé has grown from an ambitious startup into becoming the Europe&#8217;s leading travel tech platform. Operating across 9 markets with tens of millions of users, we&#8217;re not just another e-commerce success story &#8211; we&#8217;re a tech powerhouse revolutionizing online travel. </p><p>As a mission-driven company, we&#8217;re unique in combining cutting-edge technology with social impact. Our innovative campus brings together tech talent, professional athletes, students, and artists, creating an ecosystem where digital innovation drives both business growth and positive change. </p><p>We&#8217;re now at an inflection point, upgrading our entire technical foundation with cloud architecture, AI, and real-time systems to become a reference and top-of-mind platform for luxury travel, known by travelers for its for excellent offer and customer experience, and by our providers as a high-performance business development partner. </p><p>Why Join Us?</p><p>Work at the intersection of cutting-edge technology and a mission-driven company, transforming how millions experience travel.</p><p>Be part of an entrepreneurial team of innovators that isn&#8217;t just building technology: we value innovation, ownership, and collaboration, with an emphasis on empowering engineers to make a difference.</p><p>Shape a fast-growing tech company as we embark on an ambitious plan to scale tenfold in the next decade.</p><p>Enjoy a workplace that invests in personal and professional development, offering learning programs, mentorship opportunities, and career growth pathways</p><h2>Description du poste</h2><p><strong>The Opportunity</strong></p><p>At <strong>Voyage Privé</strong>, we are entering a defining moment of transformation. As a leader in the travel industry, our ambition is not only to maintain operational excellence, but to redefine it, through a large-scale digital transformation grounded in technical excellence, world-class engineering practices, and pragmatic innovation.</p><p>As technical leaders, our objective is to evolve from legacy foundations toward a forward-compatible, high-performance architecture, designed with scalability, resilience, and velocity in mind, guided by the engineering rigor and pragmatic excellence demonstrated by world-class companies like Google, Stripe, GitLab, and Netflix.</p><p>To succeed, we’re building an elite group of engineers who will drive this transformation from within. <strong>The Staff Software Engineer role is at the heart of this effort</strong>, providing hands-on architectural leadership, raising engineering standards, mentoring engineers across squads, and shaping the long-term technical foundation of our company.</p><p>This is the right time to join, your decisions will define the engineering culture, velocity, and technical maturity of the entire organization.</p><p><strong>Your Mission</strong></p><ul><li><strong>Architect the Future</strong>: Design distributed, stateless, and scalable systems that are resilient to failure and optimized for high performance and throughput</li><li><strong>Stay Hands-On</strong>: Actively contribute to the codebase, prototype, implement, and review critical features. Lead by example through high-quality, pragmatic, and scalable code</li><li><strong>Scale What Matters</strong>: Leverage asynchronous architectures and message-driven patterns using technologies like Kafka, RabbitMQ, SQS, or pub/sub to improve latency, responsiveness, and decoupling of services</li><li><strong>Ensure Consistency and Integrity</strong>: Define and implement patterns for data consistency (eventual or strong), message ordering, and reliable state transitions across services and storage layers</li><li><strong>Be a Multiplier</strong>: Mentor engineers across teams, level up engineering capabilities, and help embed a culture of technical excellence and ownership</li><li><strong>Raise the Bar</strong>: Promote best practices in testing, observability, continuous integration, and secure software development</li><li><strong>Transform at Scale</strong>: Actively reduce technical debt and drive modernization strategies that improve system agility, performance, and reliability</li><li><strong>Partner for Impact</strong>: Collaborate with Engineering Managers, Product, and Infrastructure to influence roadmaps and shape a pragmatic, scalable architecture vision</li></ul><h2>Qualifications</h2><p><strong>Your Engineering Toolbox</strong></p><ul><li>Proven experience designing and delivering robust, distributed, and mission-critical systems in production</li><li>Expertise in asynchronous processing and message-driven systems using technologies such as Kafka, SQS, RabbitMQ, or pub/sub</li><li>Deep technical fluency in system design, performance tuning, concurrency, and consistency models</li><li>Strong coding skills in one or more modern languages (e.g., Java, Go, Python, TypeScript)</li><li>Familiarity with service-oriented and event-driven architectures, eventual consistency strategies, and data synchronization mechanisms</li><li>Mastery of CI/CD, test automation strategies, and infrastructure-as-code tooling</li><li>Hands-on experience with secure coding practices and awareness of compliance and resilience in regulated or complex environments</li><li>Strong observability mindset: metrics, logs, traces, incident handling, and root cause analysis</li></ul><p><strong>Leadership Competencies</strong></p><ul><li>Ability to lead technical direction across multiple teams without relying on positional authority</li><li>High judgment in balancing engineering purity with speed, business outcomes, and risk</li><li>Experience mentoring Senior Engineers and guiding architectural decisions at the org level</li><li>Ability to navigate ambiguity, influence without ego, and coach others through technical complexity</li></ul><p><strong>Why Join Us Now</strong></p><ul><li>You will be a <strong>foundational player</strong> in an ambitious transformation journey</li><li>You’ll operate at the <strong>intersection of business and technology</strong>, helping the company scale both sustainably and intelligently</li><li>You will shape not just code, but also <strong>culture, processes, and future leaders</strong></li><li>We offer the autonomy, vision, and leadership environment expected from <strong>modern product-driven, engineering-led companies</strong></li></ul><p><strong>Our Commitment</strong></p><ul><li>A high-trust, low-politics environment where you can lead bold initiatives with executive support</li><li>A product and business strategy that values <strong>engineering as a core differentiator</strong></li><li>Transparent career development pathways, and opportunities to shape your own growth</li><li>Competitive compensation and a mission-driven team ready to build the future of digital travel</li></ul><p><strong>Apply Now</strong></p><p>If you are a technical leader who thrives in environments of change, builds with intent, and inspires with clarity, we’d love to meet you.</p><p>Apply via [email/contact portal/linkedIn,…] with your resume and a short note telling us <strong>how you’ve helped elevate an engineering organization before, and what excites you about helping us do it again.</strong></p><h2>Informations supplémentaires</h2><p><strong>You&#8217;ll love joining us&#8230; </strong></p><ul><li>At Voyage Privé, the “entrepreneurial adventure” is a reality: take on ambitious and fulfilling projects, while joining a company committed to the growth of its teams. </li><li>HQ in the South of France, in an exceptional natural, economic and cultural environment, on a modern, digital and eco-responsible campus. </li><li>Remote work possible based on location and experience</li><li>Put meaning back into your work and discover a unique ecosystem, creating bridges between worlds that are often far apart: the economic, sporting, academic and social worlds, and take part in one of the Vision projects (Ecole des XV &#8211; Provence Rugby &#8211; VP Green- Les Tremplins &#8211; Chez Pierre). </li><li>Cancel your sports subscription! Access our large Campus gym morning, noon and night, and play Padel whenever you like on our court reserved exclusively for Voyage Privé employees&#8230; </li><li>Live to the rhythm of Voyage Privé&#8217;s various Business &amp; Fun highlights (Company Breaks, Carnival, Annual Convention&#8230;), take part in meetups and talks, and enjoy free tickets to every Provence Rugby home match or dance to the sounds of the Dalida Institute! </li><li>Would you like to take advantage of our getaway offers? Benefit from up to 20% off our irresistible prices. </li></ul>",
        "url": "https://jobicy.com/jobs/124629-staff-software-engineer-full-remote-h-f",
        "source": "Jobicy",
        "posted_at": "2025-07-04T14:13:50+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/07/2b1f24db-221.png",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Quality Manager (m/w/d) Heidenheim a. d. Brenz, Berlin, remote",
        "company": "The Force CT GmbH",
        "location": "Germany",
        "description": "We are looking for aQUALITY MANAGER (M/F/X)Location: Heidenheim an der Brenz/Berlin or remote (Germany)Starting: at the next possible dateWhat will allow you to dive in right away:Your several years of experience in quality assurance in a manufacturing pharmaceutical company, ideally with close links to production and/or quality control, give wing to a good start.You are...",
        "html_description": "<p>We are looking for a<br><strong>QUALITY MANAGER (M/F/X)</strong><br><strong>Location:</strong> Heidenheim an der Brenz/Berlin or remote (Germany)<br><strong>Starting:</strong> at the next possible date<strong>What will allow you to dive in right away:</strong></p><ul><li>Your several years of experience in quality assurance in a manufacturing pharmaceutical company, ideally with close links to production and/or quality control, give wing to a good start.</li><li>You are well acquainted with the standard processes of a GMP quality system, and have already been able to get your claws on practical experience in various processes.</li><li>You have a keen eye on the requirements of German and European laws and standards in the area of GMP/GDP.</li><li>With your hands-on experience in topics such as process validation, qualification of equipment and premises, and/or technology transfer, you easily glide through everyday work.</li><li>Thanks to your fluency in written and spoken German and English alike, you don’t have to brood over your communication with customers or colleagues.</li></ul><br><strong>What will be the wind beneath our wings:</strong><br><ul><li>You see the solutions instead of having a dark cloud of problems hanging over you.</li><li>You love to work efficiently without crash-landing your precision in the process.</li><li>An independent way of working is your standard, but it doesn’t ruffle your feathers to ask for help, when necessary.</li><li>Your way of communicating is proactive and to the point, without drawing circles around everything.</li><li>The sky’s the limit for your quality awareness: you reflect on your work, soak up knowledge, and strive to constantly improve your skills.</li></ul><br><strong>What will make you fit the bill even more:</strong><br><ul><li>You have broadened your horizons through further practical experience, or are a specialist in topics such as the introduction of electronic systems.</li><li>Experience in manufacturing processes of various pharmaceuticals such as non-sterile, solid and liquid dosage forms, parenterals, biologics or radiopharmaceuticals is an additional feather in your cap.</li><li>You have already successfully spread your wings in project management.</li><li>Your commercial mindset is more than just hot air, and you develop ideas for new businesses or projects. </li></ul><br>",
        "url": "https://jobicy.com/jobs/124626-quality-manager-m-w-d-heidenheim-a-d-brenz-berlin-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-04T14:13:48+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/07/13a2155c-221.png",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Internship in IoT, Software &amp;#038; GenAI &amp;#8211; remote possible",
        "company": "Bosch Group",
        "location": "Germany",
        "description": "Company DescriptionAt Bosch, we shape the future by inventing high-quality technologies and services that spark enthusiasm and enrich people’s lives. Our promise to our associates is rock-solid: we grow together, we enjoy our work, and we inspire each other. Join in and feel the difference.Bosch Sicherheitssysteme is looking forward to your application!Job DescriptionAre you passionate about...",
        "html_description": "<h2>Company Description</h2><p><strong>At Bosch, we shape the future by inventing high-quality technologies and services that spark enthusiasm and enrich people’s lives. Our promise to our associates is rock-solid: we grow together, we enjoy our work, and we inspire each other. </strong><strong>Join in and feel the difference.</strong><br />Bosch Sicherheitssysteme is looking forward to your application!</p><h2>Job Description</h2><p>Are you passionate about innovation, emerging technologies, and user-centric solutions? Join the Innovation Hub at Bosch Building Technologies in Munich — a dynamic, agile team dedicated to developing cutting-edge products and services in the IoT and Generative AI space.</p><ul><li>As an intern, you will become an integral part of a diverse and interdisciplinary team comprising Software Engineers, Solution Architects, UX Designers and Service Engineers. You will work in a start-up-like environment within the structure of a global technology leader, giving you the best of both worlds.</li><li>During your internship you will collaborate on real-world innovation projects focused on IoT, smart building solutions, and GenAI-powered services.</li><li>You will participate in the development of new product concepts using advanced technologies, including AI-based tools and frameworks.</li><li>Furthermore, you will support the team in design, development, and research tasks — such as data handling, prompt engineering, or integrating GenAI features into user-facing applications.</li><li>Last but not least you will gain hands-on experience with agile methodologies, service development workflows, and the use of AI APIs (e.g., OpenAI, Hugging Face, Bosch internal platforms).</li></ul><h2>Qualifications</h2><ul><li><strong>Education:</strong> Master studies in the field of Computer Science, Software Engineering, Artificial Intelligence or comparable</li><li><strong>Experience and Knowledge</strong><strong>:</strong> programming experience in C#.NET, Java or the Spring Framework; familiarity with frontend technologies like Angular, TypeScript and CSS; knowledge of Python or AI/ML libraries (e.g., TensorFlow, PyTorch) is a plus</li><li><strong>Personality and Working Practice:</strong> you are a proactive, open-minded and self-driven individual with a collaborative spirit and a structured, solution-oriented approach to work; you are comfortable working independently and possess strong problem-solving skills</li><li><strong>Work Routine:</strong> mobile working within Germany possible</li><li><strong>Enthusiasm:</strong> exposure to or interest in Generative AI technologies, including LLMs, prompt design, or text/image generation tools</li><li><strong>Languages:</strong> fluent in English, German is optional</li></ul><h2>Additional Information</h2><p><strong>Start:</strong> according to prior agreement<br>\n<strong>Duration:</strong> 6 months</p><p>You want to work flexibly from your home in Germany or prefer working at the Bosch location in Munich?</p><p>For positions with the addition “remote possible”, you can agree on the appropriate collaboration for your task together with your manager and your team within the framework of Smart Work.</p><p>Requirement for this internship is the enrollment at university. Please attach your CV, transcript of records, enrollment certificate, examination regulations and if indicated a valid work and residence permit.</p><p>Diversity and inclusion are not just trends for us but are firmly anchored in our corporate culture. Therefore, we welcome all applications, regardless of gender, age, disability, religion, ethnic origin or sexual identity.</p><p><strong>Need further information about the job?</strong><br>\nAlwar Mandyam (Functional Department)<br>\n+49 152 21866859</p><p>#LI-DNI</p>",
        "url": "https://jobicy.com/jobs/124607-internship-in-iot-software-genai-remote-possible",
        "source": "Jobicy",
        "posted_at": "2025-07-04T14:13:28+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Programming",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/07/b0576e43-221.jpg",
        "job_level": "Entry-Level, Junior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Security GRC Analyst (Cloud/AWS) &amp;#8211; UK REMOTE",
        "company": "Turnitin, LLC",
        "location": "UK",
        "description": "Company DescriptionWhen you join Turnitin, you&amp;#8217;ll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback...",
        "html_description": "<h2>Company Description</h2><p>When you join Turnitin, you&#8217;ll be welcomed into a company that is a recognized innovator in the global education space. For over 25 years, Turnitin has partnered with educational institutions to promote honesty, consistency, and fairness across all subject areas and assessment types. Over 21,000 academic institutions, publishers, and corporations use our services: Feedback Studio, Originality, Gradescope, ExamSoft, Similarity, and iThenticate.</p><p>Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being. Our diverse community of colleagues are all unified by a shared desire to make a difference in education.</p><p>Turnitin is a global organization with team members in over 35 countries including the United States, Mexico, United Kingdom, Australia, Japan, India, and the Philippines.</p><h2>Job Description</h2><p>Turnitin is seeking an experienced Security GRC Analyst with Cloud/AWS skills to join our Security &amp; Compliance team. The Security GRC Analyst will be responsible for ensuring that our information and cloud systems comply with relevant regulatory frameworks, industry standards, and internal policies. They will also collaborate with various departments, monitor compliance, conduct assessments, and support initiatives to identify and mitigate risks.</p><p>We are looking for someone who brings strong analytical ability, attention to detail, effective communication, compliance experience, and the willingness to continuously learn. This role requires hands-on work, critical thinking and the ability to find new solutions for compliance. </p><p>This role reports to the GRC Information Security Manager.</p><p><strong>Responsibilities:</strong></p><ul><li>Maintain compliance tracking capabilities to help ensure adherence with Turnitin’s security program and industry standards such as NIST CSF, NIST 800-53, SOC 2, TX-RAMP and PCI DSS.</li><li>Conduct risk and compliance assessments, audits, and risk evaluations to identify potential risk and compliance gaps.</li><li>Lead preparation and audit activities required to maintain our SOC 2 Type 2.</li><li>Collaborate with internal teams and external auditors for audit and compliance reviews.</li><li>Collaborate with sales and customer support teams to respond to security questionnaires and security posture questions from customers.</li><li>Support TPRM Program and conduct third-party risk assessments.</li><li>Complete user access reviews.</li><li>Administration of GRC platform.</li><li>Participate in the development and documentation of security policy, standards and processes to align with company information security strategy.</li><li>Provide security awareness and phishing training for employees and promote a culture of security and compliance.</li><li>Coordinate phish testing.</li><li>Collaborate with DevOps, IT, Legal, Engineering, People Team, and other departments to ensure security control and policy requirements are integrated into systems and business processes.</li><li>Automate manual compliance tasks and improve team processes.</li><li>Leverage AWS and Wiz for continuous monitoring.</li><li>Measure effectiveness vs just implementation.</li></ul><p><strong>Technical skills:</strong></p><ul><li>Cloud Infrastructure with general knowledge of AWS services such as CloudFormation, Serverless, AWS Config, CloudTrail, IAM, and JSON</li><li>Basic scripting</li></ul><h2>Qualifications</h2><ul><li>Bachelor’s degree in Computer Science, Information Security, or a related field (or equivalent experience).</li><li>3+ years of experience in a role related to Information Security. </li><li>1+ years AWS Cloud Services and basic scripting.</li><li>Professional certification such as CCSK, AWS Cloud Practitioner, or other related industry certification.</li><li>Familiarity with cybersecurity frameworks and regulatory standards such as NIST, SOC 2, TX-RAMP, and PCI DSS.</li><li>Familiarity of risk management and security best practices.</li><li>Experience with assessing security controls, risk mitigation strategies, and audit procedures.</li><li>Understanding of concepts related to AWS Cloud Infrastructure and security.</li><li>Experience conducting security impact analysis for system changes.</li><li>Experience conducting periodic internal security reviews or risk assessments to ensure that compliance procedures and technical configurations are followed.</li><li>Experience conducting third-party risk assessments.</li><li>Contract review experience for security requirements.</li><li>Highly organized and proactive individual capable of managing multiple responsibilities and delivering results. </li></ul><p><strong>Preferred Skills:</strong></p><ul><li>Experience running SOC 2 audits or NIST based authorizations.</li><li>Experience using Jira and Confluence for project and task management.</li><li>Hands-on experience with Wiz, KnowBe4, and Hyperproof.</li><li>Experience conducting third-party risk assessments.</li><li>Demonstrated knowledge of security assessment of cloud technology and services (AWS).</li><li>Entry level cybersecurity certification such as Security+, GIAC GSEC, or ISC2 Certified in Cybersecurity.</li></ul><h2>Additional Information</h2><p><strong>Total Rewards @ Turnitin</strong><br>\nTurnitin maintains a Total Rewards package that is competitive within the local job market. People tend to think about their Total Rewards monetarily — solely as regular pay plus bonus or commission. This is what they earn in exchange for what they do. However, Turnitin delivers more than just these components. Beyond the intrinsic rewards of unleashing your potential to positively impact global education, and thriving in an organization that is free of politics and full of humble, inclusive and collaborative teammates, the extrinsic rewards at Turnitin include generous time off and health and wellness programs that offer choice and flexibility and provide a safety net for the challenges that life presents from time to time. Experience a remote-centric culture that empowers you to work with purpose and accountability in a way that best suits you, supported by a comprehensive package that prioritizes your overall well-being.</p><p><strong>Our Mission </strong>is to ensure the integrity of global education and meaningfully improve learning outcomes.<br /><strong>Our Values </strong>underpin everything we do.</p><ul><li><strong>Customer Centric </strong>&#8211; We realize our mission to ensure integrity and improve learning outcomes by putting educators and learners at the center of everything we do.</li><li><strong>Passion for Learning </strong>&#8211; We seek out teammates that are constantly learning and growing and build a workplace which enables them to do so.</li><li><strong>Integrity</strong> &#8211; We believe integrity is the heartbeat of Turnitin. It shapes our products, the way we treat each other, and how we work with our customers and vendors.</li><li><strong>Action &amp; Ownership </strong>&#8211; We have a bias toward action and empower teammates to make decisions.</li><li><strong>One Team </strong>&#8211; We strive to break down silos, collaborate effectively, and celebrate each other’s successes.</li><li><strong>Global Mindset</strong> &#8211; We respect local cultures and embrace diversity. We think globally and act locally to maximize our impact on education.</li></ul><p><strong>Global Benefits</strong></p><ul><li>Remote First Culture</li><li>Health Care Coverage*</li><li>Education Reimbursement*</li><li>Competitive Paid Time Off </li><li>4 Self-Care Days per year</li><li>National Holidays*</li><li>2 Founder Days + Juneteenth Observed</li><li>Paid Volunteer Time*</li><li>Charitable contribution match*</li><li>Monthly Wellness or Home Office Reimbursement/*</li><li>Access to Modern Health (mental health platform)</li><li>Parental Leave*</li><li>Retirement Plan with match/contribution*</li></ul><p>* varies by country</p><p><strong>Seeing Beyond the Job Ad</strong><br>\nAt Turnitin, we recognize it’s unrealistic for candidates to fulfill 100% of the criteria in a job ad. We encourage you to apply if you meet the majority of the requirements because we know that skills evolve over time. If you’re willing to learn and evolve alongside us, join our team!<br />Turnitin, LLC is committed to the policy that all persons have equal access to its programs, facilities and employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</p>",
        "url": "https://jobicy.com/jobs/124581-security-grc-analyst-cloud-aws-uk-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-04T04:29:00+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "DevOps &amp; Infrastructure",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/07/74eaceda-221.jpg",
        "job_level": "Entry-Level, Junior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Senior Clinical Research Associate (Oncology Experience Required) &amp;#8211; UK, Remote &amp;#8211; FSP",
        "company": "Parexel",
        "location": "UK",
        "description": "When our values align, there&amp;#8217;s no limit to what we can achieve.At Parexel, we all share the same goal &amp;#8211; to improve the world&amp;#8217;s health. From clinical trials to regulatory, consulting, and market access, every clinical development solution we provide is underpinned by something special &amp;#8211; a deep conviction in what we do.Each of us,...",
        "html_description": "<p><b>When our values align, there&#8217;s no limit to what we can achieve.</b><br />At Parexel, we all share the same goal &#8211; to improve the world&#8217;s health. From clinical trials to regulatory, consulting, and market access, every clinical development solution we provide is underpinned by something special &#8211; a deep conviction in what we do.</p><p>Each of us, no matter what we do at Parexel, contributes to the development of a therapy that ultimately will benefit a patient. We take our work personally, we do it with empathy and we&#8217;re committed to making a difference.</p><p>Parexel is currently seeking Clinical Research Associates with at least 12 months recent oncology experience to join our team and be dedicated to a single sponsor.</p><p>Working as a Clinical Research Associate at Parexel FSP offers tremendous long-term job security and prospects. We undertake vital clinical studies for sponsors including the leading global biotechs and Pharma top 50. And we have an incredible pipeline of work.</p><p>Whether you see your future path as a CRA, or in fields such as clinical operations, project management, line management, or other positions, we have a world of opportunity waiting for you.</p><p>Our CRAs work from their home office base, supporting studies within their country or region. ‘Manageable sites, manageable protocols’ is our mantra. Expect exciting professional challenges in inspiring studies, but with time for your outside life.</p><p><b><u>Some specifics about this advertised role</u></b></p><ul><li><p>Dedicated to one client.</p></li><li><p>Responsible for all site management and monitoring activities across assigned oncology studies</p></li><li><p>Work with industry leaders and subject matter experts.</p></li><li><p>Opportunity to mentor junior CRAs.</p></li><li><p>Work with world-class technology.</p></li><li><p>a pivotal role in the drug development process.</p></li></ul><p><b><u>Here are a few requirements specific to this advertised role.</u></b></p><ul><li><p>Substantial Site Management experience, with an understanding of the clinical</p></li><li><p>trial methodology and terminology.</p></li><li><p>Experience in, or willingness to monitor oncology clinical trials.</p></li><li><p>Experience in independent monitoring, all types of visits.</p></li><li><p>Effective time management, organizational and interpersonal skills &amp; problem-solving skills, with the ability to multi-task and prioritize.</p></li><li><p>Good understanding and working knowledge of clinical research, phases of clinical trials, current GCP/ICH &amp; country clinical research law &amp; guidelines.</p></li></ul><p>We care about our people and your passion, as they are the key to our success, and provide an open and friendly work environment where we empower people and provide them with opportunities to develop their long-term careers. In addition, you will have the opportunity to develop within your role and tackle further responsibilities or develop your skill set within other related departments of Parexel.</p><p><b>Who are Parexel</b></p><p>Parexel supports clinical studies across the full range of therapeutic areas, and we have longstanding partnerships with a vast client base.</p><p>We supported the trials of most of today’s top 50 best-selling drugs, but equally we enable more niche drug developments that are critical to the well-being of many patients.</p><p>You’ll be an influential member of the wider team.</p><p><b>Not quite the role for you?</b></p><p>Join Our Talent Community and we’ll reach out with job alerts when positions that match your career interests become available. We’ll also share periodic updates about the latest company news and events.</p><p>Sign up today <a href=\"https://jobs.parexel.com/functional-service-provider\" rel=\"nofollow ugc noopener\" target=\"_blank\">https://jobs.parexel.com/functional-service-provider</a></p>",
        "url": "https://jobicy.com/jobs/124561-senior-clinical-research-associate-oncology-experience-required-uk-remote-fsp",
        "source": "Jobicy",
        "posted_at": "2025-07-03T17:52:16+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Healthcare &amp; Medical",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/fdc627a1-221.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Associate Remote Sales Representative",
        "company": "Medtronic",
        "location": "Poland",
        "description": "At Medtronic you can begin a life-long career of exploration and innovation, while helping champion healthcare access and equity for all. You’ll lead with purpose, breaking down barriers to innovation in a more connected, compassionate world.A Day in the LifeRemote Sales is designed to complement traditional field sales force with a technology enabled, an innovative...",
        "html_description": "<p>At Medtronic you can begin a life-long career of exploration and innovation, while helping champion healthcare access and equity for all. You’ll lead with purpose, breaking down barriers to innovation in a more connected, compassionate world.</p><h2><b>A Day in the Life</b></h2><p>Remote Sales is designed to complement traditional field sales force with a technology enabled, an innovative remote selling capability that will enhance accessibility to product and service solutions for our customers and thus improve the overall customer experience. Remote sales organization is specifically growing &amp; maintaining sales revenue and supporting the sales execution in instrumentation of selected accounts. <br />This position is part of VES (Virtual Engagement Solutions) Remote Sales team, responsible for OR ICU (Operating Room Intensive Care Unit) portfolio in North-West Poland.</p><p><b>Responsibilities may include the following and other duties may be assigned:</b></p><ul><li>Remotely sell Medtronic&#8217;s products and retain end-user patients within an assigned geographic area and /or specific customer accounts for pre-defined territory locations to achieve or exceed assigned sales goals.</li><li>Identify, develop and close leads for the business and refer on internal lead when appropriate.</li><li>Provide input on new markets, new product introductions and existing products or supplies.</li><li>Promote and establish education of the company&#8217;s products and/or services.</li><li>Manage and respond to customer concerns and problems.</li><li>Arrange demonstration of products by field sales representatives.</li><li>Planning and execution of sales activities as well as providing on-going sales support including sales calls, data analysis, customer opportunities, and sales rep follow-up.</li></ul><p><b>Required Knowledge and Experience:</b></p><ul><li>Technical/Medical education degree</li><li>Field sales experience in healthcare industry min. 2 years</li><li>Experience and complete knowledge of company products and services</li><li>Strong “remote” communication and selling skills accompanied with presentation/ communication skills over the phone &amp; ability to track and close deals with customers</li><li>Result-orientation and high motivation</li><li>Preferrable localization is Pomorskie, optional Kujawsko-Pomorskie or Zachodniopomorskie.</li></ul><p>OR-ICU knowledge and experience in tender processes are desirable for this position. </p><p><b>Physical Job Requirements</b><br />The above statements are intended to describe the general nature and level of work being performed by employees assigned to this position, but they are not an exhaustive list of all the required responsibilities and skills of this position. </p><h2><b>Benefits &amp; Compensation</b></h2><p><b>Medtronic offers a competitive Salary and flexible Benefits Package</b><br>A commitment to our employees lives at the core of our values. We recognize their contributions. They share in the success they help to create. We offer a wide range of benefits, resources, and competitive compensation plans designed to support you at every career and life stage.</p><h2><b>About Medtronic</b></h2><p>We lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions.<br>Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 95,000+ passionate people. <br>We are engineers at heart— putting ambitious ideas to work to generate real solutions for real people. From the R&amp;D lab, to the factory floor, to the conference room, every one of us experiments, creates, builds, improves and solves. We have the talent, diverse perspectives, and guts to engineer the extraordinary.</p><p>Learn more about our business, mission, and our commitment to diversity <a href=\"http://www.medtronic.com\" rel=\"nofollow ugc noopener\" target=\"_blank\">here</a> </p>",
        "url": "https://jobicy.com/jobs/124560-associate-remote-sales-representative",
        "source": "Jobicy",
        "posted_at": "2025-07-03T17:52:12+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ffacc1d1f3b9b1564c40e6ac4a49cd51.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Technical Account Manager – Middleware (Remote, Spain)",
        "company": "Red Hat",
        "location": "Spain",
        "description": "About the Job:Red Hat&amp;#8217;s Technical Services team is looking for an experienced, enterprise-level engineer to join us as a Middleware Technical Account Manager (TAM) in Spain. Red Hat&amp;#8217;s Technical Services team is looking for an experienced, enterprise-level engineer to join us as a Middleware Technical Account Manager in Spain. Work closely with customers, gain an understanding...",
        "html_description": "<p><b>About the Job:</b></p><p>Red Hat&#8217;s Technical Services team is looking for an experienced, enterprise-level engineer to join us as a Middleware Technical Account Manager (TAM) in Spain. </p><p>Red Hat&#8217;s Technical Services team is looking for an experienced, enterprise-level engineer to join us as a Middleware Technical Account Manager in Spain. Work closely with customers, gain an understanding of their IT infrastructure, internal processes, and business needs, and help identify relevant trends throughout the industry. In this role, you will work with a small set of key enterprise customers to provide architectural guidance and implementation advice for the Red Hat Middleware stack to meet their business needs. This is not a sales role. You&#8217;ll be a dedicated customer engagement associate and a member of the Red Hat Engineering and Services teams. As Middleware Technical Account Manager, you will provide a premium level of engagement that builds, maintains, and grows long-lasting customer loyalty by tailoring technical support to customer environments, facilitating collaboration with other vendors, and advocating on their behalf.</p><p><b>What you will do:</b></p><ul><li><p>Become a Red Hat technical ambassador, working closely with a small number of customers using Middleware technologies; develop relationships with key business and IT stakeholders, including customer managers and technical associates</p></li><li><p>Deliver key portfolio updates and assist customers with upgrades of our offerings; advise customers on technology changes, mitigation strategies, and potential disruptions to their service</p></li><li><p>Conduct technical investigations of customer issues to find root causes and solutions on your own or through collaboration with fellow Red Hatters and customer teams </p></li><li><p>Provide advice and guidance to customers about their current and future use of Red Hat’s offerings</p></li><li><p>Perform technical reviews and share knowledge to proactively identify and prevent issues</p></li><li><p>Manage customer cases and maintain clear and concise case and customer documentation; create customer engagement plans</p></li><li><p>Handle customer escalations with Red Hat and customer teams</p></li><li><p>Engage with Red Hat’s engineering teams to help develop solutions, based on customer engagements as well as personal experience, that will guide product adoption</p></li><li><p>Analyze and present periodic reviews of operational performance to customer leadership</p></li><li><p>Deliver trainings and presentations to customer associates</p></li><li><p>Travel, as necessary, to visit customers or attend internal events</p></li><li><p>Collaborate with third-party hardware and software vendors</p></li></ul><p><b>What you will bring:</b></p><ul><li><p>Combination of technical and customer-facing skills and the desire to embrace and develop both</p></li><li><p>Prior professional experience in a support, development, engineering, or quality assurance (QA) organization, including technical and communication skills</p></li><li><p>Ability to manage and grow existing enterprise customer relationships by providing excellent customer experience </p></li><li><p>Growth mindset and willingness to learn (as part of your onboarding and further development process, you are expected to obtain specific technology certifications such as RHCE/OCP/OSP/Ansible.)</p></li><li><p>Native level Spanish Language skills and excellent verbal and written communication skills in English; ability to explain complex information, such as aligning Red Hat’s offerings to customer needs or use cases, to customers in straightforward terms </p></li><li><p>Effective collaboration skills for working with internal and external associates; ability to manage internal and external communication and prioritize tasks according to their importance or urgency</p></li><li><p>Interest in developing technical skills and future development into OCP/ Ansible/ RHEL direction</p></li></ul><p><u>Middleware TAM Technical Skills</u></p><ul><li><p>Knowledge of the JEE/Jakarta platform</p></li><li><p>Experience analyzing and troubleshooting large-scale Java application issues through configuration, log analysis, thread stack, heap dump analysis, and JVM analysis; ability to set up an action plan based on this data</p></li><li><p>Practical experience with Java middleware technologies and offerings like application servers, messaging, integration, etc.</p></li><li><p>Java coding and development experience</p></li></ul><p>The following are considered a plus:</p><ul><li><p>Experience with API management systems like Red Hat 3Scale API Management </p></li><li><p>Event streaming tools like Kafka or similar</p></li><li><p>Professional Java coding and development experience</p></li><li><p>Practical experience with JBoss EAP and JBCS HTTP server</p></li><li><p>Openshift general knowledge</p></li><li><p>Maven experience</p></li><li><p>Experience automating Middleware using Ansible</p></li><li><p>Experience with Single Sign on software, especially with Keycloak.</p></li></ul><p><b>About Red Hat</b></p><p><a href=\"https://www.redhat.com/\" rel=\"nofollow ugc noopener\" target=\"_blank\"><u>Red Hat</u></a> is the world’s leading provider of enterprise<a href=\"https://www.redhat.com/en/about/open-source\" rel=\"nofollow ugc noopener\" target=\"_blank\"> <u>open source</u></a> software solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies. Spread across 40+ countries, our associates work flexibly across work environments, from in-office, to office-flex, to fully remote, depending on the requirements of their role. Red Hatters are encouraged to bring their best ideas, no matter their title or tenure. We&#8217;re a leader in open source because of our open and inclusive environment. We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact.</p><p><b>Inclusion at Red Hat</b><br>Red Hat’s culture is built on the open source principles of transparency, collaboration, and inclusion, where the best ideas can come from anywhere and anyone. When this is realized, it empowers people from different backgrounds, perspectives, and experiences to come together to share ideas, challenge the status quo, and drive innovation. Our aspiration is that everyone experiences this culture with equal opportunity and access, and that all voices are not only heard but also celebrated. We hope you will join our celebration, and we welcome and encourage applicants from all the beautiful dimensions that compose our global village.</p><p><b>Equal Opportunity Policy (EEO)</b><br>Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.</p><h2><br>Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.</h2><h2><br>Red Hat supports individuals with disabilities and provides reasonable accommodations to job applicants. If you need assistance completing our online job application, email <a href=\"mailto:application-assistance@redhat.com\" rel=\"nofollow ugc noopener\" target=\"_blank\">application-assistance@redhat.com</a>. General inquiries, such as those regarding the status of a job application, will not receive a reply.</h2>",
        "url": "https://jobicy.com/jobs/124548-technical-account-manager-middleware-remote-spain",
        "source": "Jobicy",
        "posted_at": "2025-07-03T17:51:44+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/35e811d9-221-1.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Record to Report – Domain Trainee – German – Remote Poland",
        "company": "Genpact",
        "location": "Poland",
        "description": "Record to Report – Domain Trainee – German – Remote Poland-RET007061Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose &amp;#8211; the...",
        "html_description": "Record to Report – Domain Trainee – German – Remote Poland-RET007061<p>Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose &#8211; the relentless pursuit of a world that works better for people &#8211; we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI. </p>\n<p><b> </b></p>\n<p>Inviting applications for the role of <b>Record to Report – Domain Trainee – German – Remote Poland</b></p>\n<p><b> </b></p>\n<p><b>Responsibilities</b></p>\n\n<p>· Responsible for making the balance sheets preparation and checking all the accounts (banks, fixed assets, client accounts, supplier accounts, tax accounts, etc.).</p>\n<p>· Closing and reconciliations for the managed accounts.</p>\n<p>· Analyzing and following up the accounting journals, making reclassifications and corrections. Preparing the VAT declarations.</p>\n<p>· Handling the accounts reconciliation for the group companies as per procedures, when required. </p>\n<p>· Make Inventory adjustments postings and standard price updated.</p>\n<p>· Offering the reports and information for the internal and external controls.</p>\n<p>· Preparing monthly performance reports while complying with the established contract indicators and any other additional requested reports to be reviewed by the client.</p>\n<p>· Presenting promptly any relevant information related to the process.</p>\n<p>· Respecting the activity schedule established with the customer.</p>\n<p>· Country specific knowledge of taxation (VAT and CIT) &amp; accounting rules applicable particularly for country-to-country transition.</p>\n<p>· Ad-hoc reporting, based on manager’s request</p>\n\n<h2><b>Qualifications</b> </h2>\n<p><b>Minimum qualifications</b> </p>\n<p>· High School Degree (University graduate or Economic studies are an advantage); </p>\n<p>· Any other EU language in written and verbal form (minimum level B2)</p>\n<p>· Similar work experience or experience in this area;</p>\n<p>· Work experience with Oracle;</p>\n<p>· Analytical skills &amp; Excel knowledge.</p>\n<p><b> </b></p>\n<p><b>Preferred Qualifications</b></p>\n<p>· Personal culture and client management expertise. </p>\n<p>· High motivation and ability to learn. </p>\n<p>· Ability to work under pressure. </p>\n<p><b> </b></p>\n<p><b>What can we offer? </b></p>\n<p>· Attractive salary </p>\n<p>· Stable job offer &#8211; employment contract! </p>\n<p>· Work in the multicultural environment </p>\n<p>· Various trainings (initiating, soft skills) </p>\n<p>· Possibility of development </p>\n<p>· Benefits (Medical benefits, insurance, partner discounts, additional vacation days, meal tickets) </p>\n<p><b> </b></p>\n<p>As an Equal Opportunity Employer – we encourage you to apply to this opening position(s) with your preferred CV format. Please note that Genpact does not impose any CV format nor do we require you to enclose, a photograph to your CV as part of the application process. It is the candidate’s absolute discretion if he/she chooses to upload a CV with or without a photograph enclosed. </p>\n\n<p>Kindly please see our Privacy Notice for Employment Candidates: <a href=\"http://www.genpact.com/about-us/privacy-notice-for-employment-candidates\" rel=\"nofollow ugc noopener\" target=\"_blank\">http://www.genpact.com/about-us/privacy-notice-for-employment-candidates</a></p>\n<p><b> </b></p>\n<p><b>Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b>Genpact is committed to creating a dynamic work environment that values respect and integrity, customer focus, and innovation. Get to know us at www.genpact.com and on <a href=\"https://twitter.com/genpact\" rel=\"nofollow ugc noopener\" target=\"_blank\">X</a>, Facebook, LinkedIn, and YouTube.</p>\n<p>Furthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such frauds include purchasing a &#8216;starter kit,&#8217; paying to apply, or purchasing equipment or training. </p>\n\n <h2>Job</h2> Domain Trainee<h2>Primary Location</h2> Poland-Lublin<h2>Schedule</h2> Full-time<h2>Education Level</h2> Associate&#8217;s Degree/College Diploma<h2>Job Posting</h2> Jul 3, 2025, 10:58:29 AM<h2>Unposting Date</h2> OngoingMaster Skills List OperationsJob Category Full Time",
        "url": "https://jobicy.com/jobs/124536-record-to-report-domain-trainee-german-remote-poland",
        "source": "Jobicy",
        "posted_at": "2025-07-03T17:51:12+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/005b6393-221.jpeg",
        "job_level": "Entry-Level, Junior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Principal Salesforce Engineer (Sales Cloud) REMOTE",
        "company": "Claritev",
        "location": "USA",
        "description": "At Claritev (formerly Multiplan), we pride ourselves on being a dynamic team of innovative professionals. Our purpose is simple &amp;#8211; we strive to bend the cost curve in healthcare for all. Our dedication to service excellence extends to all of our stakeholders – internal and external &amp;#8211; driving us to consistently exceed expectations. We are intentionally bold, we foster...",
        "html_description": "<p>At Claritev (formerly Multiplan), we pride ourselves on being a dynamic team of innovative professionals. Our purpose is simple &#8211; we strive <em>to <strong>bend the cost curve in healthcare</strong></em> for all. Our dedication to service excellence extends to all of our stakeholders – internal and external &#8211; driving us to consistently exceed expectations. We are intentionally bold, we foster innovation, we nurture accountability, we champion diversity, and empower each other to illuminate our collective potential.</p><p>Be part of our amazing transformational journey as we optimize the opportunity towards becoming a leading technology, data, and innovation voice in healthcare. Onward and upward!!!</p><p><strong>JOB SUMMARY:</strong> </p><p>Principal Software Engineer is primarily responsible for the design, architecture, development, and maintenance of Salesforce Sales Cloud applications, including requirements analysis, development, testing and implementation.</p><p>Should have extensive experience integrating Salesforce with third-party tools using solutions like MuleSoft, Web Services (SOAP/REST), and other integration platforms. The role involves defining roadmaps for upgrades, enhancements, and development efforts, designing solutions, and collaborating in Agile environments.</p><p>This position expects strong hands-on experience in Salesforce Sales Cloud including Admin and Development.</p><p><strong>JOB ROLES AND RESPONSIBILITIES:</strong></p><ul>\n<li>Work with stakeholders to gather and analyze business requirements.</li>\n</ul><ul>\n<li>Analyze, design, develop &amp; maintain customizations and configure Salesforce Sales Cloud to meet specific business requirements.</li>\n<li>Integrate Salesforce Sales Cloud with external systems including ERP systems and other third-party applications.</li>\n</ul><ul>\n<li>Optimize performance and scalability of Salesforce CRM solutions, ensuring performance, storage and data integrity.</li>\n</ul><ul>\n<li>Conduct user training and provide technical support, as needed, to ensure successful adoption and utilization of new functionality.</li>\n<li>Responsible for establishing best practices for configuration, design and development in Salesforce (Sales Cloud) and maintain necessary documentation.</li>\n</ul><ul>\n<li>Stay updated with the latest features and capabilities of Salesforce and proactively recommend enhancements and improvements to existing solutions.</li>\n<li>Participate in code reviews, Pair-Programming/testing Sessions.</li>\n<li>Proactive system maintenance.</li>\n<li>Participate in the full SDLC (Kanban), including requirement analysis, story writing, design and implementation, estimations, and other aspects of iterative development.</li>\n</ul><p>The salary range for this position is $155K to $165K. Specific offers take into account a candidate&#8217;s education, experience and skills, as well as the candidate&#8217;s work location and internal equity. This position is also eligible for health insurance, 401k and bonus opportunity.</p><strong>Qualifications</strong><strong>JOB REQUIREMENTS (Education, Experience, and Training):</strong><br /><ul>\n<li>At least ten (10) years of demonstrated expertise designing, implementing, and supporting Enterprise-grade technical solutions meeting complex business requirements in Salesforce Sales Cloud.</li>\n<li>Excellent knowledge of Sales Cloud functionality including Territory Management, Collaborative Forecasting, Pipeline Inspection etc., with experience in Sales domain.</li>\n<li>Proficiency in Salesforce security, user management, platform maintenance, data modelling, reports and dashboards.</li>\n<li>Proficiency in Apex programming.</li>\n<li>Strong experience working with Lightning, and Lightning Web Components, SOOL, Visualforce and other SF tools.</li>\n<li>Familiarity with integration patterns such as batch processing, event driven architecture, and real-time integrations.</li>\n</ul><ul>\n<li>Excellent communication skills and ability to collaborate effectively with cross-functional teams and stakeholders.</li>\n</ul><ul>\n<li>Strong analytical and problem-solving skills, with a keen attention to detail and accuracy.</li>\n<li>Required – PD I certification, preferred PDII</li>\n<li>Preferred – Sales Cloud Consultant Certification</li>\n</ul><p><strong>KNOWLEDGE AND SKILLS DESIRED:</strong></p><ul>\n<li>Experience with Continuous Integration and automated testing strategies. </li>\n<li>Experience with Account Engagement (Pardot).</li>\n<li>Working knowledge of JIRA, Confluence, Kanban methodology.</li>\n</ul><strong><u>BENEFITS</u></strong><p>We realize that our employees are instrumental to our success, and we reward them accordingly with very competitive compensation and benefits packages, an incentive bonus program, as well as recognition and awards programs. Our work environment is friendly and supportive, and we offer flexible schedules whenever possible, as well as a wide range of live and web-based professional development and educational programs to prepare you for advancement opportunities.</p><p>Your benefits will include:</p><ul>\n<li>Medical, dental and vision coverage with low deductible &amp; copay</li>\n<li>Life insurance</li>\n<li>Short and long-term disability</li>\n<li>401(k) + match</li>\n<li>Generous Paid Time Off</li>\n<li>Paid company holidays</li>\n<li>Tuition reimbursement</li>\n<li>Flexible Spending Account</li>\n<li>Employee Assistance Program</li>\n</ul><p><strong><u>EEO STATEMENT</u></strong></p><p>Claritev is an Equal Opportunity Employer and complies with all applicable laws and regulations. Qualified applicants will receive consideration for employment without regard to age, race, color, religion, gender, sexual orientation, gender identity, national origin, disability or protected veteran status. </p><p>#LI-AS1</p>",
        "url": "https://jobicy.com/jobs/124507-principal-salesforce-engineer-sales-cloud-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-03T17:48:36+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/f4236a63-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Tax Manager (Remote in US)",
        "company": "Gainwell Technologies",
        "location": "USA",
        "description": "Great companies need great teams to propel their operations. Join the group that solves business challenges and enhances the way we work and grow. Working at Gainwell carries its rewards. You’ll have an incredible opportunity to grow your career in a company that values your contributions and puts a premium on work flexibility, learning, and...",
        "html_description": "<p>Great companies need great teams to propel their operations. Join the group that solves business challenges and enhances the way we work and grow. Working at Gainwell carries its rewards. You’ll have an incredible opportunity to grow your career in a company that values your contributions and puts a premium on work flexibility, learning, and career development. </p><h2><b>Summary</b></h2><p>As a Tax Manager at Gainwell, you can contribute your skills as we harness the power of technology to help our clients improve the health and well-being of the members they serve — a community’s most vulnerable. Connect your passion with purpose, teaming with people who thrive on finding innovative solutions to some of healthcare’s biggest challenges. Here are the details on this position.</p><h2><b>Your role in our mission</b></h2><ul>\n<li>Manages externally prepared income tax provisions and compliance.</li>\n<li>Coordinates and manages tax audits, inquiries and notices from tax authorities.</li>\n<li>Maintains documentation and records related to tax filings, provisions and other tax-related activities.</li>\n<li>Collaborates with other departments and teams, such as finance, legal and operations, to ensure alignment and coordination on tax matters.</li>\n<li>Provides guidance and support to internal stakeholders on financial issues, including tax implications of business decisions and transactions.</li>\n<li>Stays updated with changes in tax laws and regulations and proactively identify potential risks or opportunities for the organization.</li>\n<li>Fosters a culture of tax compliance and awareness throughout the organization, providing training and support as needed.</li>\n<li>Oversees the compilation, analysis and reporting of tax accounting data such as earnings, profits, cash balances, and other financial results to assess accuracy, completeness and conformance to reporting and procedural standards accuracy.</li>\n<li>Verifies general ledger accounts are reconciled monthly to meet business needs. Ensures accounts are accurate and up to date.</li>\n<li>Trains and evaluates employees to enhance their performance, development, and work product. Addresses performance issues and makes recommendations for personnel actions. Motivates and rewards employees including providing salary increases, bonuses and promotions within allocated budgets and company guidelines.</li>\n</ul><ul>\n<li>Assists in preparing operating and personnel budgets for approval. Monitors spending for adherence to budget, recommends variances as necessary.</li>\n</ul><h2><b>What we&#8217;re looking for</b></h2><ul>\n<li>Bachelor&#8217;s degree or equivalent combination of education and experience</li>\n<li>Five or more years of tax accounting experience (ASC 740) preferably in a public accounting environment</li>\n<li>Three or more years of leadership or supervisory experience</li>\n<li>Exceptional communication and interpersonal skills to effectively collaborate with internal and external stakeholders.</li>\n<li>Big four experience is preferable.</li>\n<li>Onesource, SAP and Checkpoint experience preferred</li>\n<li>CPA/JD Required</li>\n</ul><h2><b>What you should expect in this role</b></h2><ul>\n<li>Remote</li>\n</ul><p>The deadline to submit applications for this posting is 7/21/2025.</p><p>#LI-REMOTE</p><h2>LI-LM1</h2><p>#LI-NB1</p><p>The pay range for this position is $88,900.00 &#8211; $127,000.00 per year, however, the base pay offered may vary depending on geographic region, internal equity, job-related knowledge, skills, and experience among other factors. Put your passion to work at Gainwell. You’ll have the opportunity to grow your career in a company that values work flexibility, learning, and career development. All salaried, full-time candidates are eligible for our generous, flexible vacation policy, a <a href=\"https://jobs.gainwelltechnologies.com/content/benefits/?locale=en_US\" rel=\"nofollow ugc noopener\" target=\"_blank\">401(k) employer match, comprehensive health benefits</a>, and educational assistance. We also have a variety of leadership and technical development academies to help build your skills and capabilities.</p><p>We believe nothing is impossible when you bring together people who care deeply about making healthcare work better for everyone. Build your career with Gainwell, an industry leader. You’ll be joining a company where collaboration, innovation, and inclusion fuel our growth. Learn more about Gainwell at our <a href=\"https://www.gainwelltechnologies.com/\" rel=\"nofollow ugc noopener\" target=\"_blank\">company website</a> and visit our <a href=\"https://jobs.gainwelltechnologies.com/\" rel=\"nofollow ugc noopener\" target=\"_blank\">Careers site</a> for all available job role openings.</p><p><em>Gainwell Technologies is committed to a diverse, equitable, and inclusive workplace. We are proud to be an Equal Opportunity Employer, where all qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We celebrate diversity and are dedicated to creating an inclusive environment for all employees.</em></p>",
        "url": "https://jobicy.com/jobs/124505-tax-manager-remote-in-us",
        "source": "Jobicy",
        "posted_at": "2025-07-03T16:52:41+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/65f8901c-221.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Technical Support Engineer (US Remote)",
        "company": "Ordr, Inc.",
        "location": "USA",
        "description": "Ordr is looking for a Technical Support Engineer (TSE) in support of post sales customer and partner inquiries on product configuration, performance, and alignment of resources ensuring optimal product performance. Our TSEs work with customers to continuously ensure they are satisfied with the services and improve on areas that need attention. You must be energetic,...",
        "html_description": "<p>Ordr is looking for a Technical Support Engineer (TSE) in support of post sales customer and partner inquiries on product configuration, performance, and alignment of resources ensuring optimal product performance. Our TSEs work with customers to continuously ensure they are satisfied with the services and improve on areas that need attention. You must be energetic, passionate, and empathetic, desiring to make a real impact on the success of our customers and Ordr. You enjoy forging new relationships and winning over colleagues, customers, and business partners alike with your personable, yet professional, communication skills.</p><p>This is a unique opportunity to join an exciting startup in a hot space and make a tremendous impact on Ordr Security’s growth in this new emerging marketplace. The role reports to the VP of Customer Success, the work is remote, located in the U.S.A.</p><p></p><p><strong>ESSENTIAL DUTIES AND RESPONSIBILITIES</strong></p><p></p><p>Provide support to understand, troubleshoot, diagnose, reproduce, and provide fault isolation in resolving escalated technical issues.</p><p>Define, manage, and execute problem resolution plans and drives solutions/fixes through engineering and QA.</p><p>Effectively manages many different tasks simultaneously.</p><p>Periodically works with partners to perform problem isolation and resolution.</p><p>Participates in the review of technical documentation for training materials, technical marketing collateral, troubleshooting guides, etc.</p><p>Ability to use diagnostic aids, tools, and appropriate lab equipment, as necessary.</p><p>Maintain high levels of customer engagement and satisfaction with a focus on customer loyalty.</p><p>Partner closely with other cross-functional team members to translate customer needs and product requirements into new solutions for customers.</p><p><strong>EXPERIENCE &amp; QUALIFICATIONS</strong></p><p>5+ years of experience in a similar customer-facing job function.</p><p>5+ years Linux, VMWare ESXi, and Firewall knowledge.</p><p>Experience working in a B2B SaaS organization, strong familiarity with security concepts, remote access, and cloud.</p><p>Strong empathy for customers, passion for customer success and ability to drive urgency with customers.</p><p>Must have strong switch and router expertise.</p><p>CCNA, JNCIE or higher preferred.</p><p>802.1x/NAC, Cybersecurity, Vuln management.</p><p>Strong communication, interpersonal, and customer service skills.</p><p>The ability to relate technical information to non-technical customers.</p><p>Excellent communication, documentation, and presentation skills.</p><p>Experience with CSM and CRM tools.</p><p>Diplomacy, tact, and poise under pressure when working through customer issues.</p><p><em>As an equal opportunity employer, we are open to considering every qualified candidate who is eligible and legally authorized to work in the United States on a full or part-time basis, without a need for sponsorship.</em></p><p><em> </em></p><p><em>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.</em></p><p></p><p>Salary Range: $185,000 &#8211; $215,000. Our job titles span more than one career level. Actual base pay is dependent upon many factors including but not limited to training, transferable skills, work experience, business needs and location.</p>",
        "url": "https://jobicy.com/jobs/124441-technical-support-engineer-us-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-02T19:18:16+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/d19aa5ef-221.png",
        "job_level": "Any",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Sales Engineer (Central Region &amp;#8211; Remote)",
        "company": "Upwind Security",
        "location": "USA",
        "description": "DescriptionUpwind is a next-generation Cloud Security Platform that leverages runtime context to identify and prioritize critical risks, providing precise insights and efficient cloud security management. Unlike traditional tools, Upwind uses runtime data proactively for risk prioritization and posture insights, ensuring teams focus on what truly matters. With industry-leading efficiency and eBPF-powered sensors, Upwind delivers comprehensive...",
        "html_description": "<h2>Description</h2><p>Upwind is a next-generation Cloud Security Platform that leverages runtime context to identify and prioritize critical risks, providing precise insights and efficient cloud security management. Unlike traditional tools, Upwind uses runtime data proactively for risk prioritization and posture insights, ensuring teams focus on what truly matters. With industry-leading efficiency and eBPF-powered sensors, Upwind delivers comprehensive capabilities, including agentless cloud posture discovery, real-time threat protection, and integrated API security. From misconfigurations to malware defense, Upwind ensures end-to-end, cost-effective cloud infrastructure protection. At Upwind, you’ll have the opportunity to think creatively, explore new ideas, and use your skills to make a meaningful impact on our growth.</p><p></p><p>We are looking for an experienced Solutions Architect to join our team of expert sellers that is deeply committed to building meaningful relationships with customers, focusing on their value and thinking strategically about bringing deals to close.</p><p>This is a field sales engineering role open to qualified candidates in the Central time zone. </p><p></p><p><strong>﻿Responsibilities </strong></p><ul><li>Develop a deep understanding of Upwind&#8217;s cloud security products and services</li><li>Collaborate with the sales team to understand customer requirements and tailor technical solutions to meet their needs</li><li>Provide technical guidance and support throughout the sales cycle</li><li>Lead and manage the execution of POC engagements to demonstrate the effectiveness of our solutions.</li><li>Act as a liaison between the sales and product development teams, providing valuable insights from customer interactions</li></ul><h2>Requirements</h2><ul><li>Proven experience as a Sales /Solutions Engineer or in a similar technical pre-sales role within the cloud security industry</li><li>In-depth knowledge of cloud computing, cybersecurity principles, and industry best practices</li><li>Strong presentation and communication skills with the ability to convey technical concepts to a non-technical audience</li><li>Ability to work independently and collaboratively in a remote team environment</li><li>Experience with cloud platforms such as AWS, Azure, or Google Cloud</li><li>Experience with Terraform, k8s and containers is a plus</li></ul>",
        "url": "https://jobicy.com/jobs/124440-sales-engineer-central-region-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-02T19:18:13+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/920eb070-221.png",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Collections Consultant –Process Associate – Spanish – Remote – Romania",
        "company": "Genpact",
        "location": "Romania",
        "description": "Collections Consultant –Process Associate – Spanish – Remote – Romania-BFS044821Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless...",
        "html_description": "Collections Consultant –Process Associate – Spanish – Remote – Romania-BFS044821<p>Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless pursuit of a world that works better for people – we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI.</p>\n\n<p>Inviting applications for the role of <b>Collections Consultant –Process Associate – Spanish – Remote – Romania!*</b></p>\n\n<p><b>Responsibilities</b> </p>\n<p>· Answering phone calls in the mentioned languages, with a nice, controlled voice, on a priority established by the team leader </p>\n<p>· The purpose of this position is to communicate verbally/in written with the clients and the related departments in order to collect the debt registered by them, according to the Standardized Operating Procedures and Work Instructions</p>\n<p>· Ensure file management according to the flow (writings / requests / calls, credit investigations)</p>\n<p>· Customer service through electronic channels</p>\n<p>· Projecting a positive image of the company and brand</p>\n<p>· Implementing changes using your creativity and focus on process improvement</p>\n<p>· Verify and update customer information during each telephone exchange</p>\n<p>· Negotiate an immediately regularization of unpaid invoices (resumption of direct debits, collection by credit card, etc.)</p>\n<p>· Sharing with all team members any relevant knowledge obtained through customer interactions</p>\n<p>· Attending training sessions </p>\n<p>· Arranging working schedules with colleagues flexibly, according to business needs </p>\n<p>· Successfully completing the training plan and passing the process knowledge test (PKT) on a regular basis </p>\n<p>· Providing assistance to new colleagues whenever possible. </p>\n<p>· Inform the process trainers and the management team whenever the information in an SOP is identified as out-of-date </p>\n<p><b>Qualifications</b> </p>\n<p><b>Minimum qualifications</b> </p>\n<p>· Very good knowledge of Spanish (C1) and English (B2) </p>\n<p>· Bachelor’s degree.</p>\n<p>· Good MS Office knowledge. </p>\n<p>· Analytical thinking and self-starter. </p>\n\n<p><b>Preferred qualifications </b></p>\n<p>· Relevant experience in phone customer service/collections.</p>\n<p>· High motivation and ability to learn. </p>\n<p>· Ability to work under time pressure. </p>\n<p><b> </b></p>\n<p><b>What can we offer? </b> </p>\n<p>· Attractive salary;</p>\n<p>· Stable job offers &#8211; employment contract</p>\n<p>· Work in a multicultural and diverse environment with employees from over 30 countries</p>\n<p>· Genpact supports professional trainings and great career development opportunities</p>\n<p>· Free access to our award-winning learning platform </p>\n<p>· Benefits such as Meal Tickets, Medical Services, Insurance, additional vacation days or partner discounts</p>\n\n<p><b>Genpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. </b>Genpact is committed to creating a dynamic work environment that values respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com. Follow us on Twitter, Facebook, LinkedIn, and YouTube. </p>\n\n<p>Furthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a &#8216;starter kit,&#8217; paying to apply, or purchasing equipment or training. </p>\n <h2>Job</h2> Process Associate<h2>Primary Location</h2> Romania-Iasi<h2>Schedule</h2> Full-time<h2>Education Level</h2> Bachelor&#8217;s / Graduation / Equivalent<h2>Job Posting</h2> Jul 2, 2025, 11:11:00 AM<h2>Unposting Date</h2> OngoingMaster Skills List OperationsJob Category Full Time",
        "url": "https://jobicy.com/jobs/124418-collections-consultant-process-associate-spanish-remote-romania",
        "source": "Jobicy",
        "posted_at": "2025-07-02T16:16:43+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/005b6393-221.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Amazing Project Planners &amp;#8211; Construction, Turkey (Hybrid/Remote)",
        "company": "Laminar Projects",
        "location": "Türkiye",
        "description": "Are you a bit tired of the standard, old-fashioned way of doing things in the construction industry?Do you get deep satisfaction from making things run more efficiently using a good dose of common sense and maybe a bit of technology? Have you always cared about the importance of proper planning and the connection between the schedule...",
        "html_description": "<p>Are you a bit tired of the standard, old-fashioned way of doing things in the construction industry?Do you get deep satisfaction from making things run more efficiently using a good dose of common sense and maybe a bit of technology? Have you always cared about the importance of proper planning and the connection between the schedule and the real, day-to-day delivery of the job? Have you ever wanted to work a bit more flexibly but still be hands-on in construction and improving the industry? Sounds like a dream. Well, it isn’t. It’s quite real! Read on. ____________________________________________________________We are Laminar Projects!If you’ve already heard about us, you’re probably reading this because you’re tired of the typical, chaotic ways of doing things in construction. But in case you haven’t, we’re a high-end project management consultancy and tech developer with a focus on upgrading the way construction projects are delivered.Improving construction strengthens the very foundation of human civilisation. (Check out our short film about it.) We bring transparency and control to projects through a pragmatic mix of the latest tech, our own processes, and a big dose of common sense. We then take our deep understanding of these projects and we invest heavily into developing the digital solutions that anyone can use to deliver their projects better. (Check out Shape, our construction management tech, to see what we’re doing.)The core of all this is our true secret sauce: our people. We only recruit the very best, both in capability and personality. We’re deeply focused on designing a new type of organisation that’s optimised for the flourishing of the people in the team first and foremost. People who join us develop fast as a whole person in ways they never imagined. (Read more about our vision and missions.)This approach has allowed us to grow from just two people in 2017 to over 220 today. We have a stable, repeat client base across infrastructure and complex building projects in the UK and internationally, and we’re still growing fast. Joining us isn’t just some “job”. It’s a transformative educational experience. We challenge you to be your best self in all aspects of life. There are many diverse and interesting challenges available. It’s up to you to guide yourself into whichever areas you’re most interested – we’ll enable it. (Get to know us better by watching a few more of our videos.)Core values for a good lifeA life of human flourishing is all about meaningful relationships and challenging yourself to create a positive impact, so our values reflect the four levels of relationships that each of us has:- Grow yourself – your relationship with yourself &#8211; Care about people – your relationship with others around you &#8211; Execute to greatness – your relationship with your team &#8211; Build civilisation – your relationship with humanity and the world  We enshrined our values in our vision:We exist so that everyone in our team can flourish in a high-impact community that:- Connects us with meaningful relationships &#8211; Inspires us to develop ourselves to become better humans &#8211; Empowers us to pursue our own learning adventures  By first doing this, we can achieve the highest levels of value for the world.And enable the achievement of our vision through our two missions:- To fully digitalise the construction of human civilisation &#8211; To create a new type of organisation that enables human flourishing while delivering a huge positive impact on society ____________________________________________________________The Role Purpose of the role You’ll be enhancing the delivery of the most complex and interesting projects in the world through the power of project planning to the very highest standards. You’ll devise strategies and tactics to improve the way the project is delivered. You’ll translate this knowledge into a logic-linked plan and analyse it using planning software. Then you’ll use the plan to help the teams understand what to prioritise. Your team This role is part of our Project Management Consultancy team which focuses on:- Understanding what the real problems of projects are &#8211; Implementing the best solutions to those problems &#8211; Developing scalable best practices, tools and technology More specifically, you’ll be part of our Project Planning Team, who are industry leaders in the planning of complex construction projects. Your initial leader will be one of our planning discipline directors.Your top three objectives 1. To make construction projects deliver to near perfection 2. To create scalable and repeatable solutions to common problems 3. To develop yourself and everyone around you Your top five responsibilities 1. Own the plan: Own the project plan for one or more projects and ensure that the project is working to it effectively. Ensure delays are mitigated and managed commercially 2. Own the outcome: You&#8217;re responsible for putting in your best effort to ensure the project team’s understanding and focus on the plan – no matter how stubborn they are 3. Report and inform: Provide simple, actionable reports to stakeholders at all levels that help them deliver their part of the project more efficiently and effectively 4. Make scalable solutions: Develop scalable and repeatable best practices and tools in collaboration with the team so that long-term impact is achieved 5. Develop everyone: Maximise the development of your team personally and professionally and educate our clients to improve as well  You must have:- A construction engineering background: You have at least 2+ years of experience on construction projects, experience in project planning both software and principles, as well as decent Excel skills, and a strong interest in data- Communication skills: You’re proficient in written and verbal English and have the charisma and influence to get construction people to do new things and take the best approach &#8211; Leadership capabilities: You lead yourself proactively and lead others by asking the right questions and challenging them &#8211; Impact: You have a track record of making projects and organisations better beyond just doing the basics – implementing scalable, repeatable solutions that had a significant positive impact Laminar isn’t the place for you if any of the following is true: &#8211; You want an easy, chilled-out role without much challenge &#8211; You like to be the smartest person in the room &#8211; You don’t like continuously receiving honest candid feedback &#8211; You prefer to do your own thing rather than work with a team____________________________________________________________Frequently Asked Questions What kinds of projects would I be working on?It’scommon for people to be exposed to several projects in their first year with us. You’ll work on some of the most complex and interesting environments in the world. We’ve delivered over 100 data centres internationally, many of them fast-tracked and multi-package; flagship infrastructure programmes like HS2, where we’ve supported integrated planning and digital delivery; over $30bn in power generation and transmission projects; and high-containment labs and R&amp;D campuses for some of the world’s most advanced industrial and life sciences clients. These aren’t hands-off projects – they’re dynamic environments for people who want to be challenged. We bring back the lessons from all of them to help our team learn, grow, and continue delivering the highest levels of value. (Check out our case stories.)  Who are our clients?Major owners/operators and main contractors with project values between £1m and £1bn+ globally.  Where would I be working?One week you might be working from home. The next, you might travel to the site to meet the construction teams and help organise them. Maybe you’ll pop into our London office for a workshop or a beer. Maybe you’ll fly out to exotic (and sometimes not!) locations in Europe or the Middle East to visit clients. It really depends on what you want to get involved in and what fits with your life.  How does what I do connect with the long-term impact on the construction industry? You’re tasked with understanding and solving common problems. We don’t want to reinvent the wheel every time, so you’ll be responsible for documenting new solutions and evolving ones we’ve developed. This goes into our knowledge repository, which we’re going to open source to the industry. The knowledge you capture will be used by us to build new products. You’ll constantly test those products in the field, so we can rapidly iterate and improve them for anyone in the industry to use. ____________________________________________________________BenefitsThe standard stuff: &#8211; Bonus Scheme. As a permanent member of the team, you’ll share in our success. Our annual bonus is designed to reward both the now and the future – with a flexible mix of cash and high-growth equity that you choose. Bonuses are discretionary and based on performance- Professional body membership. One fee covered per year – so you can stay connected to your field and develop your craftThe life-changing stuff:- In-house coaching. Regular 1:1 coaching sessions, fully confidential, to help you navigate challenges, build self-awareness, and grow intentionally – professionally and as a human being- Equity upside. As we grow, you grow. Our generous equity scheme is especially powerful for those who stay with us on our journey. You help us build the future – and own a piece of it- Flexible working. Work where it makes sense – most of our team works from home, visiting sites or clients regularly. We care about outcomes, not clock-ins- Relentless development. Our goal is for every year here to be worth five years of development anywhere else. You’ll get a coach, a mentor, honest feedback, and a culture that challenges you to keep levelling up____________________________________________________________Important! Applying properlyWe get thousands of applications so please write us a letter as part of your application explaining:- Why you want to join us &#8211; What you’ll bring to the team We aren&#8217;t a giant, faceless corporation; we really care about the people who want to join our team, so your letter will be read carefully. After that, we’ll reach out to you to schedule a casual conversation to help you get to know us a bit better and tell us a bit about yourself. A couple of technical and personal assessments follow to understand your capability based on our own development matrix.  This is to ensure that when you join, you’re starting at the right level of responsibility. </p>",
        "url": "https://jobicy.com/jobs/124402-amazing-project-planners-construction-turkey-hybrid-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-02T05:26:58+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/5bd8df6b-221.png",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Principal, Model Validation &amp;#8211; GAI &amp;#038; Emergent Methods (US-REMOTE)",
        "company": "Ally Financial",
        "location": "USA",
        "description": "General information Career area Risk Work Location(s) AK, AL, AR, AZ, CA, CO, CT, DC, DE, FL, GA, HI, IA, ID, IL, IN, KS, KY, LA, MA, MD, ME, MI, MN, MO, MS, MT, NC, ND, NE, NJ, NM, NV, NY, OH, OK, OR, PA, RI, SC, SD, TN, TX, UT, VA, VT, WA, WI,...",
        "html_description": "<h2> General information </h2><p> Career area Risk Work Location(s) AK, AL, AR, AZ, CA, CO, CT, DC, DE, FL, GA, HI, IA, ID, IL, IN, KS, KY, LA, MA, MD, ME, MI, MN, MO, MS, MT, NC, ND, NE, NJ, NM, NV, NY, OH, OK, OR, PA, RI, SC, SD, TN, TX, UT, VA, VT, WA, WI, WV, WY Remote? Yes Ref # 20163 Posted Date 06-30-25 Anticipated Application Closing Date 07-11-25 Working time Full time </p><h2> Ally and Your Career </h2><p> Ally Financial only succeeds when its people do &#8211; and that’s more than some cliché people put on job postings. We live this stuff! We see our people as, well, people &#8211; with interests, families, friends, dreams, and causes that are all important to them. Our focus is on the health and safety of our teammates as well as work-life balance and diversity and inclusion. From generous benefits to a variety of employee resource groups, we strive to build paths that encourage employees to stretch themselves professionally. We want to help you grow, develop, and learn new things. You’re constantly evolving, so shouldn’t your opportunities be, too?<br><u>Work Schedule:</u> Ally designates roles as (1) fully on-site, (2) hybrid, or (3) fully remote. Hybrid roles are generally expected to be in the office a certain number of days per week as indicated by your manager. Your hiring manager will discuss this role&#8217;s specific work requirements with you during the hiring process. All work requirements are subject to change at any time based on leader discretion and/or business need. </p><h2> The Opportunity </h2><p><em>This role can be fully remote in the US.</em></p><p>The principal is responsible for executing best-practice Artificial Intelligence (AI) model validations to ensure that state-of-the-art GAI &amp; emergent method models across the organization are trustworthy, unbiased, conceptually sound, comply with legal and regulatory standards, and continuously solve business objectives. The principal is likewise expected to stay abreast with the latest industry research related to GAI. The principal is also responsible for coaching and mentoring junior analysts to promote cross learning.</p><h2> The Work Itself </h2><ul><li>Comprehensively verify and validate various dimensions of AI models (both discriminative and generative) across Ally to identify technical and process gaps, reducing risk by identifying errors and prescribing corrective action.</li><li>Develop AI and Machine Learning benchmarks as needed.</li><li>Occasionally, provide engineering support (i.e., data, machine learning) to the model validation teams as needed.</li><li>Document and present findings to the model validation leadership and stakeholders.</li><li>Provide input to model risk management framework for Ally, including annual validation plans, model inventory, and model risk ranking.</li><li>Develop and maintain effective partnerships with participants/stakeholders within Ally&#8217;s model risk management community.</li><li>Foster and cultivate GAI and data science best practices across the organization.</li></ul><h2> The Skills You Bring </h2><ul><li>5+ years data science, advanced analytics, or model validation-specific experience.</li><li>5+ years in financial services or financial technology preferred.</li><li>Advanced degree in finance, economics, statistics, data science, or related field recommended. However, equivalent experience is equally considered.</li></ul><strong><u>Technical Competencies:</u></strong><br><ul><li>Familiarity with market, credit, and operational risk measurement methodologies.</li><li>Experience with AI (e.g., GAI, NLP, ML).</li><li>Experience with data science applied to financial services.</li><li>Experience with machine learning applied to financial applications.</li><li>Ability to assess model concept and design, theoretical foundations, technical assumptions, data, and process controls, model implementation and execution, and outcome analysis.</li><li>Demonstrated analytical approach to complex processes.</li></ul><strong><u>Personal Competencies:</u></strong><br><ul><li>Adept at working in a multi-faceted organization.</li><li>Strong technical writing and verbal communication skills.</li><li>Strong learning agility and rapid comprehension.</li><li>Continuous multidisciplinary learner.</li></ul>#LI-Remote<h2> How We&#8217;ll Have Your Back </h2><p>Ally&#8217;s compensation program offers market-competitive base pay and pay-for-performance incentives (bonuses) based on achieving personal and company goals. Our Total Rewards program includes industry-leading compensation and benefits plus additional incentives that are designed to meet your needs and those of your family so you can get the most out of your career and your life, including:</p><ul><li><strong>Time Away:</strong> Program starts at 20 paid time off days in addition to 11 paid holidays and 8 hours of volunteer time off yearly (time off days are prorated based on start date and program varies based on full or part-time status and management level).</li><li><strong>Planning for the Future:</strong> plan for the near and long term with an industry-leading 401K retirement savings plan with matching and company contributions, student loan pay downs and 529 educational save up assistance programs, tuition reimbursement, employee stock purchase plan, and financial learning center and financial coach access.</li><li><strong>Supporting your Health &amp; Well-being:</strong> flexible health and insurance options including medical, dental and vision, employee, spouse and child life insurance, short- and long-term disability, pre-tax Health Savings Account with employer contributions, Healthcare FSA, critical illness, accident &amp; hospital indemnity insurance, and a total well-being program that helps you and your family stay on track physically, socially, emotionally, and financially.</li><li><strong>Building a Family:</strong> adoption, surrogacy and fertility assistance as well as paid parental and caregiver leave, Dependent Day Care FSA back-up child and adult/elder care days and childcare discounts.</li><li><strong>Work-Life Integration:</strong> other benefits including Mentally Fit Employee Assistance Program, subsidized and discounted Weight Watchers® program and other employee discount programs.</li><li><strong>Other compensations:</strong> depending on the role for which you are considered, you may be eligible for travel allowances, relocation assistance, a signing bonus and/or equity.</li><li>To view more detailed information about Ally’s Total Rewards, please visit this link: https://www.ally.com/content/dam/pdf/corporate/ally-total-rewards-snapshot.pdf</li></ul><p><strong><u>Who We Are:</u></strong></p><p>Ally Financial is a customer-centric, leading digital financial services company with passionate customer service and innovative financial solutions. We are relentlessly focused on &#8220;Doing it Right&#8221; and being a trusted financial-services provider to our consumer, commercial, and corporate customers. For more information, visit www.ally.com.</p><p>Ally is an equal opportunity employer committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition or any other reason protected by law.</p><p>We are committed to working with and providing reasonable accommodation to applicants with physical or mental disabilities. For accommodation requests, email us at hrpolicy@ally.com. Ally will not discriminate against any qualified individual who is capable of performing the essential functions of the job with or without reasonable accommodation.</p><strong><u>Base Pay Range</u></strong><p>: $110000 &#8211; $180000 USDAn individual&#8217;s position in the range is determined by the specific role, the scope and responsibilities of the role, work experience, education, certification(s), training, and additional qualifications. We review internal pay, the competitive market, and business environment prior to extending an offer. Incentive Compensation: This position is eligible to participate in our annual incentive plan.</p>",
        "url": "https://jobicy.com/jobs/124339-principal-model-validation-gai-emergent-methods-us-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-01T17:55:28+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/6632cc56-221-1.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Data Scientist, Remote",
        "company": "Experian",
        "location": "USA",
        "description": "Company DescriptionExperian is a global data and technology company, powering opportunities for people and businesses around the world. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, create marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics and software. We also assist millions...",
        "html_description": "<h2>Company Description</h2><p>Experian is a global data and technology company, powering opportunities for people and businesses around the world. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, create marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics and software. We also assist millions of people to accomplish their financial goals and help them save time and money.</p><p>We operate across a range of markets, from financial services to healthcare, automotive, agribusiness, insurance, and many more industry segments.</p><p>We invest in people and new advanced technologies to unlock the power of data. As a FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 22,500 people across 32 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com.</p><h2>Job Description</h2><p><strong>Overview</strong></p><p><strong>Experian Innovation Lab </strong>is a research and development unit at Experian formed with the desire to work in collaboration with Experian&#8217;s teams to enhance relationships with clients and acquire strategic datasets. Using our comprehensive understanding of individuals, markets and economies, we help organizations develop customer relationships to make their businesses more profitable.</p><p>As a <strong>Data Scientist </strong>at the Experian Innovation Lab, you will help develop analytical solutions, contributing to product prototypes, and helping evaluate data assets. You will bring experience in predictive modeling, machine learning, and deep learning to this position. You will report into the VP of Data Science</p><p><strong>Responsibilities</strong></p><ul><li>Craft advanced machine learning analytical solutions to extract insights from diverse structured and unstructured data sources.</li><li>Unearth data value by selecting and applying the right machine learning, deep learning and processing techniques.</li><li>Refine data manipulation and retrieval through the design of efficient data structures and storage solutions.</li><li>Innovate with tools designed for data processing and information retrieval.</li><li>Dissect and document vast datasets, analyzing them to highlight patterns and insights.</li><li>Solve complex challenges by developing impactful algorithms.</li><li>Ensure model excellence by validating performance scores and analyzing Return on investment and benefits.</li><li>Articulate model processes and outcomes, documenting and presenting findings and performance metrics.</li></ul><h2>Qualifications</h2><p><strong>Qualifications</strong></p><ul><li>Advanced degree in Machine Learning, Data Science, AI, Computer Science, or a related quantitative field.</li><li>1 or more years of experience in AI, data science, or predictive modeling</li><li>Proficiency in at least one programming language, with coding skills in Python</li><li>Experience with deep learning (CNN, RNN, LSTM, attention models), machine learning methodologies (SVM, GLM, boosting, random forest), graph models, or, reinforcement learning.</li><li>Experience with open-source tools for deep learning and machine learning technology such as pytorch, Keras, tensorflow, scikit-learn, pandas.</li><li>Experience with large data analysis using Spark (pySpark preferred)</li><li>Experience with LLMs and the relevant tools in the Generative AI domain.</li><li>Experience developing advanced language models</li><li>Experience applying Generative AI-based tools</li><li>Experience with Hadoop and NoSQL related technologies such as Map Reduce, Hive, HBase, mongoDB, Cassandra.</li><li>Experience modifying and applying advanced algorithms to address practical problems</li></ul><h2>Additional Information</h2><p><strong>Benefits</strong>.</p><ul><li>20 vacation days to start (along with 12 paid holidays)</li><li>Great compensation package and comprehensive benefits package, with a bonus of 20%</li><li>Flexible work schedule and relaxed dress code</li><li>#LI-Remote</li></ul><p>Our uniqueness is that we celebrate yours. Experian&#8217;s culture and people are important differentiators. We take our people agenda very seriously and focus on what matters; DEI, work/life balance, development, authenticity, collaboration, wellness, reward &amp; recognition, volunteering&#8230; the list goes on. Experian&#8217;s people first approach is award-winning; World&#8217;s Best Workplaces™ 2024 (Fortune Top 25), Great Place To Work™ in 24 countries, and Glassdoor Best Places to Work 2024 to name a few. Check out Experian Life on social or our Careers Site to understand why.</p><p>Experian is proud to be an Equal Opportunity and Affirmative Action employer. Innovation is an important part of Experian&#8217;s DNA and practices, and our diverse workforce drives our success. Everyone can succeed at Experian and bring their whole self to work, irrespective of their gender, ethnicity, religion, colour, sexuality, physical ability or age. If you have a disability or special need that requires accommodation, please let us know at the earliest opportunity.</p>",
        "url": "https://jobicy.com/jobs/124271-data-scientist-remote",
        "source": "Jobicy",
        "posted_at": "2025-07-01T03:51:07+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/dcc5b29a570bb19b9f5c3e150db2fdfe.jpg",
        "job_level": "Entry-Level, Junior",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "CTO &amp;#038; Co-founder Recruiting Tech (Remote &amp;#8211; Lisbon)",
        "company": "Companeo",
        "location": "Portugal",
        "description": "A-ha! Ready to disrupt recruitment?We&amp;#8217;re ambi.careers – not your average recruitment agency. We&amp;#8217;re building a talent marketplace and other AI powered recruitment tools, to connect brilliant professionals with startups and scaleups that are changing the game.No BS here. After years in executive recruitment and building startups from scratch, we&amp;#8217;re sick of the empty promises, cookie-cutter...",
        "html_description": "<strong>A-ha! Ready to disrupt recruitment?</strong><p>We&#8217;re ambi.careers – not your average recruitment agency. We&#8217;re building a talent marketplace and other AI powered recruitment tools, to connect brilliant professionals with startups and scaleups that are changing the game.<br><strong>No BS here.</strong> After years in executive recruitment and building startups from scratch, we&#8217;re sick of the empty promises, cookie-cutter approaches, and soul-crushing corporate speak that plagues this industry.We&#8217;re combining cutting-edge tech with real human insight to create something that actually works for our clients.<br><strong>The opportunity:</strong> Simple – we want to really step up our tech products and need a Co-founder/CTO to help us define the vision and scale. Our vision is massive, and we need tech firepower to match. We also believe we could bootstrap together til very far, so we probably don&#8217;t wanna go through the classic startup funding path, but generate real income asap.</p><h2>What we’ve built so far</h2><p>✅ A working <strong>AI-powered sourcing tool</strong><br>✅ Real jobs, candidates, and data flowing through the system<br>✅ Early version of our market insights module<br>✅ A talent marketplace and job board creator we already run for VC funds<br>✅ A lean and validated roadmap for real client impact<br>✅ Real users using this every week</p><h2>What we’re looking for</h2><p>We’re seeking a <strong>CTO Co-Founder</strong> who wants to build real product, not just ideas. You’ll lead technical development and help shape the product — while keeping things simple, lean, and focused on real value.</p><p><strong>You can freelance elsewhere in the beginning.</strong> There’s no salary at this stage — but there’s equity, ownership, and freedom.</p><h2>You’re probably a fit if you:</h2><p>Are <strong>hands-on with code</strong> (especially Python, APIs, AI integrations)</p><p>Have <strong>practical experience using AI</strong> (e.g. LLMs, Gemini, scraping, automations)</p><p>Know how to <strong>build lean backend-first MVPs</strong> (FastAPI, Streamlit, etc.)</p><p>Enjoy building things people use — fast, smart, and without BS</p><p>Want <strong>equity and money from a real, potential bootstrapped product</strong> </p><p>See yourself scaling this with us (even slowly at first)</p><h2>Tech stack (current &amp; expected)</h2><p>Python (FastAPI or Flask)</p><p>Streamlit for UI</p><p>Google Gemini API (we’re open to changing LLM providers)</p><p>PostgreSQL or SQLite</p><p>Bubble would be nice</p><p>API&#8217;s in general<br>Web Crawlers</p><p>Advanced scraping (LinkedIn public pages, job boards)</p><p>Render, Railway, etc.</p><h2>What we offer</h2><p><strong>Equity</strong> in the product — clean cap table, fairness and transparency</p><p><strong>Clients and data from day one</strong></p><p>Real-world use case + revenue already happening</p><p>Autonomy and room to shape product + tech</p><p>Option to <strong>start part-time, then go deeper</strong></p><p>A lean roadmap and no time wasted on fake traction</p><h2>Next steps</h2><p>We’re open to builders who want to start part-time, and grow into a founding role. If you want to work on something real, smart, and ready to scale — let’s talk.</p><br><strong>This is for you if:</strong><ul><li>You&#8217;ve built software for HR-tech, marketplaces, or similar platforms</li><li>You&#8217;re wasted as just an employee – you want to build something that matters</li><li>You&#8217;ve got hands-on AI experience and can see its potential in recruitment</li><li>Your English is good (our clients and candidates are primarily native speakers)</li><li>You have a genuine growth mindset and want to build something from the ground up</li><li>You can commit real time to this – not just scraps after your day job</li></ul><strong>Not for you if:</strong><ul><li>You expect a fat co-founder salary from day one</li><li>You&#8217;re an ego-driven tech bro with zero empathy</li><li>You crumble when things get tough (and they will)</li></ul><p>Ready to revolutionize how talent finds their place in the tech world? We&#8217;re going to be the #1 destination for startups and scaleups looking to hire exceptional talent, and you could be the technical brain behind it.Let&#8217;s chat?</p>",
        "url": "https://jobicy.com/jobs/124238-cto-co-founder-recruiting-tech-remote-lisbon",
        "source": "Jobicy",
        "posted_at": "2025-06-30T14:33:33+00:00",
        "salary": "",
        "job_type": "part-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/7f3bca79-221.png",
        "job_level": "Director",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Customer Experience Manager &amp;#8211; Israel Remote",
        "company": "Akamai Technologies",
        "location": "Israel",
        "description": "Are you excited to work with innovative security products?Do you enjoy working with innovative solutions and helping enterprise customers to achieve their desired outcomes?Join the Akamai Enterprise Security GroupAkamai is changing the way organizations protect their data centers and clouds from advanced threats and that starts with our people. Our team boasts some of the...",
        "html_description": "<p><b>Are you excited to work with innovative security products?</b></p><p><b>Do you enjoy working with innovative solutions and helping enterprise customers to achieve their desired outcomes?</b></p><p><b>Join the Akamai Enterprise Security Group</b></p><p>Akamai is changing the way organizations protect their data centers and clouds from advanced threats and that starts with our people. Our team boasts some of the most talented and experienced cyber security and data center experts in the field. Were always looking for new people to inspire us and make us better.</p><p><b>Join Our Customer Success team!</b></p><p>The Customer Experience Manager develops and implements scalable programs or engagement, adoption, retention, and advocacy. Responsibilities include overseeing digital success strategies and establishing peer-driven community learning, engagement, and feedback initiatives.</p><p>In this role you will be:</p><ul><li>Designing and implementing scalable customer journeys; enhancing experience via automation, internal partnerships, and targeted communication strategies.</li><li>Building and moderating a digital community platform, driving engagement, cultivating advocates, and promoting product champions.</li><li>Monitoring customer health, analyzing data, collaborating on outreach strategies, and developing re-engagement digital plays.</li><li>Capturing customer insights, sharing feedback, informing priorities, and amplifying success stories across teams.</li></ul><p><b>Do what you love</b></p><p>To be successful in this role you will:</p><ul><li>5+ years in Customer Success, Customer Experience, or Community Management at a B2B SaaS or cybersecurity company.</li><li>Have experience in building digital success programs and/or launching customer communities.</li><li>Have analytical skills with experience using tools like Gainsight, Salesforce, or similar CS platforms.</li><li>Have excellent communication and content development skills (e.g., writing newsletters, creating help articles).</li><li>Be familiar with community platforms (e.g., Salesforce Experience Cloud, Khoros, Higher Logic, inSided) is a plus.</li><li>Possess empathetic, customer-focused mindset with the ability to influence across teams.</li></ul><p><b>Work in a way that works for you</b></p><p>FlexBase, Akamai&#8217;s Global Flexible Working Program, is based on the principles that are helping us create the best workplace in the world. When our colleagues said that flexible working was important to them, we listened. We also know flexible working is important to many of the incredible people considering joining Akamai. FlexBase, gives 95% of employees the choice to work from their home, their office, or both (in the country advertised). This permanent workplace flexibility program is consistent and fair globally, to help us find incredible talent, virtually anywhere. We are happy to discuss working options for this role and encourage you to speak with your recruiter in more detail when you apply. <br /><a href=\"https://www.akamai.com/careers\" target=\"_blank\" rel=\"nofollow ugc noopener\">Learn</a> what makes Akamai a great place to work</p><p>Connect with us on social and see what life at Akamai is like! </p><p><b>We power and protect life online, by solving the toughest challenges, together.</b></p><p>At Akamai, we&#8217;re curious, innovative, collaborative and tenacious. We celebrate diversity of thought and we hold an unwavering belief that we can make a meaningful difference. Our teams use their global perspectives to put customers at the forefront of everything they do, so if you are people-centric, you&#8217;ll thrive here.</p><p><b>Working for you</b></p><p>At Akamai, we will provide you with opportunities to grow, flourish, and achieve great things. Our benefit options are designed to meet your individual needs for today and in the future. We provide benefits surrounding all aspects of your life:</p><ul><li>Your health</li><li>Your finances</li><li>Your family</li><li>Your time at work</li><li>Your time pursuing other endeavors</li></ul><p>Our benefit plan options are designed to meet your individual needs and budget, both today and in the future.</p><p><b>About us</b></p><p>Akamai powers and protects life online. Leading companies worldwide choose Akamai to build, deliver, and secure their digital experiences helping billions of people live, work, and play every day. With the world&#8217;s most distributed compute platform from cloud to edge we make it easy for customers to develop and run applications, while we keep experiences closer to users and threats farther away.</p><p><b>Join us</b></p><p>Are you seeking an opportunity to make a real difference in a company with a global reach and exciting services and clients? Come join us and grow with a team of people who will energize and inspire you!<br />Akamai Technologies is an Affirmative Action, Equal Opportunity Employer that values the strength that diversity brings to the workplace. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of gender, gender identity, sexual orientation, race/ethnicity, protected veteran status, disability, or other protected group status.<br />#LI-Remote</p>",
        "url": "https://jobicy.com/jobs/124113-customer-experience-manager-israel-remote",
        "source": "Jobicy",
        "posted_at": "2025-06-29T04:18:35+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/06/85a7cc0e-221-1.jpeg",
        "job_level": "Midweight",
        "scraped_date": "2025-07-11"
    },
    {
        "title": "Senior Observability Architect (Remote, Netherlands)",
        "company": "Grafana Labs",
        "location": "Netherlands",
        "description": "Are you passionate about orchestrating an industry-leading customer experience? Grafana is evolving to create an elite team that will redefine post sales technical partnership in the industry: the Observability Architect. In this role, you’ll pioneer this new function. It’s an exciting opportunity to help drive a transformation of our Customer Experience organization. Position Overview: Observability Architects will...",
        "html_description": "<p>Are you passionate about orchestrating an industry-leading customer experience? Grafana is evolving to create an elite team that will redefine post sales technical partnership in the industry: the Observability Architect. In this role, you’ll pioneer this new function. It’s an exciting opportunity to help drive a transformation of our Customer Experience organization. </p><p><strong>Position Overview</strong>: </p><p>Observability Architects will plot the path to observability maturity and walk it with the customer. They will work hand in glove with our Engagement Managers, who manage service engagements and serve as a customer lifecycle Centre of Excellence. As an Observability Architect, you will be at the vanguard of evolving our practice to meet the unique demands of our customers. </p><p>You will own the long term adoption, expansion and overall experience of your portfolio of Grafana&#8217;s customers . The OA is responsible for managing technical relationships, providing strategic consulting, and ensuring the successful achievement of value and ROI of our products. This role requires a deep understanding of our technology, the ecosystem around it, excellent problem-solving skills, and the ability to communicate effectively with both technical and non-technical stakeholders. In short, you will drive Grafana Labs’s worldwide growth by becoming a strategic partner of existing customers to ensure they are happy, successful and realizing genuine value. </p><p>The OA will also be our customers’ primary technical contact as well as their voice to the Product Management and Engineering teams. </p><p>You’ll be elite, drive customer results and be the envy of the observability space.</p><p><strong>Key Responsibilities</strong>:</p><ul>\r\n<li>Serve as the primary technical point of contact for a portfolio of Grafana customers.</li>\r\n<li>Design the observability maturity journey of customers and assist them on that path. </li>\r\n<li>Provide expert-level troubleshooting and guidance to drive adoption.</li>\r\n<li>Conduct regular technical reviews and health checks to ensure client success. Assist in RCA to understand issues that affect customer satisfaction, retention, and overall product experience.</li>\r\n<li>Advise clients on best practices and strategies for leveraging our technology to achieve their business goals</li>\r\n<li>Collaborate with clients to develop and execute technical roadmaps.</li>\r\n<li>Identify opportunities for clients to optimize their cost, expand their use of our solutions and drive adoption of new products and features.</li>\r\n<li>Develop and maintain strong, long-term relationships with key stakeholders.</li>\r\n<li>With the support of our Engagement Managers and Onboarding Solutions Architects, own customer lifecycle.</li>\r\n<li>Drive the adoption and effective use of our product suite within your customer portfolio to maximize their value from our platform and ensure a strong return on investment.</li>\r\n<li>Act as the voice of the customer within the company, advocating for their needs, priorities and feature requests.</li>\r\n<li>Conduct training sessions and workshops to educate clients on our technology.</li>\r\n<li>Develop and deliver technical documentation, guides, and tutorials.</li>\r\n<li>Work alongside account teams to participate in and/or conduct regular reviews with customers to identify areas for improvement, calculate ROI, assess their satisfaction, and discuss upcoming needs and projects.</li>\r\n<li>Prepare and present reports on client metrics, achievements, and areas of focus.</li>\r\n</ul><p><strong>Qualifications</strong>:</p><ul>\r\n<li>Fluent in English and French (written and spoken)</li>\r\n<li>Bachelor’s degree in Computer Science, Information Technology, Math or a related field (or equivalent experience).</li>\r\n<li>Experience deploying and operating Kubernetes.</li>\r\n<li>5+ years of experience in a technical support, technical account management, consulting, SE or Professional Services role within the technology industry. </li>\r\n<li>Strong understanding of observability solutions. Grafana, Prometheus, and Loki a plus.</li>\r\n<li>Proven ability to manage multiple clients and projects simultaneously.</li>\r\n<li>Excellent problem-solving and analytical skills.</li>\r\n<li>Outstanding communication and interpersonal skills.</li>\r\n<li>Experience with relevant tools and technologies, e.g., CRM software, ticketing systems, specific programming languages.</li>\r\n<li>Ability to travel as needed to meet with clients (up to 25%).</li>\r\n</ul><p><strong>What would make you a good fit for this role?</strong></p><ul>\r\n<li>5+ years of technical sales, TAM or other post sales technical experience, ideally with open source technologies, or in the observability space.</li>\r\n<li>Great at connecting product usage to value (ROI).</li>\r\n<li>Great at managing customer lifecycle.</li>\r\n<li>You will be creative in solving customer adoption challenges.</li>\r\n<li>You can proactively assist customers with technical issues that may arise and assist in the troubleshooting and root cause analysis. </li>\r\n<li>Identify and provide timely workarounds and solutions to meet a customer’s business needs.</li>\r\n<li>You have some observability expertise, preferably architect level</li>\r\n<li>First class written and oral communication skills to collaborate with our remote-first internal teams and with our worldwide customers. Ability to articulate our value proposition and the technical advantages of our products</li>\r\n<li>You will love solving technical challenges and thrive on bringing creative solutions to our customers</li>\r\n<li>You should have a technical mindset and a desire to grow technically. Great candidates may be a recent grad of a coding bootcamp or have previous post-sales or engineering experience–we are excited to see what unique experiences and skill sets you bring to the table! </li>\r\n</ul><p>In Netherlands, the OTE compensation range for this role is €120,000 &#8211; €143,750. Actual compensation may vary based on level, experience, and skillset as assessed in the interview process. Benefits include equity, bonus (if applicable), and other benefits listed on our <a href=\"https://grafana.com/about/careers/#jobs\" rel=\"nofollow ugc noopener\" target=\"_blank\">careers page.</a></p><p> <strong>About Grafana Labs: </strong>There are more than 20M users of Grafana, the open source visualization tool, around the globe, monitoring everything from beehives to climate change in the Alps. The instantly recognizable dashboards have been spotted everywhere from a NASA launch and Minecraft HQ to Wimbledon and the Tour de France. Grafana Labs also helps more than 3,000 companies &#8212; including Bloomberg, JPMorgan Chase, and eBay &#8212; manage their observability strategies with the Grafana LGTM Stack, which can be run fully managed with <a href=\"https://grafana.com/products/cloud/\" target=\"_blank\" rel=\"nofollow ugc noopener\">Grafana Cloud</a> or self-managed with the <a href=\"https://grafana.com/products/enterprise/\" target=\"_blank\" rel=\"nofollow ugc noopener\">Grafana Enterprise Stack</a>, both featuring scalable metrics (<a href=\"https://grafana.com/oss/mimir/\" target=\"_blank\" rel=\"nofollow ugc noopener\">Grafana Mimir</a>), logs (<a href=\"https://grafana.com/oss/loki/\" target=\"_blank\" rel=\"nofollow ugc noopener\">Grafana Loki</a>), and traces (<a href=\"https://grafana.com/oss/tempo/\" target=\"_blank\" rel=\"nofollow ugc noopener\">Grafana Tempo</a>). <strong>Benefits: </strong>For more information about the perks and benefits of working at Grafana, please check out our <a href=\"https://grafana.com/about/careers/\" target=\"_blank\" rel=\"nofollow ugc noopener\">careers page</a>. <strong>Equal Opportunity Employer:</strong> At Grafana Labs we’re building a company where a diverse mix of talented people want to come, stay, and do their best work. We know that our company runs on the hard work and the dedication of our passionate and creative employees. If you&#8217;re excited about this role but your experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. We will recruit, train, compensate and promote regardless of race, religion, color, national origin, gender, disability, age, veteran status, and all the other fascinating characteristics that make us different and unique. We believe that equality and diversity builds a strong organization and we’re working hard to make sure that’s the foundation of our organization as we grow. <em>For information about how your personal data is used once you’ve applied to a job, check out our <a href=\"https://grafana.com/legal/applicant-and-candidate-privacy-policy/\" target=\"_blank\" rel=\"nofollow ugc noopener\">privacy policy</a>. </em></p>",
        "url": "https://jobicy.com/jobs/123974-senior-observability-architect-remote-netherlands",
        "source": "Jobicy",
        "posted_at": "2025-06-27T09:00:16+00:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/42a3c42246467ec231dd876e92b63452.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-07-11"
    }
]