[
    {
        "title": "Trust Junior Accountant",
        "company": "Ascensus",
        "location": "USA",
        "description": "Responsible for performing financial, administrative, and clerical services for multiple employer benefit trust clients, including: Gathering and processing financial data to assist Senior Accountant in completion of periodic financial statements, preparing reports of financial and statistical data and assisting/supporting the Senior Accountant in various general accounting duties such as journal entries, account reconciliations, and other&amp;#8230;",
        "html_description": "<p>Responsible for performing financial, administrative, and clerical services for multiple employer benefit trust clients, including: Gathering and processing financial data to assist Senior Accountant in completion of periodic financial statements, preparing reports of financial and statistical data and assisting/supporting the Senior Accountant in various general accounting duties such as journal entries, account reconciliations, and other month-end or periodic processes. Effectively communicate with internal sources as well as Clients, Trustees and other business partners.</p>\n<h2><b>Job Functions, Essential Duties and Responsibilities</b></h2>\n<p>Accounts Payable</p>\n<ul>\n<li>Accurately code invoices for correct G/L posting, as needed</li>\n<li>Enter invoices in Peachtree and Business Works for payment</li>\n<li>Manage the various payments via check or wire transfer, including attaining trustee signature and mailing to appropriate vendors</li>\n<li>Communicate effectively with Clients and Vendors regarding accounts payable</li>\n<li>Maintain vendor account information</li>\n<li>Research and resolve vendor issues</li>\n<li>Prepare and issue annual 1099s, W2s, and W3s as needed</li>\n<li>Payroll Processing for Trust Client Employees, as required</li>\n</ul>\n<p>Remit payroll taxes</p>\n<ul>\n<li>General Ledger/Month-End Process for Multiple Trust Clients</li>\n<li>Research and resolve discrepancies in financial data related to A/P</li>\n<li>Verify and post bank transfer activity as required</li>\n<li>Accumulate data and post journal entries (recurring and as directed by Senior Accountant)</li>\n<li>Calculate broker commissions as needed, print checks and prepare accompanying letters</li>\n<li>Prepare required monthly financial reports for trustees, as requested</li>\n</ul>\n<p>Audit Assistance</p>\n<ul>\n<li>Maintain financial files and documents according to established guidelines</li>\n<li>Ensure thorough and complete audit trail for all journal entries and adjustments</li>\n<li>Assist in producing requested documentation for annual trust audits</li>\n<li>Assist Sr Accountant in answering auditor questions regarding internal controls, etc.</li>\n<li>Maintain audit file of backup documentation</li>\n</ul>\n<p>General Ledger</p>\n<ul>\n<li>Post Cash Receipts for Trusts, as required</li>\n<li>Prepare bi-weekly journal entries for Payroll</li>\n<li>Prepare and post journal entires of all monthly expenses per bank statements, as required</li>\n<li>Prepare retirement, dental and medical benefits worksheets for AP</li>\n<li>Prepare quarterly  and Year end EDD and IRS payroll Reports</li>\n</ul>\n<p>Other</p>\n<ul>\n<li>Ensure proper maintenance and online storage of financial data</li>\n<li>Monitor Cash position of various trust operating accounts</li>\n</ul>\n<p>May be required to work extra hours during peak periods</p>\n<ul>\n<li>Responsible for protecting, securing, and proper handling of all confidential data held by Ascensus to ensure against unauthorized access, improper transmission, and/or unapproved disclosure of information that could result in harm to Ascensus or our clients.</li>\n<li>Our I-Client service philosophy and our Core Values of People Matter, Quality First and Integrity Always® should be visible in your actions on a day to day basis showing your support of our organizational culture.</li>\n<li>Assist with other tasks and projects as assigned</li>\n</ul>\n<h2><b>Experience, Skills, Knowledge Requirements</b></h2>\n<ul>\n<li> Minimum of three years accounting experience,  Trust administration or related environment is a plus</li>\n<li>Critical thinking, analysis, detail orientation and customer service preferred</li>\n<li>Four year accounting degree preferred</li>\n<li>Knowledge of Generally Accepted Accounting Principles</li>\n<li>Strong knowledge of math and accounting functions required to reconcile accounts and prepare monthly financials</li>\n<li>Knowledge of multiple employer benefit trust tax reporting and audit requirements including deadlines and related penalties is a big plus</li>\n<li>Knowledge of methods for goal setting</li>\n<li>Organizational skills and ability to set priorities consistent with service standards</li>\n<li>Excellent attention to detail and ability to review and ensure quality of team member work</li>\n<li>Self-starter with ability to take initiative, effectively evaluate situations and implement solutions</li>\n<li>Ability to multi-task, meet deadlines and work closely with others in a team setting</li>\n<li>Ability to effectively communicate, both in writing and orally, with a wide range of  contacts in a professional manner</li>\n<li>Ability to maintain a positive attitude when addressing client questions and problems</li>\n<li>Accounting and Math Skills:  required for reconciling bank accounts and preparing cash basis and accrual basis financials in accordance with GAAP</li>\n<li>Software Skills: MS Office 2007 (Excel, Word, Outlook) with intermediate to advanced Excel skills,  Peachtree and Business Works</li>\n<li>Accounting system conversion skills a big plus</li>\n<li>Ability to document and maintain operations and accounting procedures</li>\n<li>Promote a positive and professional working environment</li>\n</ul>\n<p>We are proud to be an Equal Opportunity Employer</p>\n<p><i>Be aware of employment fraud. All email communications from Ascensus or its hiring managers originate from @ascensus.com </i><i>or @futureplan.com</i> <i>email addresses. We will never ask you for payment or require you to purchase any equipment. If you are suspicious or unsure about validity of a job posting, we strongly encourage you to apply directly through our website.</i></p>\n<p>For all virtual remote positions, in order to ensure associates can effectively perform their job duties with no distractions, we require an uninterrupted virtual work space and there is also an expectation of family care being in place during business hours. Additionally, there is an internet work speed requirement of 25 MBps or better for individual use. If more than one person is utilizing the same internet connection in the same household or building, then a stronger connection is required. If you are unsure of your internet speed, please check with your service provider. Note: For call center roles specifically, it is a requirement to either hardwire your equipment directly to the internet router or ensure your workstation is in close proximity to the router. Please ensure that you are able to meet these expectations before applying.</p>\n<p>At Ascensus, we aspire to make a difference for others. We are a technology-enabled services company that helps people save for a better future through our network of institutional, financial advisor, and state partners. Our culture is guided by sound principles, is committed to high standards, operates with transparency, and welcomes diversity—housed within our Core Values: People Matter. Quality First. Integrity Always.®</p>",
        "url": "https://jobicy.com/jobs/117029-trust-junior-accountant",
        "source": "Jobicy",
        "posted_at": "2025-04-21 13:36:12",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/06/65d9926631569e434a59253a83f286dc.jpg",
        "job_level": "Junior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Full Stack Developer",
        "company": "LimeSurvey",
        "location": "Anywhere",
        "description": "Our LimeSurvey survey platform is providing capabilities to create and collect online surveys and analyse and share survey data. The survey platform can be used to conduct simple questionnaires with just a couple of questions or advanced assessments with conditionals and quota management. We work closely with our community and partner network to co-create, fix&amp;#8230;",
        "html_description": "<p>Our LimeSurvey survey platform is providing capabilities to create and collect online surveys and analyse and share survey data. The survey platform can be used to conduct simple questionnaires with just a couple of questions or advanced assessments with conditionals and quota management.</p>\n<p>We work closely with our community and partner network to co-create, fix bugs, translate, and share knowledge. You will join our creative team and get involved in building the world’s #1 open-source survey platform.</p>\n<p>As the Software Engineer, you will have a key position in our Survey Platform Development team.  You will help build a versatile, open-source survey tool for newcomers and professionals. So they can get the freshest insights &#8211; as easy as squeezing a lime. Well, for the latter ‘easy’ part we could really use your help.</p>\n<h2><b>This will be your challenge:</b></h2>\n<ul>\n<li>You will be involved in the entire development cycle for frontend and backend topics</li>\n<li>You need to stay on top of new technologies and seek for possible improvements</li>\n<li>You will build new features and break them down from our product roadmap</li>\n<li>You will align back and forwards with team members and product owner</li>\n<li>You will come up with technical solutions for implementation and implement accordingly</li>\n<li>You will write technical requirements and implement them together with our team</li>\n<li>You are responsible for the code you write in line with our LimeSurvey coding guidelines</li>\n<li>Manage application maintenance and their environments</li>\n<li>Your code will be showcased to the rest of the world, since we’re open source</li>\n</ul>\n<h2><b>This is you:</b></h2>\n<ul>\n<li>You have worked on B2B, SaaS or Dev Tools</li>\n<li>You have solid programming skills and master PHP frameworks, Yii would be great but is always learnable</li>\n<li>You foster relationships with your team and have great communication skills + a getting things done mentality</li>\n<li>You understand technologies supporting the LimeSurvey ecosystem</li>\n<li>You are an active contributor to open source projects (or will be in the future ;-))</li>\n<li>You have a good sense of humour, and you stay calm in stressful situations</li>\n<li>You want to be part of a distributed down to earth team on a mission to create the world&#8217;s #1 open survey platform</li>\n</ul>\n<h2><b>Tech we use:</b></h2>\n<ul>\n<li>Yii-3 PHP Framework</li>\n<li>React JS</li>\n<li>Typescript</li>\n<li>Bootstrap 5</li>\n<li>Redis</li>\n<li>MySQL, MSSQL and Postgres</li>\n</ul>\n<p>Varied, interesting and challenging tasks, the chance to work with a growing dynamic distributed international team, room for creativity and your own ideas. We offer a wide range of training courses including language classes.</p>\n<p>We work flexible hours, distributed, from home or in the office. We offer a dynamic working environment with flexible hours remote, from home, or in the office if you’re nearby at headquarters in Hamburg. As well as an appropriate salary package based on cost of living including paid vacation, local public holidays, paid sick leave &amp; parental leave, employment &amp; contractor options.</p>\n<p>Be sure to mention the magic word IAMLIME when applying to show you read the job post completely. This is a beta feature to avoid spam applicants.</p>",
        "url": "https://jobicy.com/jobs/115704-full-stack-developer-4",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:33:59",
        "salary": "",
        "job_type": "full-time",
        "category": "Programming",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/04/d73f1339fb962579112a49efd2e825ef.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Global Marketing Program Sr. Manager",
        "company": "ServiceNow",
        "location": "Canada,  USA",
        "description": "The Global Marketing Program Senior Manager is responsible for the orchestration and operations that support the design, execution, and performance of ServiceNow’s global integrated marketing programs tailored to our most critical persona groups. This role requires strong project management expertise and end-to-end marketing program and/or campaign experience.  As a Sr. Program Manager, you are responsible&amp;#8230;",
        "html_description": "<p>The Global Marketing Program Senior Manager is responsible for the orchestration and operations that support the design, execution, and performance of ServiceNow’s global integrated marketing programs tailored to our most critical persona groups.</p>\n<p>This role requires strong project management expertise and end-to-end marketing program and/or campaign experience.  As a Sr. Program Manager, you are responsible for holding teams accountable to realize the end-to-end plan, as well as managing the overarching project plan, agencies, internal processes, internal communications, and budget.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<p>With a keen eye for detail and project management prowess, this role works across marketing teams to facilitate the execution of global integrated marketing program plans that support brand awareness, demand generation and pipeline acceleration, and adoption and renewals goals.</p>\n<h2>Operations responsibilities include</h2>\n<ul>\n<li>Facilitates and leads cross-functional working sessions, including managing the agenda, working files, action items, and plan components</li>\n<li>Designs and manages the comprehensive project plan including the campaign roadmap and deliverables timelines</li>\n<li>Manages the overall program budget details, including working with agencies and our internal resource management and finance teams to complete SOWs, POs, and invoices</li>\n<li>Ensures marketing plan is being socialized and measured as part of the organization’s overall rhythm of the business and QBRs.</li>\n<li>Ensures program plan and its components are accurately captured and tracked in appropriate tools and reporting.</li>\n<li>Designs and drives internal communications to ensure visibility of the plan to the appropriate audiences, including providing regular updates to Marketing leadership on plan and risks</li>\n<li>Holds cross-functional team accountable to the execution and performance of the aligned plan</li>\n</ul>\n<h2><strong>Cross-Functional Stakeholder Management</strong></h2>\n<p>This role requires a strong ability to lead by influence across various teams and levels. Cross-functional teams include members from:</p>\n<ul>\n<li>Brand, Creative &amp; Thought Leadership</li>\n<li>Digital &amp; Social</li>\n<li>Product &amp; Solution Marketing</li>\n<li>Field &amp; Demand Marketing</li>\n<li>Partner Marketing</li>\n<li>Events</li>\n<li>Analytics &amp; Insights</li>\n</ul>\n<p>This role would also collaborate within a team of Marketing Program Managers to share best practices, drive standards for excellence, and connect dots across global programs and campaign plans.</p>\n<h2>Qualifications</h2>\n<p><strong>Skill &amp; Experience Requirements </strong></p>\n<ul>\n<li>Experience in leveraging or critically thinking about how to integrate AI into work processes, decision-making, or problem-solving. This may include using AI-powered tools, automating workflows, analyzing AI-driven insights, or exploring AI’s potential impact on the function or industry.</li>\n<li><strong>Curiosity for AI &amp; Innovation</strong>: We’re looking for candidates who are excited about AI and love experimenting with new ideas and tools. A passion for learning and innovation is a must!</li>\n<li>Proven marketing program management experience, including excellent project plan skills</li>\n<li>Experience driving, designing or executing integrated marketing programs and/or campaigns</li>\n<li>Understanding of marketing campaign performance and ability to translate it into business impact</li>\n<li>Strong stakeholder management skills with ability to lead by influence to successfully drive cross-functional collaboration</li>\n<li>Strong written and verbal communication skills</li>\n<li>Marketing campaign and program management within the enterprise software industry is preferred</li>\n<li>Domain knowledge in brand and creative, field marketing, digital marketing, and product and solution messaging to successfully facilitate collaboration and alignment is also ideal</li>\n<li>Bachelor’s degree with 12+ years of marketing experience</li>\n</ul>\n<p><em>Not sure if you meet every qualification? We still encourage you to apply! We value inclusivity, welcoming candidates from diverse backgrounds, including non-traditional paths. Unique experiences enrich our team, and the willingness to dream big makes you an exceptional candidate!</em></p>\n<h2>Additional Information</h2>\n<p><strong>Work Personas</strong></p>\n<p>We approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work.</p>\n<p><strong>Equal Opportunity Employer</strong></p>\n<p>ServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements.</p>",
        "url": "https://jobicy.com/jobs/115012-global-partner-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:32:56",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/3f9f6951a15d7f9fff1e42f86a01430e.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Sr. Data Analyst",
        "company": "Tremendous",
        "location": "USA",
        "description": "We are hiring an experienced data analyst to partner with our internal stakeholders and own internal data-modeling. Tremendous values data as a first-class citizen and believes insights unlock significant growth. You will collaborate closely with the data team and company-wide stakeholders. In this role, you’ll get to: Apply various analytics methods to gain critical business&amp;#8230;",
        "html_description": "<p>We are hiring an experienced data analyst to partner with our internal stakeholders and own internal data-modeling. Tremendous values data as a first-class citizen and believes insights unlock significant growth. You will collaborate closely with the data team and company-wide stakeholders.</p>\n<h2><strong>In this role, you’ll get to:</strong></h2>\n<ul>\n<li>Apply various analytics methods to gain critical business insights</li>\n<li>Consolidate diverse facts and findings into compelling narratives that can be applied across Tremendous.</li>\n<li>Drive growth by collaborating with cross-functional teams</li>\n<li>Advocate for data-informed decisions by partnering with key stakeholders and senior leaders.</li>\n<li>Identify and implement improvements within the Data team by standardizing processes, developing innovative practices, providing mentorship, and fostering new expertise.</li>\n<li>Join a growing team of analysts and actively contribute to team collaboration and culture.</li>\n</ul>\n<h2><strong>More about you:</strong></h2>\n<ul>\n<li>You write sophisticated SQL with a preference for well-architected data models, optimized query performance, and documented code.</li>\n<li>You are proficient with at least one visualization &amp; business intelligence platform (e.g., Tableau, Looker, Mode).</li>\n<li>Strong verbal and communication skills. You can articulate why something should be built a certain way and how it will impact the business.</li>\n<li>You expedite projects forward, favoring rapid and incremental development in parallel with problem-solving short-term obstacles.</li>\n<li>You employ a structured approach to handle ambiguous exploratory analysis, balancing thoroughness with the MVP mindset.</li>\n<li>You use data to drive customer and product teams to achieve ambitious goals and influence company-level outcomes. Experience as a technical lead or manager is a plus.</li>\n<li>You use excellent judgment and sharp business and product instincts that allow you to prioritize.</li>\n</ul>\n<h2><strong>Bonus:</strong></h2>\n<ul>\n<li>Experience with operational tools and systems like Amplitude, Zendesk, or Segment.</li>\n<li>Experience with dbt.</li>\n<li>Experience in Python or R.</li>\n<li>Experience with customer or product analytics working with a B2B software product.</li>\n<li>Experience with designing multivariate tests, synthesizing results, and frameworks for data-informed decisions to launch.</li>\n</ul>\n<h2><strong>What&#8217;s cool about the role:</strong></h2>\n<ul>\n<li>You&#8217;ll work at a company growing quickly yet sustainably. We’re profitable with plenty more opportunity ahead. That’s good news for your career growth.</li>\n<li>Competitive pay, equity and benefits. The base salary for this role is $160,000 &#8211; $210,000.</li>\n<li>We&#8217;re a remote company. Work from wherever you want in the Americas — we have collaboration hours from around 12-3 PM Eastern time.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115020-senior-data-analyst-4",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:31:27",
        "salary": "USD 160,000 - 210,000",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/01/c2bd8be5-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Enterprise Account Executive",
        "company": "Tremendous",
        "location": "Europe",
        "description": "Tremendous is the fast, free, flexible way to send bulk payouts to people in over 200 countries. 10,000+ companies ranging from mom-and-pops to Google, MIT, and United Way have sent over $1 billion, saving 15 hours a month on average. In both our product and our workplace, we’re intentional about making work more efficient, flexible,&amp;#8230;",
        "html_description": "<p>Tremendous is the fast, free, flexible way to send bulk payouts to people in over 200 countries. 10,000+ companies ranging from mom-and-pops to Google, MIT, and United Way have sent over $1 billion, saving 15 hours a month on average.</p>\n<p>In both our product and our workplace, we’re intentional about making work more efficient, flexible, and fulfilling. Tremendous is a fully remote, high-documentation, low-meeting culture, which means more time for what matters in both your professional and personal life.</p>\n<p>Our customers, who include marketers, researchers, HR teams, and nonprofits, rave about how quick and easy it is to use Tremendous — <strong>check the ratings on G2</strong>. Yet there’s a lot of complexity under the hood, including over 2,000 redemption options and plenty of banking infrastructure. This duality makes working here a fun challenge.</p>\n<p>Tremendous is profitable and growing without outside investors. Join us before our next international offsite.</p>\n<h2><strong>What you’ll do</strong></h2>\n<p>We’re looking for an Enterprise Account Executive to drive our expansion into Europe. As the first international sales hire, you’ll be responsible for identifying, prospecting, and securing new business across Western Europe. You&#8217;ll also partner with sales, marketing, and product teams to align our product with the unique demands of new markets. As part of the founding team, you’ll have a unique opportunity to shape the direction of our international sales strategy from the ground up.</p>\n<h2><strong>About you</strong></h2>\n<ul>\n<li>5+ years of experience in software sales, with a focus on Western European markets. Experience expanding into new geographies strongly preferred.</li>\n<li>Fluency in English is required and workplace proficiency in French, German, or Spanish.</li>\n<li>Based in a Western Europe time zone (WET or CET).</li>\n<li>Ability to travel domestically and internationally.</li>\n<li>Strong written communication skills. We’re a documentation-first culture.</li>\n<li>Desire and ability to work autonomously and drive your work. Tremendous is not a great fit for people who default to waiting for instructions.</li>\n<li>High empathy. You care about your teammates and our users. You can put yourself in their shoes.</li>\n</ul>\n<h2><strong>What’s cool about the role</strong></h2>\n<ul>\n<li>Be a key player in our global expansion efforts with the chance to shape the future of the company.</li>\n<li>We’re profitable with plenty more opportunity ahead, which is good news for your career growth.</li>\n<li>We offer competitive pay, equity and benefits. The OTE for this role is £180,000 &#8211; £220,000.</li>\n<li>We&#8217;re a fully remote company.</li>\n<li>We’ve got smart people and a great culture.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115702-enterprise-account-executive-6",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:31:19",
        "salary": "GBP 180,000 - 220,000",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/01/c2bd8be5-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Fintech Account Executive",
        "company": "WorkWave",
        "location": "USA",
        "description": "WorkWave is seeking a results-driven Enterprise Fintech Account Executive with exceptional technical knowledge and presentation skills. At WorkWave, we empower industries such as Field Service, Pest Control, Lawn and Landscape, and Logistics to achieve their full potential through our cutting-edge SaaS solutions. Our fintech team works to help our customers grow their businesses and save&amp;#8230;",
        "html_description": "<p>WorkWave is seeking a results-driven Enterprise Fintech Account Executive with exceptional technical knowledge and presentation skills. At WorkWave, we empower industries such as Field Service, Pest Control, Lawn and Landscape, and Logistics to achieve their full potential through our cutting-edge SaaS solutions. Our fintech team works to help our customers grow their businesses and save time and money through WorkWave’s suite of financial products. As part of our new and fast-growing fintech team, you’ll contribute to WorkWave’s initiative to help our largest customers to find the right fintech solution for their business.</p>\n<h2>WHAT YOU&#8217;LL DO:</h2>\n<ul>\n<li>Partner with our sales and account management teams to pitch WorkWave’s fintech offerings to our existing and net-new customers within the framework of our broader sales processes</li>\n<li>Consult with purpose: conduct discovery calls to deeply understand prospects’ fintech needs and challenges, positioning WorkWave as their trusted partner</li>\n<li>Deliver impactful presentations: prepare and lead engaging product demonstrations and solution recommendations that showcases WorkWave’s growing portfolio of fintech solutions</li>\n<li>Work with existing fintech users to ensure continued usage and success</li>\n<li>Own your results: consistently meet and exceed quarterly goals, both in terms of new signups and product usage</li>\n<li>Collaborate with teams across the organization, including but not limited to: sales, product, operations, and finance, as well as with our partners</li>\n<li>Leverage technology to drive success: Build and manage a robust sales pipeline within Salesforce CRM, ensuring accurate tracking of opportunities, forecasts, and closed deals.</li>\n</ul>\n<h2>WHAT YOU&#8217;LL BRING:</h2>\n<ul>\n<li>Proven Industry Expertise: 5+ years of success in a SaaS or fintech revenue role, with a demonstrated history of exceeding goals. Bonus points for home services experience.</li>\n<li>Deep understanding of the payments and/or lending spaces.</li>\n<li>Exceptional Communication Skills: Outstanding verbal and written communication, negotiation, and interpersonal skills that foster trust and drive results.</li>\n<li>Strong Business Acumen: Ability to independently strategize, multi-task, and manage multiple prospective clients simultaneously.</li>\n<li>Pipeline Mastery: Experience managing and driving a sales pipeline with consistent execution.</li>\n<li>Education: Bachelor’s degree or equivalent experience.</li>\n</ul>\n<p>$65,000 &#8211; $92,500 a year</p>\n<p>In our dedication to salary transparency, we provide a compensation range for sales roles, which is a base salary in addition to commission. The final offer will be dependent on various factors, including the candidate&#8217;s qualifications, relevant experience, and the organization&#8217;s budget. Our Talent Acquisition team will provide more information about the compensation package for this position during the interview process.</p>\n<h2><b>WHAT YOU SHOULD KNOW ABOUT US:</b></h2>\n<ul>\n<li>• We are laid back but buttoned up. We offer a casual work environment and remote work flexibility and have a passion for developing creative, innovative best in class solutions that directly contribute to the success of our customers</li>\n<li>• We care deeply and deliver service and solutions that make a real difference in the lives of our clients and their businesses</li>\n<li>• We openly accept others as they are and build strong partnerships based on trust</li>\n<li>• Teamwork and collaboration is key to help our colleagues and customers solve their challenges</li>\n<li>• Our team is energetic, fun, naturally inquisitive and eager to make an impact, we invite you to join us!</li>\n</ul>\n<p><b><i>We’re an equal opportunity employer. All applicants will be considered for employment without attention to race, color, age, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status:</i></b><i> </i>Don&#8217;t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At WorkWave, we are dedicated to building a diverse, inclusive and authentic workplace, so if you feel like you could make a great impact in this role but your past experience doesn&#8217;t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may just be the right candidate for this or other roles!</p>\n<p><i>WorkWave supports salary transparency, however please note that salary estimates provided by websites (LinkedIn, Glassdoor, etc.) and not by WorkWave may not accurately reflect the actual salary range for the position.</i></p>",
        "url": "https://jobicy.com/jobs/115700-fintech-account-executive",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:30:55",
        "salary": "USD 65,000 - 92,500",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/78458cfe50d13ec79a5afc7a7a557272.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Sr. Frontend Engineer",
        "company": "Roofr",
        "location": "Canada",
        "description": "Building a powerful user experience is what sets Roofr apart from all other roofing platforms. As an Engineer in an early-stage and high-growth company, you will have a large impact on both technical implementation and help steer our technology roadmap. What You&amp;#8217;ll Get to Do Help drive frontend architecture to the next stage of Roof’s&amp;#8230;",
        "html_description": "<p>Building a powerful user experience is what sets Roofr apart from all other roofing platforms. As an Engineer in an early-stage and high-growth company, you will have a large impact on both technical implementation and help steer our technology roadmap.</p>\n<h2><strong>What You&#8217;ll Get to Do</strong></h2>\n<ul>\n<li>Help drive frontend architecture to the next stage of Roof’s systems</li>\n<li>Work in a fast-paced cross-functional team that values doing things ‘the right way’</li>\n<li>Contribute to an early-stage company with engineering first culture</li>\n<li>Contributing to all aspects of the Software Development Lifecycle, from planning to delivery</li>\n<li>Collaborating with cross-functional team members to develop technical requirements</li>\n<li>Writing clean code to develop functional web applications and reusable libraries</li>\n<li>Writing unit, functional, and acceptance tests</li>\n<li>Troubleshooting and supporting production applications</li>\n</ul>\n<h2><strong>What You&#8217;ll Bring to the Role</strong></h2>\n<ul>\n<li>3+ years of experience holding a <strong>Senior</strong> Engineering title</li>\n<li>Has 5+ years of software development experience</li>\n<li>Is a champion of agile methodologies, and enjoys shipping code often and confidently</li>\n<li>Has a track record of breaking down complex problems as incremental solutions</li>\n<li>Proactively recommends initiatives to improve our engineering technologies and culture</li>\n<li>Enjoys working in a collaborative environment where everyone helps each other grow</li>\n<li>Takes ownership of the product and is proud of the quality of their work</li>\n<li>Has excellent communication skills, and appreciates the value of good documentation</li>\n<li>Understands the challenges of early-stage company priorities</li>\n<li><strong>Strong</strong> experience with Javascript language &amp; <strong>React + Redux</strong> framework</li>\n<li>Experience with SCSS</li>\n<li>Experience with interacting with RESTful APIs</li>\n<li>Experience building frontend testing and automation systems for unit tests, integration tests, regression tests, and user acceptance tests</li>\n</ul>\n<h2><strong> What we offer</strong></h2>\n<p>When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career:</p>\n<h2><strong>️ Vacation/Paid Time Off</strong></h2>\n<ul>\n<li>1st week of employment is mandatory PTO! Start your journey with Roofr by decompressing and recharging &#8211; we will see you in week 2!</li>\n<li>1 Friday off per month (we call those our laundry days!)</li>\n<li>Company wide paid shutdown for the week between Christmas and New Years</li>\n<li>Flexible time off</li>\n<li>80% employer paid benefits</li>\n<li>RRSP/401k match</li>\n<li>Generous Parental Leave policy</li>\n</ul>\n<h2><strong> Perks</strong></h2>\n<ul>\n<li>We host 2 retreats per year and great team building activities</li>\n<li>Ample learning and development opportunities to continue growing your career</li>\n<li>Home office setup stipend</li>\n<li>Internet and phone allowance</li>\n<li>Remote first culture</li>\n<li>Weekly Friday paydays!</li>\n</ul>\n<p><em>At Roofr, we celebrate individuality and uniqueness. Roofr is proud to be an equal opportunity employer. We are committed to building an organization that empowers inclusion and diversity. We encourage candidates and employees to be true to themselves and express all aspects of their identities. We believe that the convergence of fresh perspectives and experiences from all walks of life is what makes our product and culture so great. We do not discriminate against employees based on race, color, religion, sex, national origin, gender identity or expression, age, disability, pregnancy (including childbirth, breastfeeding, or related medical condition), genetic information, protected military or veteran status, sexual orientation, or any other characteristic protected by applicable federal, state or local laws.</em></p>",
        "url": "https://jobicy.com/jobs/116457-senior-frontend-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:29:22",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2025/03/1a4a90db-221.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Paid Search Manager",
        "company": "Wpromote",
        "location": "USA",
        "description": "We’re looking for a Paid Search Manager to join the rapidly expanding team that is the backbone of our company. You’ll directly manage search engine marketing (SEM) campaigns across both Google Ads and Microsoft Ads, making optimizations and updates daily. Your client will be in the fin tech space that constantly challenges you, and with extensive&amp;#8230;",
        "html_description": "<p>We’re looking for a Paid Search Manager to join the rapidly expanding team that is the backbone of our company. You’ll directly manage search engine marketing (SEM) campaigns across both Google Ads and Microsoft Ads, making optimizations and updates daily. Your client will be in the fin tech space that constantly challenges you, and with extensive experience and/or a proven track record, you could be working with some of our biggest brands. You’ll be trusted to oversee all account activity, collaborate with managers from other channels, and come up with campaign strategies for this client.</p>\n<p>At Wpromote, we believe that great work is only possible with great people. Our goal is to build a better, more inclusive work environment and support our people at every stage of their careers by prioritizing a strong work-life balance through our policies and benefits listed below. As a Best Place to Work according to both Ad Age and Glassdoor and Adweek’s Fastest Growing Digital Agency, we are moving fast to expand our teams and bring new experts into the fold to keep pushing the boundaries of what’s possible in marketing.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>Remote-first culture</li>\n<li>Unlimited PTO</li>\n<li>Extended Holiday break (Winter)</li>\n<li>Flexible schedules</li>\n<li>Work from anywhere options*</li>\n<li>100% paid parental leave</li>\n<li>401(k) matching</li>\n<li>Medical, Dental, Vision, Life, Pet Insurance</li>\n<li>Sponsored life insurance</li>\n<li>Short Term Disability insurance and additional voluntary insurance</li>\n<li>Annual Class Pass credits and more!</li>\n</ul>\n<p>The anticipated annual salary for this role will range from $72,500 &#8211; $85,000, based on a variety of factors unique to each candidate, including skill set, years and depth of experience, education and certifications, competitive benchmarks, scope of responsibility, market dynamics, geographic location, and the respective state’s salary threshold for exempt employees. At Wpromote, pay ranges are subject to change and are based on specific market medians for similar jobs according to third-party salary benchmark surveys. Individual pay within that range can vary due to skills, experience, and available budget.  The total compensation package for this role will include benefits (listed above).</p>\n<p>*This position may be performed remotely in most states within the US, with some exclusions</p>\n<p>**While this role offers the flexibility to work remotely, we have office hubs in Los Angeles, Chicago, and New York, where you can join in on learning and development opportunities, fun events, take advantage of a space to work, and collaborate in person!</p>\n<p>***This position is not eligible for immigration sponsorship</p>\n<h2>You Will Be</h2>\n<ul>\n<li>Planning, developing, and implementing comprehensive paid search strategies to drive direct response and new user acquisition for your client.</li>\n<li>Utilizing business acumen to work closely with client teams to identify and fully understand business needs, campaign performance objectives, and opportunities to grow the relationship and client investments.</li>\n<li>Creating and managing paid search accounts/campaigns via various paid search marketing platforms including but not limited to: Google Ads®, Microsoft Ads®, Criteo®, etc.</li>\n<li>Managing Search, Shopping, Display, Remarketing, App Install and Video advertising campaigns.</li>\n<li>Working with direct response advertising strategies to drive sales revenue and/or qualified leads.</li>\n<li>Conducting keyword research, writing ad copy, and establishing bidding strategies to meet and exceed client KPIs.</li>\n<li>Creating and implementing campaign A/B test experiments to identify optimal campaign settings</li>\n<li>Using Google Analytics to develop insights and action items intended to improve paid search performance and meet client goals.</li>\n<li>Analyzing paid search campaign results and adjust strategy and budgets accordingly.</li>\n<li>Communicating with clients regularly to discuss goals and deliver results.</li>\n<li>Developing strategies across all marketing channels to improve client goals (eg. CPA, ROAS) and achieve maximum efficiency.</li>\n</ul>\n<h2>You Must Have</h2>\n<ul>\n<li>1.5-3 years of experience managing multiple client portfolios in paid search industry</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Excellent analytical skills</li>\n<li>Deep knowledge of the SEM industry and the paid search advertising model</li>\n<li>Experience with keyword research tools and web analytics tools (Google Analytics), as well as how to use these tools in paid search campaigns</li>\n<li>General knowledge of search engine optimization (SEO), social advertising, and web usability</li>\n<li>Strong Microsoft Excel skills: pivot tables, VLOOKUPS and chart building</li>\n<li>Extremely well organized, able to balance client timelines and business needs, possibly across multiple clients</li>\n<li>Work comfortably in dynamic, time-intensive environments where consistent fire drills and competing priorities are commonplace</li>\n<li>An understanding of customer lifetime value and optimizing towards profits based on client margins</li>\n<li>Ability to manage expectations and priorities</li>\n<li>Experience presenting to senior-level client contacts</li>\n<li>Agency experience preferred with managing multiple clients with monthly budgets ranging between $50,000-$500,000 per client</li>\n<li>Experience with Google Suite</li>\n</ul>\n<p>Wpromote is committed to bringing together individuals from different backgrounds and perspectives, providing employees with a safe and welcoming environment free of discrimination and harassment. We strive to create a diverse &amp; inclusive environment where everyone can thrive, feel a sense of belonging, and do impactful work together. As an equal opportunity employer, we prohibit any unlawful discrimination against a job applicant on the basis of their race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, family or parental status, disability*, age, veteran status, or any other status protected by the laws or regulations in the locations where we operate. We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our workplace.</p>\n<p>Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. A reasonable accommodation is a change in the way things are normally done which will ensure an equal employment opportunity without imposing undue hardship on Wpromote.</p>\n<p>This employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. If E-Verify cannot confirm that you are authorized to work, this employer is required to give you written instructions and an opportunity to contact Department of Homeland Security (DHS) or Social Security Administration (SSA) so you can begin to resolve the issue before the employer can take any action against you, including terminating your employment. Employers can only use E-Verify once you have accepted a job offer and completed the Form I-9. For more information on E Verify, or if you believe that your employer has violated its E-Verify responsibilities, please contact DHS.</p>",
        "url": "https://jobicy.com/jobs/117019-paid-social-senior-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-21 04:27:47",
        "salary": "USD 72,500 - 85,000",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/e1003ec6a2d34525775d0bc7912ced79.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Sr. Data Engineer",
        "company": "Fleetio",
        "location": "Canada,  Mexico,  USA",
        "description": "We are looking for a senior data engineer to join our data and analytics team to help us build the next generation of our data platform and product. Together with the rest of the team, you will be responsible for the design and implementation of our data platform while also building data products for marketplaces,&amp;#8230;",
        "html_description": "<p>We are looking for a senior data engineer to join our data and analytics team to help us build the next generation of our data platform and product. Together with the rest of the team, you will be responsible for the design and implementation of our data platform while also building data products for marketplaces, integrations and analytics. Your work will encompass the full spectrum of data engineering while also crossing over into areas of software and analytical engineering.</p>\n<p>You will report to Fleetio’s Manager, Data Engineering and partner closely with our product and engineering teams as well as other internal stakeholders. This is an exciting opportunity to join a growing data-first company and push the boundaries of the modern data stack and deliver data products to our customers in new and exciting ways.</p>\n<h2>Who you are:</h2>\n<p>The ideal candidate for this role is business savvy, senior-level data engineer with experience owning and building complex data platforms and pipelines. You have a deep understanding of the data modeling, data warehousing and modern data platforms. You have experience with not just data, but back-end or full-stack development and have worked on true customer-facing products. You possess strong, but loosely held opinions about design patterns, architecture and modeling. You are passionate about solving business challenges with data and take pride in implementing scalable solutions. You have the skills to translate ambiguous and non-technical asks to specific technical tasks and deliver it incrementally . You are product-minded and team-oriented, willing to hear others&#8217; opinions and educate on best practices. You have excellent communication skills (particularly written).</p>\n<h2>Your impact:</h2>\n<ul>\n<li>Enable and scale self-serve analytics for all Fleetio team members. You&#8217;ll architect clean data sets by modeling data and metrics via tools like dbt to empower employees to make data-driven decisions with accurate information.</li>\n<li>Develop data destinations, custom integrations and maintain open source packages that allow our customers to easily integrate Fleetio data with the modern data stack.</li>\n<li>Maintain and develop custom data pipelines from operational source systems to our data platform for both streaming and batch sources.</li>\n<li>Work on development of our internal data infrastructure stack. Improve the hygiene and integrity of our data platform and ancillary tools by maintaining and monitoring the ELT pipeline.</li>\n<li>Architect, design and implement core components of our data platform beyond the traditional warehouse to include data observability, experimentation, data science and other data products.</li>\n<li>Develop and maintain streaming data pipelines from a variety of databases and data sources</li>\n<li>Collaborate with other Fleetians around the company to understand data needs and ensure required data is collected, modeled, and available to team members.</li>\n<li>Document best practices and coach/advise other data analysts, product managers, engineers, etc. on data modeling, SQL query optimization &amp; reusability, etc. Keep our data platform tidy by managing roles and permissions and deprecating old projects.</li>\n</ul>\n<h2>Your experience:</h2>\n<ul>\n<li>5+ years experience working in a data engineering or data-focused software engineering role.</li>\n<li>Experience transforming raw data into clean models using standard tools of the modern data stack and deep understanding of ELT and data modeling concepts.</li>\n<li>Experience with streaming data and pipelines such as kafka or kinesis.</li>\n<li>Proficiency in python and proven track record of delivering production-ready python applications.</li>\n<li>Experience in designing, building, and administering modern data pipelines and data warehouses</li>\n<li>Experience with dbt.</li>\n<li>Experience with semantic layers like cube or metricflow.</li>\n<li>Experience with Snowflake, BigQuery, or Redshift.</li>\n<li>Experience with version control tools such as Github or Gitlab.</li>\n<li>Experience with ELT tools such as Stitch or Fivetran.</li>\n<li>Experience with orchestration tools such as Prefect or Dagster.</li>\n<li>Experience with CI/CD and IaaC tooling such as github Actions and Terraform.</li>\n<li>Experience with business intelligence solutions (Metabase, Looker, Tableau, Periscope, Mode)</li>\n<li>Experience with serverless cloud functions (AWS Lambda, Google Cloud Functions, etc.)</li>\n<li>Excellent communication and project management skills with a customer service focused mindset.</li>\n<li>Be sure to mention &#8220;coffee&#8221; in your application so we know you read this</li>\n</ul>\n<h2>Considered a plus:</h2>\n<ul>\n<li>Experience with data marketplaces/private sharing technologies such as snowflake marketplace or AWS data exchange.</li>\n<li>Experience contributing to open-source projects.</li>\n<li>Experience with full-stack engineering.</li>\n<li>Experience with technical blogging and/or presenting at conferences.</li>\n</ul>\n<h2>Benefits:</h2>\n<ul>\n<li>Multiple health/dental coverage options</li>\n<li>Vision insurance</li>\n<li>Incentive stock options</li>\n<li>401(k) match of 4%</li>\n<li>PTO &#8211; 4 weeks</li>\n<li>12 company holidays + 2 floating holidays</li>\n<li>Parental leave- birthing parent (16 weeks paid) non-birthing (4 weeks)</li>\n<li>FSA &amp; HSA options</li>\n<li>Short and long term disability (short term 100% paid)</li>\n<li>Community service funds</li>\n<li>Professional development funds</li>\n<li>Wellbeing fund &#8211; $150 quarterly</li>\n<li>Business expense stipend- $125 quarterly</li>\n<li>Mac laptop + new hire equipment stipend</li>\n<li>Monthly catered lunches</li>\n<li>Fully stocked kitchen with tons of drinks &amp; snacks</li>\n<li>Remote working friendly since 2012 #LI-REMOTE</li>\n</ul>\n<p><em>Fleetio provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment. We celebrate diversity and are committed to creating an inclusive environment for all. All employment is decided on the basis of qualifications, merit and business need.</em></p>\n<p><em>This application is not intended to and does not create a contract or offer of employment. Employment with Fleetio is at will.</em></p>",
        "url": "https://jobicy.com/jobs/116421-senior-data-engineer-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:56:01",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/e571b83c37e0ed5371754d319be16e76.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Data Engineer",
        "company": "Branch",
        "location": "USA",
        "description": "Branch is on a mission to empower workers with financial freedom. We do this by helping companies accelerate payments and providing working Americans with accessible, free financial services. We’re committed to building and delivering more inclusive, transparent, and frictionless financial products. Our goal of empowerment extends to our own employees, too. Have a great idea?&amp;#8230;",
        "html_description": "<p>Branch is on a mission to empower workers with financial freedom. We do this by helping companies accelerate payments and providing working Americans with accessible, free financial services. We’re committed to building and delivering more inclusive, transparent, and frictionless financial products.</p>\n<p>Our goal of empowerment extends to our own employees, too. Have a great idea? Share it today and it might just get implemented tomorrow. As a member of our team, your voice and creativity matter—and they can directly impact our products, company, and culture.</p>\n<p>We not only focus on attracting great talent from across the country, but also on building teams that help that talent thrive. That means valuing a diversity of opinions and working styles, while creating a shared belief in innovation, initiative, and winning together.</p>\n<p>Come join our team as we develop new ways to improve the lives of working Americans.</p>\n<h2><strong>Responsibilities include, but are not limited to</strong></h2>\n<ul>\n<li>Develop, maintain, and optimize data pipelines to support analytics, reporting, and business intelligence needs.</li>\n<li>Design and implement data integrations across multiple backend business systems, ensuring efficient and reliable data flows.</li>\n<li>Work on streaming data processing using frameworks like Apache Beam to handle real-time data ingestion and transformation.</li>\n<li>Build and maintain APIs to enable seamless data access and sharing across internal teams and platforms.</li>\n<li>Manage orchestration and automation of workflows using Airflow on Kubernetes.</li>\n<li>Ensure data quality, security, and compliance by implementing best practices for monitoring, testing, and governance.</li>\n<li>Collaborate with analytics and engineering teams to optimize data models and improve system performance.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>3+ years of experience as a Data Engineer</li>\n<li>3+ years of using Apache Airflow in a production setting.</li>\n<li>Expert in Python and SQL</li>\n<li>Hands-on experience with cloud platforms such as Google Cloud (GCP) or AWS.</li>\n<li>Familiarity with our modern data stack:\n<ul>\n<li>Snowflake, Airflow, Apache Beam, DBT, Looker, Secoda, Fivetran, hightouch</li>\n</ul>\n</li>\n<li>BS in Computer Science or equivalent program</li>\n<li>Bonus points for:\n<ul>\n<li>Payments experience (or related industry)</li>\n<li>Experience with streaming data architectures</li>\n</ul>\n</li>\n</ul>\n<p>Ideal candidates will bring a blend of technical expertise, industry knowledge, and a deep understanding of analytics engineering best practices. Familiarity with leading-edge tools and technologies in the data landscape is essential for driving insights and innovations within our team.</p>\n<h2><strong>Compensation</strong></h2>\n<p>The base compensation range for this role is 135-150k.  The salary range displayed reflects an average base salary range for the position across all the US. The base salary offered to an applicant could be higher or lower based on each applicants’ specific skill set, depth of experience, relevant education or training, etc. The base salary range listed excludes commission/ bonus/ equity or benefits.</p>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Branch-paid medical, dental, and vision insurance</li>\n<li>Remote-first (domestic USA)</li>\n<li>Equity</li>\n<li>401k</li>\n<li>Flexible time off</li>\n<li>Paid company holidays</li>\n<li>Paid parental leave (eligible after 6 months of employment)</li>\n</ul>\n<h2><strong>Working at Branch</strong></h2>\n<p>A remote-first company with employees located throughout the U.S., Branch emphasizes transparency, accountability, and trust to create a collaborative environment where our product, engineering, marketing, customer support, customer success, and sales teams can all thrive together.  Learn more about what we do in this <a href=\"https://cdn.bfldr.com/CUTY2K5N/as/jrr3hk6csnwjhrx8phg6ppnj/The_Branch_Manifesto\">video</a>!</p>\n<p>Our collaborative spirit has helped us become an award-winning fintech company, with Branch’s innovation and workplace recognized across industries. Branch has been honored by Inc., the Webby Awards, Benzinga Fintech Awards, Fintech Breakthrough Awards, Top Workplaces USA, Great Places to Work, and EY Entrepreneur of the Year, Heartland, among others.</p>\n<p>Branch is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/115696-analytics-engineer-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:55:51",
        "salary": "USD 135,000 - 150,000",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/3b9dc47a09a30846e3c1355b50098b18.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Front End Engineer",
        "company": "Files.com",
        "location": "USA",
        "description": "We are a SaaS, Cloud-Based Managed File Transfer platform that enables organizations to securely transfer, share, and store files between users, teams, and organizations. We are looking for seasoned Front End Engineers to join our team and help us build features into our already great app. You will be working on the Files.com platform, including&amp;#8230;",
        "html_description": "<p>We are a SaaS, Cloud-Based Managed File Transfer platform that enables organizations to securely transfer, share, and store files between users, teams, and organizations. We are looking for seasoned Front End Engineers to join our team and help us build features into our already great app. You will be working on the Files.com platform, including all our client-facing web browser applications written primarily in JavaScript using React.</p>\n<h2><strong>World Class Pay and Benefits</strong></h2>\n<p>Earn a &#8220;Bay Area&#8221; Salary from Anywhere. Our pay is competitive with the top software companies in the world, with generous base salary plus equity compensation.</p>\n<p><strong>Big Company Benefits:</strong> You&#8217;ll get full  Health/Dental/Vision Insurance coverage (plus 75% of Spouse/Family coverage too),  401(k) with generous matching, 11 Company Holidays per year, and  20 PTO/Vacation days, plus we give employees off for Winter Break at the end of the year!</p>\n<p><strong>Company Macbook Pro and $1,000:</strong> We&#8217;ll send you a company issued contemporary Macbook Pro as well as $1,000 sign-on bonus as a welcome to Files.com.</p>\n<p><strong>Tight-Knit Fun-Loving Team:</strong> You will be joining a fun-loving team that works together very closely, despite the remote work environment.</p>\n<h2><strong>100% Remote Opportunity</strong></h2>\n<p>The Files.com Engineering team is 100% remote. However, we travel for regular in-person meetings with the team and the entire company to meet and work together face to face. These meetings are in cities around the US, including Scottsdale, Austin, Orlando, New Orleans, San Diego, Las Vegas, and New York City.</p>\n<p>In-person events combine work and fun and are designed to make up for the in-person interaction that occurs in an office job.</p>\n<h2><strong>About the Role</strong></h2>\n<p>As a Front End Engineer at Files.com, you will take the lead on helping build cutting edge features into the Files.com product that drive value for the 4,000 businesses that use our platform.</p>\n<p>Our API receives hundreds of requests per second and is used by both internal and external developers.</p>\n<p>Professional experience with React is a requirement for this position.</p>\n<p>Here are some examples of projects that our Developers have recently completed:</p>\n<ul>\n<li>Implementing Single-Sign-On via OAuth, SAML, and SCIM.</li>\n<li>Building a scalable engine that can convert nearly any type of files to PDF for in-browser previews (like the former Crocodoc service).</li>\n<li>Upgrading our API documentation to be automatically generated using the OpenAPI standard, and the creation of automatically-generated SDKs.</li>\n<li>Building our Universal Sync engine, which is a tool that allows Files.com users to synchronize their files to other cloud services such as S3, Azure, and Rackspace.</li>\n<li>And here are some examples of projects that our Developers will be tackling in the next 6-12 months:</li>\n<li>Implementing in-file search using Elasticsearch with custom input filters to index a plethora of document types.</li>\n<li>Building a file versioning tool that uses Git behind the scenes to give customers easy tracking of file versions.</li>\n<li>Additionally, you&#8217;ll contribute to our ongoing projects for improving security, monitoring, and performance.</li>\n</ul>\n<p>We are seeing an increase in fraudulent applications. Please note that we take preventive measures in our hiring process to authenticate a person&#8217;s identity before we hire.</p>",
        "url": "https://jobicy.com/jobs/115677-front-end-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:55:14",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/06/918df61d22e8170f1166fb6e010aaa9a.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Software Architect",
        "company": "Pearson",
        "location": "USA",
        "description": "As a Software Architect for the ExamDeveloper product, you will own the overall system design and architecture for Pearson VUE’s SaaS tool for creating exams.  In this individual contributor role you’ll be the visionary for future architecture state of ExamDeveloper and ensure that current work of the teams is aligned your architecture direction.  You’ll spend&amp;#8230;",
        "html_description": "<p>As a Software Architect for the ExamDeveloper product, you will own the overall system design and architecture for Pearson VUE’s SaaS tool for creating exams.  In this individual contributor role you’ll be the visionary for future architecture state of ExamDeveloper and ensure that current work of the teams is aligned your architecture direction.  You’ll spend most of your time on planning and design activities in close collaboration with other technical and non-technical people.</p>\n<h2><strong>The Product</strong></h2>\n<p>ExamDeveloper is a web-based exam development platform that allows our customers to write, review and manage questions on their exams.  ExamDeveloper is the leading web-based tool for creating tests to certify test-takers in the professional skills they require.   Customers rely on ExamDeveloper to support their entire workflow around question writing, collaborative review, scoring, and test management.  It is currently undergoing a significant modernization effort and there are constant opportunities to add value to this core Pearson VUE product.</p>\n<p>ExamDeveloper’s primary tech stack is .NET and C# on the backend and Angular on the frontend hosted in Microsoft Azure.  You’ll work with containerized services and Microsoft SQL Server.  Some of the work will involve .NET Framework 4.x and ASP.NET Web Forms as we are in progress with modernization.</p>\n<h2><strong>Teams</strong></h2>\n<p>The majority of the development and QA engineers are consultants located in India.  Because of this, clear communication (especially written) is important.  There is a small team of USA-based employee developers.  Support and leadership roles like Project Managers and Business Analysts are employees based in the USA.</p>\n<h2><strong>Work Location</strong></h2>\n<p>In this role it is possible to work remotely anywhere in the USA, but many people you’d regularly work with are based in the Central USA timezone in the Minneapolis, MN area.  It is required to work during most of Central USA’s normal business hours.</p>\n<h2><strong>Duties</strong></h2>\n<ul>\n<li>Create technical plans that provide for future development and operations of the ExamDeveloper product.  Proactively work to anticipate and prepare for upcoming needs.</li>\n<li>Lead the solutioning process to define and estimate the work required for upcoming features.  Act to advance our business objectives from ambiguous high-level goals into specific achievable plans.</li>\n<li>Review technical designs created by others for compatibility with current and future architecture direction.</li>\n<li>Partner closely with business stakeholders to understand customer needs and incorporate their vision into your technical direction.</li>\n<li>Act as a trusted driving force for achieving business goals.</li>\n<li>Oversee the operational costs of ExamDeveloper to ensure that our resource usage (ex: Azure cloud costs) are optimal.</li>\n<li>Set technical standards for the engineering teams together with the participation and engagement of senior engineers.</li>\n<li>Socialize and explain your decisions to other architects, managers, and business analysts in the VUE Technology organization and beyond.</li>\n<li>Build consensus for your technical vision, but also be open to competing points of view.  Suggest and justify alternatives.</li>\n<li>Collaborate effectively across many roles and across organizational boundaries.</li>\n<li>Respond to technical needs and concerns from the engineering team and give clear explanations where necessary.</li>\n<li>Communicate effectively at various levels of technical sophistication and understanding, from high-level explanations tailored to executives to “lines of code”-level explanations that junior developers can understand.</li>\n<li>Participate in development and QA work in a limited way to maintain a connection and a strong understanding of the teams’ processes and challenges.</li>\n<li>Coach other team members to help them grow and bring out their best work.</li>\n<li>React to urgent Production issues as part of a group of rotating on-call engineers.</li>\n</ul>\n<h2><strong>Required Education and Experience</strong></h2>\n<ul>\n<li>7+ years work experience as a software developer</li>\n<li>2+ years work experience as a software architect</li>\n<li>2+ years experience with Angular or similar front-end software frameworks (like React, Svelte, etc)</li>\n<li>2+ years experience with C# or similar back-end languages</li>\n<li>Experience supervising the work of technical staff either formally or informally</li>\n<li>Bachelor degree in Computer Science, MIS, or equivalent technology discipline</li>\n</ul>\n<h2><strong>Desired Knowledge, Skills, and Abilities</strong></h2>\n<ul>\n<li>Ability to produce technical designs and plans to meet business needs</li>\n<li>Experience and knowledge of cloud providers’ capabilities</li>\n<li>Relational databases</li>\n<li>DevOps workflows related to cloud-based development and deployment</li>\n<li>Experience in an Agile software development environment</li>\n<li>Demonstrated technical leadership</li>\n<li>Clear communication skills to various types of audiences</li>\n<li>History of continuous improvement</li>\n</ul>\n<p>Pearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All employment is decided based on qualifications, merit, and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status, or any other group protected by law.</p>\n<p>Learning is the most powerful force for change in the world. More than 20,000 Pearson employees deliver our products and services in nearly 200 countries, all working towards a common purpose – to help everyone achieve their potential through learning. We do that by providing high quality, digital content and learning experiences, as well as assessments and qualifications that help people build their skills and grow with the world around them. We are the world’s leading learning company. Learn more at pearsonplc.com.</p>\n<p>Pearson believes that wherever learning flourishes, so do people. We are committed to being an anti-racist company in everything we do. We value the power of an inclusive culture and a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm, and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity, and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to a sustainable environment and workplace where talent can learn, grow, and thrive.</p>",
        "url": "https://jobicy.com/jobs/116422-software-architect-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:54:44",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/c80907b6d4b64a0bd9295e304bf1ac8a.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Customer Success Manager - French or German Speaker",
        "company": "Deel",
        "location": "EMEA,  Europe",
        "description": "As a Deel IT Customer Success Manager you will be responsible for onboarding, growing and the success and satisfaction of Deel IT customers, focused on improving retention and contributing to the overall company revenue targets. You identify with the following Develop and nurture: You love to build and strengthen client relationships with your book of&amp;#8230;",
        "html_description": "<p>As a Deel IT Customer Success Manager you will be responsible for onboarding, growing and the success and satisfaction of Deel IT customers, focused on improving retention and contributing to the overall company revenue targets.</p>\n<h2>You identify with the following</h2>\n<ul>\n<li><strong>Develop and nurture:</strong> You love to build and strengthen client relationships with your book of business and do so with the long-term in mind.</li>\n<li><strong>Onboard and grow</strong>: You will onboard Deel IT customers successfully and will partner for long term growth.</li>\n<li><strong>Guide and coach:</strong> You provide tailored support, onboarding guidance and training to ensure customers are set up from for success from day one.</li>\n<li><strong>Trusted</strong> <strong>Partner:</strong> Become a trusted partner to your accounts and really give a white-glove service, where you truly understand their business needs, present and future.</li>\n<li><strong>Advocate for good:</strong> You can be the voice of the customer in Deel IT so we best understand how we can improve and deliver excellence throughout, and proactively work as project manager.</li>\n<li><strong>Ahead of the curve:</strong> You proactively identify opportunities where we can expand and grow our offering within the client.</li>\n<li><strong>Owner mindset:</strong> You’ll learn Deel&#8217;s wider product offerings inside and out to ensure that you can support your accounts in their Deel IT journey supported by our Customer Service and Operations teams.</li>\n</ul>\n<h2>What you need to succeed</h2>\n<ul>\n<li><strong>Walked the walk</strong> &#8211; You have at least 2+ years of experience in customer/client success role and really understand how to solve complex problems.</li>\n<li><strong>Competent communicator</strong> &#8211; You are an excellent communicator and you will either be fluent in French or German as well as English.</li>\n<li><strong>Expert Insight</strong> &#8211; Experience in managing a complex B2B SaaS product and quickly ramping up to becoming a product expert.</li>\n<li><strong>Creativity and drive</strong> &#8211; You have a creative approach to problem-solving and embrace the challenge with the tools at your disposal.</li>\n</ul>\n<h2><strong>Bonus Experience</strong></h2>\n<ul>\n<li>Previous experience in MDM, End Point security or SaaS for IT teams</li>\n</ul>\n<h2><strong>Total Rewards</strong></h2>\n<p>Our workforce deserves fair and competitive pay that meets them where they are. With scalable benefits, rewards, and perks, our total rewards programs reflect our commitment to inclusivity and access for all.</p>\n<h2><strong>Some things you’ll enjoy</strong></h2>\n<ul>\n<li>Provided computer equipment tailored to your role</li>\n<li>Stock grant opportunities dependent on your role, employment status and location</li>\n<li>Additional perks and benefits based on your employment status and country</li>\n<li>The flexibility of remote work, including WeWork access where available</li>\n</ul>\n<p><strong>DISCLOSURE </strong></p>\n<p>We use Covey as part of our hiring and/or promotional processes. As part of the evaluation process, we provide Covey with job requirements and candidate-submitted applications.Certain features of the platform may qualify it as an Automated Employment Decision Tool (AEDT) under applicable regulations. For positions in New York City, our use of Covey complies with NYC Local Law 144.</p>\n<p>At Deel, we’re an equal-opportunity employer that values diversity and positively encourage applications from suitably qualified and eligible candidates regardless of  race, religion, sex, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, pregnancy or maternity or other applicable legally protected characteristics.</p>\n<p><em>Deel is an equal-opportunity employer and is committed to cultivating a diverse and inclusive workplace that reflects different abilities, backgrounds, beliefs, experiences, identities and perspectives.</em></p>\n<p>Deel will provide accommodation on request throughout the recruitment, selection and assessment process for applicants with disabilities. If you require accommodation, please inform our Talent Acquisition Team at recruiting@deel.com of the nature of the accommodation that you may require, to ensure your equal participation.</p>",
        "url": "https://jobicy.com/jobs/114018-customer-success-manager-emea",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:53:30",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/282df8b52b60f8a324714ffa21cb4ed5.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Sr. Data Scientist / Staff Data Scientist",
        "company": "StackAdapt",
        "location": "UK",
        "description": "StackAdapt is a self-serve advertising platform that specializes in multi-channel solutions including native, display, video, connected TV, audio, in-game, and digital out-of-home ads. We empower hundreds of digitally-focused companies to deliver outcomes and exceptional campaign performance everyday. StackAdapt was founded with a vision to be more than an advertising platform, it’s a hub of innovation,&amp;#8230;",
        "html_description": "<p>StackAdapt is a self-serve advertising platform that specializes in multi-channel solutions including native, display, video, connected TV, audio, in-game, and digital out-of-home ads. We empower hundreds of digitally-focused companies to deliver outcomes and exceptional campaign performance everyday. StackAdapt was founded with a vision to be more than an advertising platform, it’s a hub of innovation, imagination and creativity.</p>\n<p>We are searching for a talented Data Scientist to join our engineering team as we continue to expand our data science efforts. Our platform is connected to thousands of publishers and advertisers worldwide and as a result, we&#8217;re dealing with millions of requests each second, making billions of decisions. We utilize the latest technologies to solve challenges in traffic, data storage, machine learning, and scalability.</p>\n<p>StackAdapt is a Remote First company, and we are open to candidates located anywhere in the UK for this position.</p>\n<h2>What you&#8217;ll be doing:</h2>\n<ul>\n<li>Innovate ML algorithms to maximize ROI and advertising performance. This ranges from creating entirely new algorithms, to improvements on state-of-the art methods, to development using a deep understanding of classic methods</li>\n<li>Write production code, sometimes collaborating with Data Engineers, to implement the novel ML algorithms</li>\n<li>Prototype potential algorithms and pipelines, test them using historical data, and iterate to modify based on insights</li>\n</ul>\n<h2>What you&#8217;ll bring to the table:</h2>\n<ul>\n<li>Have a Masters degree or PhD in Computer Science, Statistics, Operations Research, or a related field, with dual degrees a plus.</li>\n<li>Have the ability to take an ambiguously defined task, and break it down into actionable steps</li>\n<li>Have a comprehensive understanding of statistics, optimization and machine learning</li>\n<li>Are proficient in coding, data structures, and algorithms</li>\n<li>Enjoy working in a friendly, collaborative environment with others</li>\n</ul>\n<h2>StackAdapters enjoy:</h2>\n<ul>\n<li>Competitive salary</li>\n<li>Private Medical Insurance cover</li>\n<li>Auto-enrolment into the company pension scheme</li>\n<li>Work from home reimbursements</li>\n<li>Coverage and support of personal development initiatives (conferences, courses, etc)</li>\n<li>An awesome parental leave policy</li>\n<li>A friendly, welcoming, and supportive culture</li>\n<li>Our social and team events (virtually!)</li>\n<li>Take part in our walk and wander policy and work anywhere in the world for up to 90 days a year</li>\n</ul>\n<p>If this role speaks to you then please submit an application &#8211; we&#8217;d love to speak with you. Due to a high volume of interest, only those shortlisted for interview will be contacted.</p>\n<p><i>StackAdapt is a diverse and inclusive team of collaborative, hardworking individuals trying to make a dent in the universe. No matter who you are, where you are from, who you love, follow in faith, disability (or superpower) status, ethnicity, or the gender you identify with (if you’re comfortable, let us know your pronouns), you are welcome at StackAdapt. If you have any requests or requirements to support you throughout any part of the interview process, please let our Talent team know.</i></p>",
        "url": "https://jobicy.com/jobs/114081-sr-data-scientist-staff-data-scientist",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:52:46",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/bf5f2bb689c6f35f6cab5459f3eff869.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "People Operations Manager",
        "company": "NationBuilder",
        "location": "USA",
        "description": "At NationBuilder we create software for leaders. We work with advocacy groups, nonprofit organizations, political candidates and parties, community organizers, and anyone else trying to make something happen in the world. Our customers come in all shapes and sizes, from small town organizers trying to win their school board election, to the largest political parties,&amp;#8230;",
        "html_description": "<p>At NationBuilder we create software for leaders. We work with advocacy groups, nonprofit organizations, political candidates and parties, community organizers, and anyone else trying to make something happen in the world. Our customers come in all shapes and sizes, from small town organizers trying to win their school board election, to the largest political parties, candidates, and NGOs around the world. To learn more about NationBuilder, read about our mission, beliefs and values.</p>\n<p>NationBuilder is actively seeking a People Operations Manager. You will report directly to the VP of People &amp; Operations. You are a hands-on HR professional looking for an opportunity to learn and contribute to a thriving community culture. You will execute and optimize day-to-day HR operations across functional areas including: people analytics, compliance, HRIS/payroll system maintenance, administration of employee benefits, and internal communications.</p>\n<h2><strong>You will:</strong></h2>\n<ul>\n<li>Ensure people systems are configured and maintained in alignment with business strategies and compliance/operational requirements.</li>\n<li>Serve as subject matter expert on the HRIS and payroll infrastructure.</li>\n<li>Partner with finance to prepare domestic and global payroll.</li>\n<li>Partner with IT, finance and other department leaders to successfully execute projects and design sustainable workflows across the people tech stack.</li>\n<li>Lead the testing and promotion of new releases, configuration changes, integrations and other applicable functionality.</li>\n<li>Monitor and triage interface issues with compliance and third party vendor solutions.</li>\n<li>Work with data sources to support reporting and analytics that can be leveraged for meaningful action to impact business results and to meet all compliance requirements.</li>\n<li>Collaborate with teammates to ensure consistency, share best practices, improve processes and develop system knowledge.</li>\n<li>Partner with our Employee Benefit broker to manage the Employee Benefit program.</li>\n<li>Manage all leaves of absence.</li>\n<li>Communicate with staff on people-related matters.</li>\n</ul>\n<h2><strong>To be successful in the role, you will have:</strong></h2>\n<ul>\n<li>Ability to analyze situations and propose thoughtful solutions quickly.</li>\n<li>Highly developed communication skills, with a rich relationship to reflective listening.</li>\n<li>Ability to work collaboratively and productively with outside partners and our global team.</li>\n<li>Critical thinking and problem-solving skills that equip you to generate creative solutions to complex challenges.</li>\n<li>Current knowledge of federal and state laws, statutes, regulations, policies and directives pertaining to benefits, payroll, and human resources practices and procedures.</li>\n<li>At least 5 years of experience in HRIS administration, configuration, user administration and maintenance supported by data loads, end-user troubleshooting, etc.</li>\n<li>Skill in managing HRIS operations across organizations and managing HR systems projects with attention to detail and accuracy.</li>\n<li>Experience using best practices to increase efficiency and effectiveness of people operations and programs through technology solutions.</li>\n<li>Skill in project management and effective written functional/technical communications.</li>\n<li>A minimum of 2 years of experience administering Employee Benefits programs and leaves of absence.</li>\n</ul>\n<h2><strong>You:</strong></h2>\n<ul>\n<li>Are a community builder aligned with NationBuilder’s mission and values.</li>\n<li>Are passionate about growing people.</li>\n<li>Are conscientious.</li>\n<li>Are always learning new things independently.</li>\n<li>Are a pragmatic problem solver.</li>\n<li>Appreciate and practice direct communication.</li>\n<li>Are both an eager listener and an active communicator.</li>\n<li>Can see the big picture and execute it in fine detail.</li>\n<li>Are able to be open and creative in idea generation and methodical in execution.</li>\n<li>Have positive energy and a sense of humor.</li>\n<li>See setbacks as an opportunity to grow and to, ultimately, transform.</li>\n<li>Have a “can do” attitude.</li>\n<li>Have the insight to know what’s most important for stakeholders.</li>\n<li>Are not afraid of owning a problem and seeing it through all the way to the end.</li>\n</ul>\n<p>Remote &#8211; United States (People Operations Manager) $115,000—$145,000 USD</p>\n<p>NationBuilder is an equal opportunity employer and we value inclusion. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/114086-people-operations-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:51:20",
        "salary": "USD 115,000 - 145,000",
        "job_type": "full-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/68a45e27595eb7676a299325fadb3f89.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Email Marketing Manager - DTC E-commerce",
        "company": "Foxelli Group",
        "location": "Europe",
        "description": "As the Email Marketing Manager, you&amp;#8217;ll be a key driver in developing and executing email strategies for multiple brands. In this role, You&amp;#8217;ll oversee the end-to-end email marketing process—from crafting engaging, targeted campaigns to analyzing performance metrics, optimizing outcomes, and making data-driven decisions. This is a hands-on position where you&amp;#8217;ll take full ownership of email&amp;#8230;",
        "html_description": "<p>As the <strong>Email Marketing Manager</strong>, you&#8217;ll be a key driver in<strong> developing and executing email strategies</strong> for multiple brands. In this role, You&#8217;ll <strong>oversee the end-to-end email marketing process</strong>—from crafting engaging, targeted campaigns to <strong>analyzing performance metrics, optimizing outcomes, and making data-driven decisions</strong>.</p>\n<p>This is a hands-on position where you&#8217;ll take full ownership of email marketing across several brands, creating personalized, results-oriented experiences for a diverse customer base.</p>\n<h2><strong>RESPONSIBILITIES:</strong></h2>\n<ul>\n<li>Drive results through data-driven strategies, setting clear KPIs and guiding the team to optimize email campaigns that deliver measurable improvements in engagement, conversion, and overall ROI.</li>\n<li>Develop and execute compelling email marketing campaigns across multiple brands, delivering personalized, results-driven content that resonates with our audience.</li>\n<li>Manage and segment our email list to ensure accurate targeting, growth, and optimal performance.</li>\n<li>Craft engaging content for email campaigns that speak directly to our subscribers, using AI tools to generate copy and collaborating closely with the design team to deliver visually compelling, relevant campaigns.</li>\n<li>Oversee the email marketing calendar, ensuring timely execution of campaigns within budget and aligned with business goals.</li>\n<li>Optimize email deliverability, engagement, and conversion rates by continuously testing, refining, and implementing Klaviyo automations.</li>\n<li>Collaborate cross-functionally with other teams to ensure email strategies align with broader marketing initiatives and company objectives.</li>\n</ul>\n<h2><strong>SKILLS &amp; EXPERIENCE:</strong></h2>\n<ul>\n<li><strong>3+ years of experience in email marketing</strong>, ideally within e-commerce or digital marketing, with a proven ability to develop and execute strategic campaigns that drive engagement, conversions, and revenue growth.</li>\n<li>Expert proficiency in Klaviyo, using advanced features like segmentation, A/B testing, and automation workflows to develop highly targeted, data-driven campaigns that align with business goals and maximize ROI.</li>\n<li>Strong analytical mindset, with the ability to assess key performance metrics (e.g., open rates, click-through rates, conversions, and revenue), derive actionable insights, and pivot strategy to continually improve campaign performance and achieve strategic business targets.</li>\n<li>Exceptional written and verbal communication skills, capable of crafting compelling, on-brand email copy that not only engages but converts, tailoring messaging to different customer personas to drive high-impact results.</li>\n</ul>\n<h2><strong>THE RECRUITMENT PROCESS:</strong></h2>\n<ul>\n<li>10 min online DISC assessment to identify your behavioral style, as we strongly believe in the power of diverse teams.</li>\n<li>15-30 min intro e-meet with Foxelli Group Talent Acquisition team to discuss company, role, your experiences, and expectations.</li>\n<li>Home Task.</li>\n<li>60 min e-meet with the Hiring Manager and Foxelli Group CPO to discuss the vision of the role, your competencies, and technical skills, followed by a two-way Q&amp;A session.</li>\n<li>Decision &amp; Feedback from us.</li>\n</ul>\n<h2><strong>SALARY:</strong></h2>\n<p>Starting from €2500 after taxes, depending on your skills, competencies, and experience, with the potential for quarterly performance-based bonuses tied to KPIs.</p>\n<p>❕Please note that this role requires a self-employment certificate.</p>\n<h2><strong>PERKS &amp; BENEFITS:</strong></h2>\n<ul>\n<li>Complimentary gym memberships and company-sponsored outdoor adventures for <strong>your strength</strong> and keeping your physical well-being in check.</li>\n<li>A personal development budget is at your disposal for <strong>your</strong> <strong>personal and professional growth</strong> to ensure you keep continuously growing.</li>\n<li>Generous paid time off, including parental leave and vacation days, to recharge and rejuvenate and ensure <strong>you’re well-rested</strong>.</li>\n<li>A budget for your home office setup so <strong>you’re comfortable</strong> working how you like and where you like.</li>\n<li>Strong company <strong>culture</strong> <strong>and</strong> a <strong>network </strong>of unique individuals<strong> that celebrates you</strong>.</li>\n<li>Full flexibility with your schedule in a fully remote setting for <strong>your control</strong> of a working day, powered by Hubstaff for transparency and fairness.</li>\n</ul>\n<h2><strong>ELIGIBILITY &amp; LOCATION REQUIREMENTS:</strong></h2>\n<p>At Foxelli Group, our team operates primarily in the Eastern European Time Zone (EET), which is<strong> UTC+2</strong> and<strong> UTC+3</strong>. We also use Revolut for payments, so we are open to hiring candidates in countries where Revolut payments are supported.</p>\n<p>Currently, <strong>we are hiring in</strong> Albania, Bosnia and Herzegovina, Croatia, Czech Republic, Estonia, Greece, Georgia, Kosovo, Latvia, Lithuania, Moldova, Montenegro, North Macedonia, Poland, Portugal, Romania, Slovakia, Malta, Slovenia, Serbia, Cyprus, Bulgaria, Hungary, Netherlands, the United Kingdom, and South Africa.</p>\n<p><strong>Ready to lead Foxelli’s growth journey? Apply now!</strong></p>",
        "url": "https://jobicy.com/jobs/116437-email-marketing-manager-d2c-e-commerce-2",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:50:48",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/04/1854e44325283f4e2e72d126afe2c631.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Executive Assistant",
        "company": "Chainlink Labs",
        "location": "Canada,  USA",
        "description": "Join Chainlink Labs, a leading decentralized oracle network company, as a high-impact Executive Assistant and strategic thought partner to our senior leadership. In this dynamic role, you’ll go beyond traditional support—serving as the right hand to our executives and playing a key role in driving operational excellence. From managing complex calendars and high-stakes meetings to&amp;#8230;",
        "html_description": "<p>Join Chainlink Labs, a leading decentralized oracle network company, as a high-impact Executive Assistant and strategic thought partner to our senior leadership. In this dynamic role, you’ll go beyond traditional support—serving as the right hand to our executives and playing a key role in driving operational excellence. From managing complex calendars and high-stakes meetings to navigating sensitive information with discretion, you’ll be trusted to anticipate needs, streamline workflows, and help power our fast-paced, high-performance journey. If you’re proactive, sharp, and thrive in an environment where every day is different, we want to meet you. This role will primarily be supporting either our Product or Engineering organizations The core hours for this role are likely to be EST or CST, but we will certainly consider other timezones.</p>\n<h2><strong>Your Impact</strong></h2>\n<ul>\n<li>Act as a gatekeeper for the executive’s time and focus &#8211; managing and prioritizing requests from across the business and the external ecosystem</li>\n<li>Successfully coordinate and execute department meetings and communications, ensuring smooth collaboration and efficient information flow</li>\n<li>Demonstrate the highest level of discretion when handling sensitive information, recognizing the importance of safeguarding the interests of Chainlink Labs</li>\n<li>Exhibit excellent written communication skills, as you will be communicating largely in text and taking important notes for various engagements</li>\n<li>Be a right-hand person to the executive team, partnering with them to help efficiently navigate their private and professional lives</li>\n<li>Own and deliver on a wide variety of projects and initiatives for the executive team</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>At least 5+ years of experience as an Executive Assistant</li>\n<li>Strong track record of supporting multiple executives either in Product or Engineering organizations</li>\n<li>Experience delivering a high touch support model, anticipating needs, and establishing seamless processes across core executive support tasks, e.g. scheduling, travel, communications, records, and reports</li>\n<li>Experience as an Executive Assistant managing sensitive data and commitment to maintaining confidentiality within a security-focused company environment</li>\n<li>Experience in a multi-time-zone/global setting</li>\n<li>Willingness to work outside usual business hours with a high sense of urgency</li>\n<li>Strong self-management, time management, and organizational skills to effectively handle multiple tasks</li>\n<li>Excellent written communication level, capable of articulating ideas and communicating clearly in writing</li>\n<li>Experience using tact, sound business judgment, a solid understanding of our business, and impeccable time management, managing and prioritizing the C-Suite’s schedule and business obligations</li>\n</ul>\n<h2><strong>Preferred Requirements</strong></h2>\n<ul>\n<li>Experience in small-medium tech startup environments, accustomed to working in agile and ownership-driven settings</li>\n<li>Event planning experience, demonstrating the ability to organize successful team off-sites for the executive’s department</li>\n<li>Experience working on a team of highly collaborative EA’s, sharing insights, representing the executives effectively, and contributing positively to our company culture</li>\n<li>Being located in EST is very strongly preferred</li>\n</ul>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).</em></p>\n<h2><strong>Commitment to Equal Opportunity</strong></h2>\n<p>Chainlink Labs is an equal opportunity employer. All qualified applicants will receive equal consideration for employment in compliance with applicable laws, regulations, or ordinances. If you need assistance or accommodation due to a disability or special need when applying for a role or in our recruitment process, please contact us via this <a href=\"https://docs.google.com/forms/d/1wrB1WRRxShkLHI7roFKlyWDobNc3ex_wfGX2Eau5FLc/edit\" target=\"_blank\" rel=\"noopener\"><u>form</u></a>.</p>",
        "url": "https://jobicy.com/jobs/117012-executive-assistant-4",
        "source": "Jobicy",
        "posted_at": "2025-04-20 04:32:04",
        "salary": "",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Staff Machine Learning Engineer, Gen AI",
        "company": "Mozilla",
        "location": "Canada,  Europe,  USA",
        "description": "A Staff Engineer is the next level from a Senior Engineer. At Mozilla this role can vary but typically a Staff Engineer is a domain expert who leads others within a single team to tackle multi-month projects. Tasks that may be initially ambiguous or require significant planning and require them to influence or direct the&amp;#8230;",
        "html_description": "<p>A Staff Engineer is the next level from a Senior Engineer. At Mozilla this role can vary but typically a Staff Engineer is a domain expert who leads others within a single team to tackle multi-month projects. Tasks that may be initially ambiguous or require significant planning and require them to influence or direct the work of several engineers. They sequence deliverables and manage risks in their team&#8217;s projects, provide feedback on our strategy and goals affecting the team, and turn our strategy into action for their team members. Staff Engineers mentor others by stewarding some responsibilities to more junior and senior engineers so they can take on new ones. They collaborate with management on building team consensus and providing direction. Staff Engineers identify gaps and opportunities for improvement to enable a culture of inclusion and allyship, at all levels of the organization.</p>\n<h2><strong>What you’ll do:</strong></h2>\n<ul>\n<li>Lead the design, development, and integration of Generative AI solutions in Firefox, collaborating cross functionally with product management, full stack engineering and design.</li>\n<li>Build infrastructure for training and inference of LLMs and small language and vision models for use cases on the web and mobile Firefox product experiences.</li>\n<li>Implement robust validation and testing procedures to ensure the developed models&#8217; generalizability and reliability</li>\n<li>Continuously monitor and optimize deployed models for performance and efficiency</li>\n</ul>\n<h2><strong>What you&#8217;ll bring:<br />\n</strong></h2>\n<ul>\n<li>6+ years experience as a Machine Learning engineer building tooling and services for machine learning applications in production.</li>\n<li>Experience with designing and building machine learning tooling and infrastructure for training, deploying, inference and validation of models.</li>\n<li>Experience with distributed systems and platforms for AI integrations across a breadth of applications such as LLM APIs, Cloud based and open source tooling.</li>\n<li>Leading architecture designs to execution independently and track record of improving the team’s overall AI development velocity.</li>\n<li>Strong problem-solving skills and ability to communicate complex concepts to technical and non-technical stakeholders.</li>\n<li>Experience working collaboratively with product managers, project managers, and/or other non-engineering teams.</li>\n<li>Effective documentation and communication skills on a distributed team.</li>\n<li>Commitment to our values:\n<ul>\n<li>Welcoming differences</li>\n<li>Being relationship-minded</li>\n<li>Practicing responsible participation</li>\n<li>Having grit</li>\n</ul>\n</li>\n</ul>\n<h2><strong>Bonus Points:</strong></h2>\n<ul>\n<li>Knowledge of and experience with using LLM solutions across different cloud providers</li>\n<li>You have previously successfully contributed to an open source project.</li>\n<li>Track record of not only building one, but multiple projects deployed with an active user base.</li>\n<li>Experience with responsible AI, transparent algorithms, and putting users’ needs first.</li>\n<li>Excellent communication skills, both in written and presentation form. You have the ability to quickly distill sophisticated topics into concepts that are tailored for your target audience.</li>\n<li>You are a lifelong learner, and continue to refine and improve your skills when you see an opportunity to do so.</li>\n<li>Experience with the browser extensions architecture or ecosystem.</li>\n<li>Experience working in open source environments.</li>\n</ul>\n<h2><strong>What you’ll get:</strong></h2>\n<ul>\n<li>Generous performance-based bonus plans to all eligible employees &#8211; we share in our success as one team</li>\n<li>Rich medical, dental, and vision coverage</li>\n<li>Generous retirement contributions with 100% immediate vesting (regardless of whether you contribute)</li>\n<li>Quarterly all-company wellness days where everyone takes a pause together</li>\n<li>Country specific holidays plus a day off for your birthday</li>\n<li>One-time home office stipend</li>\n<li>Annual professional development budget</li>\n<li>Quarterly well-being stipend</li>\n<li>Considerable paid parental leave</li>\n<li>Employee referral bonus program</li>\n<li>Other benefits (life/AD&amp;D, disability, EAP, etc. &#8211; varies by country)</li>\n</ul>\n<h2><strong>About Mozilla:</strong></h2>\n<p>Mozilla exists to build the Internet as a public resource accessible to all because we believe that open and free is better than closed and controlled. When you work at Mozilla, you give yourself a chance to make a difference in the lives of Web users everywhere. And you give us a chance to make a difference in your life every single day. Join us to work on the Web as the platform and help create more opportunity and innovation for everyone online.</p>\n<h2><strong>Commitment to diversity, equity, inclusion, and belonging:</strong></h2>\n<p>Mozilla understands that valuing diverse creative practices and forms of knowledge are crucial to and enrich the company’s core mission.  We encourage applications from everyone, including members of all equity-seeking communities, such as (but certainly not limited to) women, racialized and Indigenous persons, persons with disabilities, persons of all sexual orientations, gender identities, and expressions.</p>\n<p>We will ensure that qualified individuals with disabilities are provided reasonable accommodations to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment, as appropriate. Please contact us at hiringaccommodation[at]mozilla.com to request accommodation.</p>\n<p>We are an equal opportunity employer. We do not discriminate on the basis of race (including hairstyle and texture), religion (including religious grooming and dress practices), gender, gender identity, gender expression, color, national origin, pregnancy, ancestry, domestic partner status, disability, sexual orientation, age, genetic predisposition, medical condition, marital status, citizenship status, military or veteran status, or any other basis covered by applicable laws.  Mozilla will not tolerate discrimination or harassment based on any of these characteristics or any other unlawful behavior, conduct, or purpose.</p>\n<p><strong>Hiring Ranges: </strong>Remote UK £110,000<!-- --> &#8211; <!-- -->£147,000<!-- --> <!-- -->GBP</p>",
        "url": "https://jobicy.com/jobs/115679-senior-android-engineer-2",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:33:12",
        "salary": "GBP 110,000 - 147,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/mozilla.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Creative Strategist",
        "company": "StackAdapt",
        "location": "Canada,  USA",
        "description": "As a Creative Strategist, you&amp;#8217;ll be at the forefront of client interactions, collaborating closely with our Revenue team to deliver exceptional service tailored to each client&amp;#8217;s unique creative needs. Your knack for communication will shine as you showcase our Creative Studio&amp;#8217;s capabilities and services compellingly, offering strategic recommendations that elevate their brands and crush campaign&amp;#8230;",
        "html_description": "<p>As a Creative Strategist, you&#8217;ll be at the forefront of client interactions, collaborating closely with our Revenue team to deliver exceptional service tailored to each client&#8217;s unique creative needs. Your knack for communication will shine as you showcase our Creative Studio&#8217;s capabilities and services compellingly, offering strategic recommendations that elevate their brands and crush campaign goals.</p>\n<p>StackAdapt is a Remote First company. We are open to candidates located anywhere in Canada for this position.</p>\n<h2>What you&#8217;ll be doing:</h2>\n<ul>\n<li>Providing creative direction, strategy, and performance recommendations backed by data and experience to improve client campaign KPIs</li>\n<li>Acting as a subject-matter expert on all things creative to support our Sales team in winning, growing, and retaining clients</li>\n<li>Demonstrating project management wizardry by handling multiple creative requests from brief creation to asset to delivery while staying on time and on spec</li>\n<li>Collaborating with our dynamic Production Team to deliver innovative ad creatives that match client guidelines, surpass expectations and drive campaign performance</li>\n</ul>\n<h2>What you’ll bring to the table:</h2>\n<ul>\n<li>1-2 years minimum experience in digital marketing, strategy and/or art direction. Graphic design experience is a bonus. Please provide work samples if you have them.</li>\n<li>Proven ability to develop strong concepts (ie. the idea behind a creative)</li>\n<li>Experience working and communicating directly with clients</li>\n<li>Experience creating ads, campaigns, or promotional content for digital &#8211; this may include social media, email newsletters, websites, paid advertising, etc.</li>\n<li>Additional consideration is given to candidates with advanced experience in graphic design, programmatic, HTML, CSS or Javascript, and/or is a fluent speaker of French, Spanish or German.</li>\n</ul>\n<h2>StackAdapters Enjoy:</h2>\n<ul>\n<li>Highly competitive salary + commission structure</li>\n<li>RRSP matching</li>\n<li>3 weeks vacation + 3 personal care days + 1 Culture &amp; Belief day + birthdays off</li>\n<li>Access to a comprehensive mental health care platform</li>\n<li>Health benefits from day one of employment</li>\n<li>Work from home reimbursements</li>\n<li>Optional global WeWork membership for those who want a change from their home office</li>\n<li>Robust training and onboarding program</li>\n<li>Coverage and support of personal development initiatives (conferences, courses, etc)</li>\n<li>Access to StackAdapt programmatic courses and certifications to support continuous learning</li>\n<li>An awesome parental leave policy</li>\n<li>A friendly, welcoming, and supportive culture</li>\n<li>Our social and team events!</li>\n</ul>\n<p><i>StackAdapt is a diverse and inclusive team of collaborative, hardworking individuals trying to make a dent in the universe. No matter who you are, where you are from, who you love, follow in faith, disability (or superpower) status, ethnicity, or the gender you identify with (if you’re comfortable, let us know your pronouns), you are welcome at StackAdapt. If you have any requests or requirements to support you throughout any part of the interview process, please let our Talent team know.</i></p>",
        "url": "https://jobicy.com/jobs/115649-creative-strategist-2",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:32:18",
        "salary": "",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/bf5f2bb689c6f35f6cab5459f3eff869.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "UI, UX Designer and Developer",
        "company": "Files.com",
        "location": "Canada,  USA",
        "description": "At Files.com, we build technology so businesses can manage file transfer and security at scale. We are private equity backed, profitable, and lead our industry in terms of revenue per employee. This means that each and every team member is able to have a high degree of direct responsibility and impact. We are a SaaS,&amp;#8230;",
        "html_description": "<p>At Files.com, we build technology so businesses can manage file transfer and security at scale. We are private equity backed, profitable, and lead our industry in terms of revenue per employee. This means that each and every team member is able to have a high degree of direct responsibility and impact.</p>\n<p>We are a SaaS, Cloud-Based Managed File Transfer platform that enables organizations to securely transfer, share, and store files between users, teams, and organizations.</p>\n<p><strong><strong>Location: Work From Your Home on a Remote-First Team</strong></strong></p>\n<h2><strong>World Class Pay and Benefits:</strong></h2>\n<p>Earn a &#8220;Bay Area&#8221; Salary from Anywhere. Our pay is competitive with the top software companies in the world, with generous base salary plus equity compensation.</p>\n<p><strong>Big Company Benefits:</strong> You&#8217;ll get full  Health/Dental/Vision Insurance coverage (plus 75% of Spouse/Family coverage too),  401(k) with generous matching, 11 Company Holidays per year, and  20 PTO/Vacation days, plus we give employees off for Winter Break at the end of the year!</p>\n<p><strong>Company Macbook Pro and $1,000:</strong> We&#8217;ll send you a company issued contemporary Macbook Pro as well as $1,000 sign-on bonus as a welcome to Files.com.</p>\n<p><strong>Tight-Knit Fun-Loving Team:</strong> You will be joining a fun-loving team that works together very closely, despite the remote work environment.</p>\n<p><strong><strong>100% Remote Opportunity</strong></strong></p>\n<h2><strong>About the Role:</strong></h2>\n<p>Our apps and marketing websites are driven by a modern frontend React and Gatsby-based stack. In this position, you will build new designs and improve existing flows, working directly in React, Figma, and other design tools. Your work at Files.com would be used by hundreds of thousands of corporate users.</p>\n<h2><strong>UI/UX Designer and Developer Responsibilities:</strong></h2>\n<ul>\n<li>Skilled at creating interaction design solutions</li>\n<li>Understand primary personas of the product and map to their use of the product</li>\n<li>Gathering and evaluating user requirements, in collaboration with product managers and engineers specific to platform UX</li>\n<li>Design user journeys across functions from concept to production ready with design tools (Figma)</li>\n<li>Create prototypes and wireframes</li>\n<li>Design graphic user interface elements which will be uniformly used across the product: e.g: menus, tabs, tables, and widgets</li>\n<li>Illustrate design ideas using storyboards, process flows and sitemaps</li>\n<li>Conduct concept and usability testing and gather feedback</li>\n<li>Resolve design-related issues in the app and marketing site by writing JSX and advanced CSS directly in a branch</li>\n<li>Document component-level UI in our Storybook.js</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<ul>\n<li>5+ years of design and development experience for a software solution</li>\n<li>Strong experience in design tools like Figma or Adobe XD, Adobe Suite, Sketch</li>\n<li>Proficient in Web development including HTML, JS, CSS, React.js</li>\n<li>Skilled at creating interaction design solutions</li>\n<li>Strong visual design skills, able to create compelling, branded, high-fidelity product screens</li>\n<li>Familiar working with design systems that consistently scale across platforms</li>\n<li>Experience in designing systems and tools to enable cross team interactions and collaboration</li>\n<li>Hands-on experience designing SaaS and B2B applications</li>\n<li>Creative problem solving and analytical skills with ability to synthesize ideas into tangible solutions for design</li>\n<li>Strong portfolio of design projects</li>\n</ul>\n<p>Show us a great resume! We are eager to see the design decisions you make when representing yourself!</p>",
        "url": "https://jobicy.com/jobs/110715-ui-ux-designer-3",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:30:39",
        "salary": "",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/06/918df61d22e8170f1166fb6e010aaa9a.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Technical Data Analyst, Blockchain",
        "company": "Chainlink Labs",
        "location": "Anywhere",
        "description": "We are looking for a skilled and motivated Data Engineer to drive the development of Chainlink’s public-facing dashboard. This dashboard will serve as a key resource for the Web3 community, showcasing metrics that highlight the performance, adoption, and impact of the Chainlink Network. The ideal candidate will have strong technical expertise in data engineering combined&amp;#8230;",
        "html_description": "<p>We are looking for a skilled and motivated Data Engineer to drive the development of Chainlink’s public-facing dashboard. This dashboard will serve as a key resource for the Web3 community, showcasing metrics that highlight the performance, adoption, and impact of the Chainlink Network. The ideal candidate will have strong technical expertise in data engineering combined with a deep understanding of the blockchain and Web3 space.</p>\n<p>In this role, you will take ownership of defining the metrics to be displayed, building the logic to calculate these metrics, and creating robust data pipelines to ensure their delivery. You’ll be responsible for the accuracy, quality, and timeliness of these metrics, while also contributing insights into how these metrics should reflect the unique aspects of the blockchain ecosystem.</p>\n<h2><strong>Your Impact</strong></h2>\n<ul>\n<li>Collaborate with stakeholders to define and prioritize metrics for the dashboard.</li>\n<li>Build logic to calculate metrics such as transaction volume, total value secured, and staking activity.</li>\n<li>Design and maintain ETL pipelines to process blockchain data and ensure seamless delivery to the dashboard.</li>\n<li>Ensure high data quality and timeliness through monitoring, validation, and debugging processes.</li>\n<li>Provide insights into blockchain-specific metrics, differentiating between concepts such as transaction volume vs. locked value and understanding diverse protocol types (e.g., perpetuals vs. lending protocols).</li>\n<li>Act as a subject matter expert in blockchain data, helping teams interpret the difference between decentralized applications (Dapps) and smart contracts. Partnering with GTM and Marketing which makes understanding metrics and blockchain is important.</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>Proven experience in data engineering, with expertise in ETL processes, cloud platforms (e.g., GCP, AWS), and tools like Apache Airflow, SQL, and Python.</li>\n<li>Strong knowledge of blockchain fundamentals, including smart contracts, decentralized applications, and protocol types.</li>\n<li>Familiarity with Web3 metrics, such as transaction volume, TVL (Total Value Locked), staking, and protocol usage data.</li>\n<li>Excellent ability to collaborate across cross-functional teams, including data science, product, and engineering.</li>\n<li>Passion for Web3, blockchain, and decentralized ecosystems.</li>\n</ul>\n<p>Join our team to craft the data backbone of Chainlink’s public narrative, providing the Web3 community with the insights they need to understand and trust the value of decentralized systems!</p>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).</em></p>",
        "url": "https://jobicy.com/jobs/114947-senior-data-analyst-3",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:28:14",
        "salary": "",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Sr. Product Marketing Manager",
        "company": "Kraken",
        "location": "Canada,  Europe,  USA",
        "description": "As a Krakenite, you’ll be part of a world-class team dedicated to unlocking the potential of blockchain technology. Our fully remote team spans over 70 countries, pioneering premium crypto products for traders, institutions, and newcomers alike. Join us in building the future of crypto! This is a senior-level position helping to lead and execute the&amp;#8230;",
        "html_description": "<p>As a Krakenite, you’ll be part of a world-class team dedicated to unlocking the potential of blockchain technology. Our fully remote team spans over 70 countries, pioneering premium crypto products for traders, institutions, and newcomers alike. Join us in building the future of crypto!</p>\n<p>This is a senior-level position helping to lead and execute the product marketing strategy for Kraken’s Consumer app (Trade), inclusive of equities, payments, and trading. This is inclusive of driving and executing high-impact campaigns and strategies that drive top-of-funnel awareness, adoption, and retention. As a key member of the Consumer Product Marketing team, you will also influence product development by leveraging customer insights, market data, and competitive analysis to shape Kraken’s consumer marketing strategies.</p>\n<h2><strong>The opportunity:</strong></h2>\n<ul>\n<li><strong>GTM Strategy &amp; Execution:</strong> Develop and lead Kraken Consumer’s GTM strategy, driving awareness, acquisition, and retention for core trading products.</li>\n<li><strong>Campaign Leadership:</strong> Own the full end-to-end campaign management process, from strategic planning to execution, across various channels (email, social, influencer, display, ATL).</li>\n<li><strong>Consumer Lifecycle Marketing:</strong> Understand and optimize the customer journey, deploying engagement strategies that maximize LTV and retention.</li>\n<li><strong>Product Positioning &amp; Messaging:</strong> Translate complex financial products into compelling, easy-to-understand value propositions that resonate with diverse audiences.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with product managers, growth teams, design, analytics, and executive leadership to align marketing efforts with business objectives.</li>\n<li><strong>Performance Measurement:</strong> Define, track, and report on key <strong>product KPIs</strong>, including awareness, feature adoption (nMTU), and retention/LTV improvements.</li>\n<li><strong>Thought Leadership:</strong> Serve as the <strong>voice of the customer</strong>, championing insights to inform product roadmaps and marketing initiatives.</li>\n</ul>\n<h2><strong>Skills you should HODL:</strong></h2>\n<ul>\n<li>6+ years of experience in Product Marketing Management (PMM), preferably in fintech, trading (crypto, equities, commodities, FX), payments or high-growth B2C tech.</li>\n<li>Strong crypto expertise and passion, with a deep understanding of market trends, user behavior, and the evolving regulatory landscape.</li>\n<li>Proven ability to drive growth strategies from end-to-end, for multi-matrixed products across different phases of the product lifecycle.</li>\n<li>A data-driven marketer, leveraging insights to optimize campaigns and improve performance.</li>\n<li>Creative storyteller, able to craft compelling narratives that differentiate Kraken in a competitive market.</li>\n<li>Experience leading cross-functional teams and working within complex, fast-paced environments.</li>\n<li>Strong communication and stakeholder management skills, with the ability to secure buy-in at all levels.</li>\n<li>Entrepreneurial mindset, comfortable operating in a high-growth, dynamic setting.</li>\n</ul>\n<p><em>This job is accepting ongoing applications and there is no application deadline.</em></p>\n<p><em>Please note, applicants are permitted to redact or remove information on their resume that identifies age, date of birth, or dates of attendance at or graduation from an educational institution.</em></p>\n<p><em>We consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.</em></p>\n<p>Kraken is powered by people from around the world and we celebrate all Krakenites for their diverse talents, backgrounds, contributions and unique perspectives. We hire strictly based on merit, meaning we seek out the candidates with the right abilities, knowledge, and skills considered the most suitable for the job. We encourage you to apply for roles where you don&#8217;t fully meet the listed requirements, especially if you&#8217;re passionate or knowledgable about crypto!</p>\n<p>As an equal opportunity employer, we don’t tolerate discrimination or harassment of any kind. Whether that’s based on race, ethnicity, age, gender identity, citizenship, religion, sexual orientation, disability, pregnancy, veteran status or any other protected characteristic as outlined by federal, state or local laws.</p>",
        "url": "https://jobicy.com/jobs/116390-senior-product-marketing-manager-7",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:27:48",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales, Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210307081105-509016.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Senior Backend Software Engineer - Japanese Speaker",
        "company": "Udacity",
        "location": "USA",
        "description": "Udacity is looking for a passionate and experienced Senior Software Engineer to join our dynamic team, focusing on advancing AI-driven translations for the Japanese market. You&amp;#8217;ll leverage modern technologies and innovative AI tools, playing a pivotal role in enhancing the learner experience for our global user base. This role is ideal for engineers who genuinely love building&amp;#8230;",
        "html_description": "<p>Udacity is looking for a passionate and experienced Senior Software Engineer to join our dynamic team, focusing on advancing AI-driven translations for the Japanese market. You&#8217;ll leverage modern technologies and innovative AI tools, playing a pivotal role in enhancing the learner experience for our global user base.<br />\nThis role is ideal for engineers who genuinely love building impactful products and thrive in collaborative, cross-functional environments.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<ul>\n<li>Develop and maintain robust, scalable translation tools leveraging cutting-edge AI technologies.</li>\n<li>Design and implement reliable backend services using Go and Node.js, ensuring performance, scalability, and maintainability.</li>\n<li>Collaborate closely with product managers, AI researchers, designers, and fellow engineers to deliver exceptional localization solutions.</li>\n<li>Continuously explore, test, and adopt advanced AI development tools like Cursor, Claude Code, or similar technologies to accelerate product development and innovation.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li><strong>Fluency in Japanese and English.</strong></li>\n<li>Strong backend engineering skills, specifically in Go/Node.js.</li>\n<li>Substantial experience with AI tools and frameworks (Cursor, Claude Code).</li>\n<li>Passionate about creating user-centric solutions tailored to the Japanese market.</li>\n<li>A self-driven learner with a love for innovative technologies and building impactful products.</li>\n</ul>\n<h2><strong>Preferred</strong></h2>\n<ul>\n<li>Prior experience working on localization or internationalization projects, particularly related to the Japanese market.</li>\n<li>Familiarity with cloud services (AWS, Google Cloud).</li>\n<li>Experience with containerization (Docker, Kubernetes).</li>\n</ul>\n<h2><strong>Why Udacity?</strong></h2>\n<p>At Udacity, you&#8217;ll contribute directly to empowering global learners through cutting-edge technology. We foster a culture of innovation, growth, and collaboration, where your ideas will have direct impact. Join us in shaping the future of education and AI-driven localization!</p>\n<p><strong>Location:</strong> While this is a remote role, applicants must be currently authorized to work in the United States of America on a full-time basis.<br />\n<strong>Compensation:</strong> The maximum base pay for this position is $175,000, depending on experience and location.</p>\n<h2><strong>Benefits</strong></h2>\n<p>Experience a rewarding work environment with Udacity&#8217;s perks and benefits!</p>\n<ul>\n<li>Flexibility of working from home, with in-person collaboration spaces in Mountain View, Cairo, Dubai, and Noida.</li>\n<li>Flexible working hours.</li>\n<li>Paid time off.</li>\n<li>Comprehensive medical insurance coverage for you and your dependents.</li>\n<li>Employee wellness resources and initiatives (access to wellness platforms like Headspace, Modern Health).</li>\n<li>Quarterly wellness day off.</li>\n<li>Personalized career development.</li>\n<li>Unlimited access to Udacity courses and Nanodegrees.</li>\n</ul>\n<p><strong>Location:</strong> <strong>We will consider qualified candidates currently based in the United States, with the exception of the following states: Alaska, Delaware, Hawaii, Kentucky, Louisiana, Maine, Mississippi, Missouri, Montana, New Mexico, North Dakota, Oklahoma, South Dakota, Vermont, Wisconsin, Wyoming. Relocation assistance will not be offered</strong></p>\n<h2><strong>What We Do</strong></h2>\n<p>Forging futures in tech is our vision. Udacity is where lifelong learners come to learn the skills they need, to land the jobs they want, and to build the lives they deserve.</p>\n<p><strong>Don’t stop there! Please keep reading&#8230;</strong></p>\n<p>You’ve probably heard the following statistic: Most male applicants only meet 60% of the qualifications, while women and other marginalized candidates only apply if they meet 100% of the qualifications. If <strong>you</strong> think you have what it takes but don’t meet every single point in the job description, please apply!</p>\n<p>We believe that historically, many processes disproportionately hurt the most marginalized communities in society- including people of color, working-class backgrounds, women and LGBTQ people. Centering these communities at our core is pivotal for any successful organization and a value we uphold steadfastly.  Therefore, Udacity strongly encourages applications from all communities and backgrounds.</p>\n<p><strong>Last, but certainly not least…</strong></p>\n<p>Udacity is committed to creating economic empowerment and a more diverse and equitable world. We believe that the unique contributions of all Udacians is the driver of our success. To ensure that our products and culture continue to incorporate everyone’s perspectives and experience we never discriminate on the basis of race, color, religion, sex, gender, gender identity or expression, sexual orientation, marital status, national origin, ancestry, disability, medical condition (including genetic information), age, veteran status or military status, or any other basis protected by federal, state or local laws.</p>\n<p>As part of our ongoing work to build more diverse teams at Udacity, when applying, you will be asked to complete a voluntary self-identification survey. This survey is anonymous, we are unable to connect your application with your survey responses. Please complete this voluntary survey as we utilize the data for diversity measures in terms of gender and ethnic background in both our candidates and our Udacians. We consider this data seriously and appreciate your willingness to complete this step in the process, if you choose to do so.</p>",
        "url": "https://jobicy.com/jobs/115645-backend-engineer-8",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:26:34",
        "salary": "USD 175,000+",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/02/e4374c0d-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Junior UX Designer",
        "company": "Canonical",
        "location": "EMEA,  Europe",
        "description": "Our mission is to make enterprise-grade open source software, applications and services available to people everywhere. We create world-renowned software, impacting the lives of millions of engineers, enterprises, entrepreneurs and consumers every day. Our multi-disciplinary web design and production team includes visual designers, UX designers, front-end and back-end developers to bring exciting web projects to&amp;#8230;",
        "html_description": "<p>Our mission is to make enterprise-grade open source software, applications and services available to people everywhere. We create world-renowned software, impacting the lives of millions of engineers, enterprises, entrepreneurs and consumers every day. Our multi-disciplinary web design and production team includes visual designers, UX designers, front-end and back-end developers to bring exciting web projects to life. We help and learn from each other and strive to improve our work and processes.</p>\n<p>This role sits in the design team reporting to the one of the UX design managers.</p>\n<p><strong>Location:</strong> <em>This role will be based remotely in the EMEA region.</em></p>\n<h2>What will your day look like:</h2>\n<p>We create world-renowned software, impacting the lives of millions of engineers, enterprises, entrepreneurs and consumers every day. Our design team works in a multi-disciplinary environment with visual designers, UX designers, front-end and back-end engineers to  bring exciting web projects to life. We help and learn from each other and constantly strive to improve our work and processes.</p>\n<p>Junior UX Designers at Canonical have a vital role in the success of Ubuntu, our partners, customers and the larger Ubuntu community. Clear, stylish presentation that aids the user experience of our products is how we raise the bar and reach the widest audience. Real content and information will be at the core of the designs you produce. You know the ins and outs of typography, colour and layout, and you care deeply about usability, accessibility and web standards. You should have agency, company or freelance design experience.</p>\n<h2>What we are looking for in you:</h2>\n<ul>\n<li>Excellent academic results at school and university</li>\n<li>Bachelor’s or equivalent in User Experience, Design, or STEM</li>\n<li>Knowledge and passion for user experience, technology and design</li>\n<li>Commitment to continuous learning and improvement &#8211; curious, flexible, scientific</li>\n<li>Drive to finish work and celebrate success</li>\n<li>Confidence in user research practices</li>\n<li>Engagement with the latest design research and innovation</li>\n</ul>\n<p>UX designers should be excellent communicators who are at ease working with a complex mix of engineers, designers and executives. They represent us at cross-functional company meetings and must present their design position with clarity and precision. They should be confident and excited to take on complex design challenges. They should also be able to connect their design leadership to the strategic vision of the company.</p>\n<h2>What we offer you:</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, please ask your Talent Partner.</p>\n<ul>\n<li>Fully remote working environment &#8211; we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of 2,000USD per annum</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental Leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical:</h2>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence &#8211; in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>",
        "url": "https://jobicy.com/jobs/114950-junior-ux-designer",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:24:48",
        "salary": "",
        "job_type": "full-time",
        "category": "Web &amp; App Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/07/9f3fda2fef6dda85970e12ce9a9b8cbe.png",
        "job_level": "Junior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Channel Marketing Manager",
        "company": "Lyra Health",
        "location": "USA",
        "description": "We’re looking for a strategic and results-oriented Channel Marketing Manager to lead the growth of Lyra’s channel partner programs. This high-impact role sits within the Growth Marketing team and is responsible for developing and executing marketing strategies that boost brand visibility, drive partner-led demand, and accelerate co-selling opportunities. The ideal candidate brings deep B2B marketing&amp;#8230;",
        "html_description": "<p>We’re looking for a strategic and results-oriented Channel Marketing Manager to lead the growth of Lyra’s channel partner programs. This high-impact role sits within the Growth Marketing team and is responsible for developing and executing marketing strategies that boost brand visibility, drive partner-led demand, and accelerate co-selling opportunities. The ideal candidate brings deep B2B marketing experience, exceptional project management skills, and a proven track record in partner marketing.</p>\n<p>This role can be carried out from our Burlingame, CA headquarters, hybrid, or fully remote/virtually. Remote candidates must be physically located within the United States.</p>\n<h2>Responsibilities</h2>\n<p><b><u>Strategic Channel Program Development</u></b></p>\n<ul>\n<li>Build and manage scalable channel marketing programs that align with Lyra’s growth goals and partner needs.</li>\n<li>Lead multi-channel, co-branded campaigns– managing timelines, creative development, partner approvals, and performance tracking.</li>\n<li>Collaborate with sales and marketing teams to create compelling partner marketing materials, including presentations, email campaigns, social media content, and landing pages.</li>\n<li>Manage partner communications, ensuring timely and effective messaging around promotions, product launches, and events.</li>\n</ul>\n<p><b><u>Partner Enablement &amp; Relationship Management </u></b></p>\n<ul>\n<li>Serve as a trusted advisor to internal stakeholders and external partners by providing strategic marketing guidance, content customization, and enablement best practices.</li>\n<li>Work closely with partners to understand their marketing needs and provide customized support to maximize our partnership success.</li>\n<li>Create and maintain partner marketing portals with the latest resources, content, and tools.</li>\n<li>Build relationships with partner marketing counterparts and serve as the marketing liaison for partner performance reviews.</li>\n</ul>\n<p><b><u>Performance Analytics &amp; Optimization </u></b></p>\n<ul>\n<li>Develop and report on KPIs and marketing-influenced pipeline metrics across partner campaigns.</li>\n<li>Analyze program performance and recommend optimization tactics to improve ROI and partner engagement.</li>\n</ul>\n<p><b><u>Cross-Functional Collaboration </u></b></p>\n<ul>\n<li>Act as the connective tissue between Product Marketing, Digital, Events, Sales, and Creative to ensure channel marketing initiatives are aligned with company objectives and program run smoothly.</li>\n<li>Engage external vendors, platforms, and agencies as needed to scale execution.</li>\n<li>Collaborate with vendors and agencies as needed to support marketing initiatives.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in Marketing, Business, Communications, or a related field.</li>\n<li>5+ years of experience in B2B marketing, preferably some experience in a channel, partner, or alliance marketing role.</li>\n<li>Deep understanding of demand generation, digital strategy, content marketing, and field marketing execution.</li>\n<li>Excellent written and verbal communication skills with a keen eye for detail.</li>\n<li>Proficiency in marketing tools such as CRM platforms (Salesforce, HubSpot), email marketing software, and analytics tools (Google Analytics, Tableau, etc.).</li>\n<li>Strong project management skills with the ability to multitask and meet deadlines in a fast-paced environment.</li>\n</ul>\n<p>$95,000 &#8211; $146,000 a year</p>\n<p>As a full-time Channel Marketing Manager, you will be employed by Lyra Health, Inc. The anticipated annual base salary range for this full-time position is $95,000 to $146,000. The base range is determined by role and level, and placement within the range will depend on a number of job-related factors, including but not limited to your skills, qualifications, experience and location. This role may also be eligible for discretionary bonuses.</p>\n<p><strong>Annual salary is only one part of an employee’s total compensation package at Lyra. We also offer generous benefits that include:</strong></p>\n<ul>\n<li>Comprehensive healthcare coverage (including medical, dental, vision, FSA/HSA, life and disability insurances)</li>\n<li>Lyra for Lyrians; coaching and therapy services</li>\n<li>Equity in the company through discretionary restricted stock units</li>\n<li>Competitive time off with pay policies including vacation, sick days, and company holidays</li>\n<li>Paid parental leave</li>\n<li>401K retirement benefits</li>\n<li>Monthly tech allowance</li>\n<li>We like to spread joy throughout the year with well-being perks and activities, surprise swag, free food, regular community celebration…and more!</li>\n</ul>\n<p>We can’t wait to meet you.</p>\n<p>We are an Equal Opportunity Employer. We do not discriminate on the basis of race, color, religion, sex (including pregnancy), national origin, age, disability, genetic information or any other category protected by law.</p>",
        "url": "https://jobicy.com/jobs/117002-channel-marketing-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:17:04",
        "salary": "USD 95,000 - 146,000",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/1594f6d9649b131ca2414928bd60caac.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Senior Product Designer",
        "company": "ActiveCampaign",
        "location": "USA",
        "description": "ActiveCampaign is looking for a Senior Product Designer to join our growing Design team. You’ll be embedded within our Platform team, shaping the foundation that powers how users experience our product at scale. This role is ideal for a designer who brings craft excellence, strategic thinking, and a strong product mindset—someone who thrives in ambiguity&amp;#8230;",
        "html_description": "<p>ActiveCampaign is looking for a Senior Product Designer to join our growing Design team. You’ll be embedded within our Platform team, shaping the foundation that powers how users experience our product at scale. This role is ideal for a designer who brings craft excellence, strategic thinking, and a strong product mindset—someone who thrives in ambiguity and enjoys driving clarity across complex systems.</p>\n<p>As a senior member of the team, you’ll lead cross-functional initiatives, influence platform-wide UX patterns, and elevate the overall quality of our product experience. You’ll partner closely with product, engineering, data, and research to design thoughtful, scalable solutions that meet both customer and business needs.</p>\n<h3>What your day could consist of:</h3>\n<ul>\n<li>Drive end-to-end design for platform initiatives, from research, opportunity framing to final implementation—balancing user needs, technical feasibility, and business goals.</li>\n<li>Partner across teams to identify user pain points, define success, and improve foundational UX patterns that scale across the product ecosystem.</li>\n<li>Lead with insight and intention—using research, data, and stakeholder feedback to inform decisions and measure impact.</li>\n<li>Craft and share design artifacts—wireframes, flows, prototypes, and visuals—that clearly communicate your thinking and invite collaboration.</li>\n<li>Conduct usability tests, gather insights, and iterate quickly to improve outcomes.</li>\n<li>Maintain visibility into how your work is performing post-launch and continuously refine based on learnings.</li>\n<li>Shape and uphold a high bar for design quality and consistency across the platform.</li>\n<li>Collaborate with the Design Systems team to evolve reusable components and patterns that reflect our brand, accessibility standards, and product vision.</li>\n<li>Mentor and support other designers through critique, feedback, and guidance on best practices.</li>\n</ul>\n<h3>What is needed:</h3>\n<ul>\n<li>6+ years of experience designing digital products—preferably in SaaS or B2B tech.</li>\n<li>A natural curiosity for emerging tools and design trends—including interest in how AI can influence product design and user workflows.</li>\n<li>A strong portfolio demonstrating end-to-end design thinking across complex, multi-surface systems at scale.</li>\n<li>Expertise in information architecture, user flows, interaction design, and visual design principles.</li>\n<li>Proven ability to simplify complexity—bringing clarity to technical concepts and turning ambiguity into actionable direction.</li>\n<li>Confident communicator who can align stakeholders around a compelling vision and design rationale.</li>\n<li>Comfortable working iteratively and navigating ambiguity in fast-moving environments.</li>\n<li>Experience working with design systems and contributing to their evolution.</li>\n</ul>\n<p>$120,000 &#8211; $165,000 a year</p>\n<p>Compensation details listed in this posting reflect the base rate only and do not include bonus, equity, sales incentives or other role specific compensation that the role may be eligible for. ActiveCampaign believes in and is committed to equitable compensation practices. The salary range provided above is a good faith estimate of the pay range determined by the location associated with the job posting. The actual salary depends on a candidate’s skills, experience, and work location.</p>\n<p><b>About ActiveCampaign:</b></p>\n<p>ActiveCampaign’s email and marketing automation platform helps businesses, entrepreneurs, and creators turn ideas into results. By combining your data, AI, and 950+ integrations (including Shopify, Facebook, Salesforce, and Square), ActiveCampaign makes it effortless to create personalized experiences across the entire customer lifecycle.</p>\n<p><b>Perks and benefits:</b></p>\n<p>ActiveCampaign is an employee-first culture. We take care of our employees at work and outside of work. You can see more of the details here, but some of our most popular benefits include:</p>\n<ul>\n<li>Comprehensive health and wellness benefits that includes a High Deductible Health Plan (HDHP) fully covered by ActiveCampaign, complimentary access to telehealth and tele-mental health resources, and a complimentary membership to Calm</li>\n<li>Open paid time off</li>\n<li>Generous 401(k) matching program with immediate vesting</li>\n<li>Quarterly Path Perks with options for commuter and lunch benefits (for those reporting to a Hub), or a remote home office stipend</li>\n<li>Access to professional development resources through LinkedIn Learning</li>\n<li>After five years of service, you’ll be eligible for a four-week paid sabbatical leave and a sabbatical leave bonus</li>\n</ul>\n<p>ActiveCampaign is an equal opportunity employer. We recruit, hire, pay, grow and promote no matter of gender, race, color, sexual orientation, religion, age, protected veteran status, physical and mental abilities, or any other identities protected by law.</p>\n<p>Our Employee Resource Groups (ERGs) strive to foster a diverse inclusive environment by supporting each other, building a strong sense of belonging, and creating opportunities for mentorship and professional growth for their members.</p>",
        "url": "https://jobicy.com/jobs/117000-senior-product-designer-20",
        "source": "Jobicy",
        "posted_at": "2025-04-19 09:14:31",
        "salary": "USD 120,000 - 165,000",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/af4e42567a6faa8e315a3991ae7f24a0.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Customer Success Manager",
        "company": "Chainlink Labs",
        "location": "APAC",
        "description": "Chainlink Labs is the primary contributing developer of Chainlink, the decentralized computing platform powering the verifiable web. Chainlink is the industry-standard platform for providing access to real-world data, offchain computation, and secure cross-chain interoperability across any blockchain. Chainlink Labs helps power verifiable applications for banking, DeFi, global trade, and gaming by collaborating with some of&amp;#8230;",
        "html_description": "<p>Chainlink Labs is the primary contributing developer of Chainlink, the decentralized computing platform powering the verifiable web. Chainlink is the industry-standard platform for providing access to real-world data, offchain computation, and secure cross-chain interoperability across any blockchain. Chainlink Labs helps power verifiable applications for banking, DeFi, global trade, and gaming by collaborating with some of the world’s largest financial institutions, notably Swift, DTCC, and ANZ. Chainlink Labs also works with top Web3 teams, including Aave, Compound, GMX, Maker, and Synthetix. Chainlink Labs was ranked in Newsweek’s 100 Most Loved Workplaces 2023 in both the United States and United Kingdom.</p>\n<h2><strong>Your Impact</strong></h2>\n<ul>\n<li>Develop and implement new tiering systems for both existing and new projects in the BUILD program.</li>\n<li>Ensure startups are strategically positioned for success in the decentralized world.</li>\n<li>Conduct comprehensive resource planning for the BUILD technical program objectives and growth plans.</li>\n<li>Collaborate with internal teams to define and align OKRs (Objectives and Key Results) for the BUILD program in 2025.</li>\n<li>Establish measurable and achievable goals to drive program success.</li>\n<li>Success Strategy and Alumni Network:</li>\n<li>Develop a comprehensive success strategy for the program, including effective offboarding processes and the creation of an alumni network.</li>\n<li>Foster long-term relationships with successful startups post-signature.</li>\n</ul>\n<h2><strong>Requirements </strong></h2>\n<ul>\n<li>Fluent in Mandarin and English</li>\n<li>Strong understanding of traditional financial markets &amp; financial products, and their interplay with blockchain technology. This includes RWAs and DeFi.</li>\n<li>A proactive problem-solving mindset to address challenges and roadblocks in partnership development and integration. This includes the ability to troubleshoot issues, resolve conflicts, and find creative solutions to ensure the success of partnerships.</li>\n<li>Excellent communication, negotiation, and interpersonal skills to effectively manage complex relationships and collaborations. Proven track record of managing multiple accounts, driving growth, and delivering exceptional client service.</li>\n<li>Ability to adapt and thrive in a fast-paced, evolving industry, staying updated on industry trends and regulatory changes.</li>\n<li>Acute ability to work cross-functionally, incl. facilitating information flow between the market and internal departments, engage with internal teams (i.e. blockchain partnerships, marketing, legal, etc.) to drive partnership growth and act as a point of escalation if issues arise.</li>\n<li>Proven track record in creating and executing strategic account plans, including setting objectives, developing growth strategies, and effectively communicating these strategies to both internal and external stakeholders.</li>\n</ul>\n<h2><strong>Preferred Qualifications</strong></h2>\n<ul>\n<li>Have an extensive network of relationships across financial institutions and the ability to connect to and influence their strategic planning</li>\n<li>Experience working with digital assets and/or inside a leading financial services provider.</li>\n<li>Innovative mindset with a history of proposing and implementing creative solutions to address challenges or capitalize on opportunities within partner relationships.</li>\n</ul>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).</em></p>\n<h2><strong>Commitment to Equal Opportunity</strong></h2>\n<p>Chainlink Labs is an equal opportunity employer. All qualified applicants will receive equal consideration for employment in compliance with applicable laws, regulations, or ordinances. If you need assistance or accommodation due to a disability or special need when applying for a role or in our recruitment process, please contact us via this <a href=\"https://docs.google.com/forms/d/1wrB1WRRxShkLHI7roFKlyWDobNc3ex_wfGX2Eau5FLc/edit\" target=\"_blank\" rel=\"noopener\">form</a>.</p>",
        "url": "https://jobicy.com/jobs/116989-customer-success-manager-23",
        "source": "Jobicy",
        "posted_at": "2025-04-18 15:13:00",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Customer Success Manager - SMB",
        "company": "1Password",
        "location": "Canada,  USA",
        "description": "Our Customer Success team works proactively and prescriptively to help customers get the most value from their investment in security and privacy by establishing long term relationships and acting as trusted advisors to our customers. The Customer Success Manager guides Teams and Business customers through established best practices by demonstrating an  understanding of their structure and needs while&amp;#8230;",
        "html_description": "<p>Our Customer Success team works proactively and prescriptively to help customers get the most value from their investment in security and privacy by establishing long term relationships and acting as trusted advisors to our customers.</p>\n<p>The Customer Success Manager guides Teams and Business customers through established best practices by demonstrating an  understanding of their structure and needs while guiding them throughout their 1Password lifecycle working closely with Onboarding and Account management. This individual acts as the customer champion and advocate, helping increase awareness of customer needs and priorities. Customer retention is a key focus for this team member, supporting our customers in seeing the value of their investment with 1Password, and driving towards their adoption goals through proactive and reactive customer engagement</p>\n<p>This is a remote opportunity within Canada and the US.</p>\n<h2>What we&#8217;re looking for</h2>\n<ul>\n<li>Minimum 2 years experience managing a large book of business in a Customer Success role in a SaaS or Tech environment servicing customers at scale through strategic calls and engagement</li>\n<li>Strong communication skills over email, the phone, or even a video call. Presenting and speaking to new people each day excites you. Your style is concise yet empathetic – with a balance of teaching and listening/learning yourself as well as knowing when to pivot in a conversation.</li>\n<li>Experience with, and passion for, helping people or businesses use software to be more productive and efficient. You’re passionate about discovering what a team needs in their workplace, and you ask strong open-ended questions that help you learn more about them. You enjoy translating technical terms for customers who find technology confusing or intimidating.</li>\n<li>Experience proactively guiding customers through their lifecycle via email, webinars, and customized sessions; making prescriptive recommendations and helping customers achieve their desired outcomes and ensure high adoption rates across a book of business.</li>\n<li>Follows defined outreach and follow-up communication processes managing data and activity of customers in tandem with the Onboarding and Account management teams; and synthesizing and logging findings from customer discussions such as feature requests, customer details, and general feedback/metrics accurately.</li>\n<li>Supports customers within their book of business through the annual renewal process, following defined process to engage with our customers early, and support in closing out renewals on a timely basis with customer satisfaction and retention in mind</li>\n<li>Hands off cross-sell/upsell opportunities to Account managers and engages enthusiastic customers in advocacy initiatives such as customer panels, case studies and product discussions.</li>\n<li>Contributes to the success of the Customer Success team in an ongoing capacity through team goals and metrics (including operational, NPS, revenue, and performance metrics).</li>\n<li>Previous experience with a CRM like Gainsight is a plus!</li>\n<li>Optional: You have personal experience with 1Password or another password manager. While not required, it’ll help you quickly have confidence in this role</li>\n</ul>\n<h2>What you can expect</h2>\n<ul>\n<li><b>Month 1:</b></li>\n<li>Get to know the product, our culture, the Customer Success processes, and the people you&#8217;ll be working with.</li>\n<li>Learn Salesforce, what and how we track, and the benefits of keeping customer information within it updated.</li>\n<li>By the end of the first month, you’ll be able to guide an SMB sized customer through an intro discussion in our Customer Success process.</li>\n<li><b>Month 3:</b></li>\n<li>Can guide a small customer through multiple levels of the defined Customer Success process, using your product expertise to educate, provide feedback, and discover opportunities to upsell or expand, while driving value for the customer.</li>\n<li>Proactively report on customers’ needs and valuable feedback so the marketing and product teams can accurately reflect messaging and prioritize the right projects to improve the product.</li>\n<li>Build and maintain a healthy account book of customers</li>\n<li><b>Month 6</b></li>\n<li>Have developed your best personal approach and rhythm, analyzed the Customer Success processes to maximize your customer engagement, and begun collaborating with cross-functional peers in internal teams</li>\n</ul>\n<p>USA-based roles only: The annual base salary for this role is between $68,000 USD and $92,000 USD and is commission-eligible. The role is also eligible for immediate participation in 1Password&#8217;s benefits program (health, dental, 401k and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</p>\n<p>Canada-based roles only: The annual base salary for this role is between $62,000 CAD and $84,000 CAD and is commission-eligible. The role is also eligible for immediate participation in 1Password’s generous benefits program (health, dental, RRSP and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</p>\n<p>At 1Password, we approach each individual&#8217;s compensation with a promise of fair market value and internal equity commensurate with experience and specific skill set.</p>\n<p>We believe in the power of remote work, but we also recognize that some in-person connection with team members and customers is important to help us achieve our mission. While we are a remote-first company, occasional travel for in-person engagement will be a part of this role. This may include but is not limited to bi-annual department-wide offsites, quarterly department meetings and periodic customer events. These events will typically be held in varying locations across EMEA, Canada and/or the USA. In leadership roles, you can expect to travel once per month on average.</p>\n<h2><b>What we offer</b></h2>\n<p>We believe in working hard, and resting hard. We’re always looking for new ways to support our team members, but here’s a glance at what we currently offer:</p>\n<p><b>Health and wellbeing</b></p>\n<p>&gt;  Maternity and parental leave top-up programs</p>\n<p>&gt;  Wellness spending allowance</p>\n<p>&gt;  Generous PTO policy</p>\n<p>&gt;  Company-wide wellness days off scheduled throughout the year</p>\n<p>&gt;  Wellness Coach membership</p>\n<p>&gt;  Comprehensive health coverage</p>\n<p><b> Growth and future </b></p>\n<p>&gt;  Company equity for all full-time employees</p>\n<p>&gt;  Retirement matching program</p>\n<p>&gt;  Training budget, 1Password University access, and learning sessions</p>\n<p>&gt;  Free 1Password account (and friends and family discount!)</p>\n<p><b>Flexibility and community</b></p>\n<p>&gt;  Paid volunteer days</p>\n<p>&gt;  Employee-led DEIB programs and ERGs and ECGs</p>\n<p>&gt;  Fully remote environment</p>\n<p>&gt;  Peer-to-peer recognition through Bonusly</p>\n<p><i>1Password is proud to be an equal opportunity employer. We are committed to fostering an inclusive, diverse and equitable workplace that is built on trust, support and respect. We welcome all individuals and do not discriminate on the basis of gender identity and expression, race, ethnicity, disability, sexual orientation, colour, religion, creed, gender, national origin, age, marital status, pregnancy, sex, citizenship, education, languages spoken or veteran status. Be yourself, find your people and share the things you love. </i></p>\n<p><i>Accommodation is available upon request at any point during our recruitment process. If you require an accommodation, please speak to your talent acquisition partner or email us at nextbit@agilebits.com and we’ll work to meet your needs. </i></p>\n<p><i>Remote work is a part of our DNA. Given that our company was founded remotely in 2005, we can safely say we&#8217;re experts at building remote culture. That said, remote work at 1Password does mean working from your home country. If you&#8217;ve got questions or concerns about this, your talent partner would be happy to address them with you.</i></p>\n<p><i>Successful applicants will be required to complete a background check that may consist of prior employment verification, reference checks, education confirmation, criminal background, publicly available social media, credit history, or other information, as permitted by local law.</i></p>",
        "url": "https://jobicy.com/jobs/116357-customer-success-manager-smb-3",
        "source": "Jobicy",
        "posted_at": "2025-04-18 04:42:44",
        "salary": "USD 68,000 - 92,000",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200909195848-296323.png",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Social Media Manager",
        "company": "Jimdo",
        "location": "Germany",
        "description": "We are seeking a dynamic Social Media Manager to develop and execute our social media strategy across multiple platforms. The ideal candidate will be responsible for community management, managing the Jimdo social media channels, including creating engaging content to drive brand awareness and customer engagement. Strong communication skills and a deep understanding of social media&amp;#8230;",
        "html_description": "<p>We are seeking a dynamic Social Media Manager to develop and execute our social media strategy across multiple platforms. The ideal candidate will be responsible for community management, managing the Jimdo social media channels, including creating engaging content to drive brand awareness and customer engagement. Strong communication skills and a deep understanding of social media trends are essential. Additionally, this role includes overseeing our TikTok agency to ensure alignment with our brand goals.</p>\n<h2><strong>What you’ll be doing:</strong></h2>\n<ul>\n<li>Creating engaging and high-quality content tailored for different social media platforms (primarily Instagram and TikTok)</li>\n<li>Analyzing social media metrics to measure campaign success and inform strategy adjustments</li>\n<li>Using your excellent writing skills to craft posts and interact with followers and community members</li>\n<li>Managing multiple campaigns and projects simultaneously, using your expertise across a number of different platforms (TikTok, Instagram, Facebook, Threads, and YouTube)</li>\n<li>Keeping up-to-date with the latest social media trends, tools, and best practices</li>\n</ul>\n<h2><strong>What you bring to the table:</strong></h2>\n<ul>\n<li>Minimum of 3+ years experience managing brands across social media, either in-house or at an agency</li>\n<li>Extensive experience running social media channels, specifically Instagram, TikTok, YouTube, and Facebook</li>\n<li>Strong experience in community management</li>\n<li>Proven experience in social copywriting in German, as a native German speaker</li>\n<li>Proficiency in using Canva to create aesthetically pleasing designs for Instagram and other social channels</li>\n<li>Experience managing a TikTok agency and feedback/write briefings for creators</li>\n<li>Excellent written and verbal communication skills</li>\n<li>High level of creativity and ability to develop innovative content ideas</li>\n<li>Strong collaboration skills to work effectively with other departments and teams</li>\n<li>Efficient time management to handle multiple tasks and meet deadlines</li>\n<li>Ability to stay up-to-date with current technologies and trends in social media, design tools, and applications</li>\n</ul>\n<h2><strong>What we offer:<br />\n</strong></h2>\n<p><strong><u>Inspiring Mission:</u></strong> At our core, we are driven by a meaningful mission &#8211; to  empower solopreneurs and small businesses to succeed and  to contribute to the sustainability and vibrancy of the communities they serve.</p>\n<p><strong><u>Flexibility and Trust:</u></strong> Our work environment thrives on flexibility and trust. We offer fully remote work set-up  with opportunities for in-person collaboration. You can manage your working hours flexibly because we prioritize the results you deliver over the number of hours you put in.</p>\n<p><strong><u>Support for your side hustles:</u></strong> We encourage side hustles. In addition, you get up to three free Jimdo websites for your personal or professional projects that you get to keep forever.</p>\n<p><strong><u>An International Diverse Team:</u></strong> Our team is a mosaic of over 248 individuals hailing from 50+ different countries and working across 15+ diverse locations. We take pride in our openness and inclusivity, with an Employee-led DEI Council and active ERGs that ensure everyone&#8217;s voices are heard.</p>\n<p><strong><u>Continuous  Growth and Career Development:</u></strong> We invest in your growth with company-wide access to LinkedIn Learning and curated learning paths. From day one, you have the chance to contribute your ideas and create a meaningful impact. Our flat hierarchies and swift decision-making processes provide an open platform for your career progression.</p>\n<p><strong><u>Competitive Benefits Package:</u></strong></p>\n<ul>\n<li>Annual compensation reviews to ensure you&#8217;re rewarded fairly.</li>\n<li>A remote office set-up bonus to enhance your workspace.</li>\n<li>A unique workation policy that allows you to work from different locations.</li>\n<li>An employee assistance program, offering resources and counseling.</li>\n<li>Plus, a perk that keeps giving: up to three free Jimdo websites for your personal or professional projects that you get to keep forever.</li>\n</ul>\n<p><em>Jimdo is proud to be an equal opportunity employer. This means that we don’t discriminate based on race or ethnic origin, color, the language(s) you speak, where you (or your parents) are from, or whether or not you consider yourself to have a disability. Neither will your age, gender, gender identity, sexual orientation, religion, beliefs, or political opinions play a part in your application with us. Our diverse team values and celebrates the uniqueness of each individual. We embrace differences and believe that they enrich our organization, making us stronger and more innovative. Join us, and let&#8217;s continue to create a workplace where everyone can thrive, regardless of background or identity.</em></p>",
        "url": "https://jobicy.com/jobs/115636-social-media-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-18 04:39:23",
        "salary": "",
        "job_type": "full-time",
        "category": "Social Media Marketing",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210311180131-465051.png",
        "job_level": "Any",
        "scraped_date": "2025-04-21"
    },
    {
        "title": "Sr. Business Analyst",
        "company": "Jimdo",
        "location": "Germany",
        "description": "As a Senior Business Analyst, you will play a key role in shaping our company’s strategic direction through data-driven insights and performance analysis. Your expertise will guide leadership, optimize financial outcomes, and help drive revenue growth. You will report into the Senior Reporting Manager. If you love transforming data into actionable strategies and thrive in&amp;#8230;",
        "html_description": "<p>As a Senior Business Analyst, you will play a key role in shaping our company’s strategic direction through data-driven insights and performance analysis. Your expertise will guide leadership, optimize financial outcomes, and help drive revenue growth. You will report into the Senior Reporting Manager.</p>\n<p>If you love transforming data into actionable strategies and thrive in a dynamic, collaborative environment—this is your opportunity to make a real impact.</p>\n<h2><strong>Your impact</strong></h2>\n<ul>\n<li>Provide strategic advice to senior leadership and revenue owners on business performance and growth opportunities.</li>\n<li>Conduct deep-dive analyses and uncover insights to accelerate business growth and increase operational efficiency.</li>\n<li>Drive a data-driven culture across Jimdo, ensuring that analytics fuel decision-making.</li>\n<li>Build and optimize self-service data capabilities so teams can access insights independently.</li>\n<li>Collaborate cross-functionally with Accounting, FP&amp;A, and Analytics teams to align strategic initiatives.</li>\n</ul>\n<h2><strong>What you bring</strong></h2>\n<ul>\n<li>Strong analytical skills – experience with SQL, Tableau (or similar), and key business metrics.</li>\n<li>Expertise in data-driven decision-making – customer segmentation, LTV analysis, and data exploration.</li>\n<li>Excellent communication &amp; presentation – translating complex insights into clear recommendations.</li>\n<li>Business acumen – a deep understanding of SaaS revenue models and commercial strategy.</li>\n<li>Self-driven and impact-oriented mindset – you proactively identify and drive improvements.</li>\n</ul>\n<h2><strong>What we offer<br />\n</strong></h2>\n<p><strong><u>Inspiring Mission:</u></strong> At our core, we are driven by a meaningful mission &#8211; to  empower solopreneurs and small businesses to succeed and  to contribute to the sustainability and vibrancy of the communities they serve.</p>\n<p><strong><u>Flexibility and Trust:</u></strong> Our work environment thrives on flexibility and trust. We offer fully remote work set-up  with opportunities for in-person collaboration. You can manage your working hours flexibly because we prioritize the results you deliver over the number of hours you put in.</p>\n<p><strong><u>Support for your side hustles:</u></strong> We encourage side hustles. In addition, you get up to three free Jimdo websites for your personal or professional projects that you get to keep forever.</p>\n<p><strong><u>An International Diverse Team:</u></strong> Our team is a mosaic of over 248 individuals hailing from 50+ different countries and working across 15+ diverse locations. We take pride in our openness and inclusivity, with an Employee-led DEI Council and active ERGs that ensure everyone&#8217;s voices are heard.</p>\n<p><strong><u>Continuous  Growth and Career Development:</u></strong> We invest in your growth with company-wide access to LinkedIn Learning and curated learning paths. From day one, you have the chance to contribute your ideas and create a meaningful impact. Our flat hierarchies and swift decision-making processes provide an open platform for your career progression.</p>\n<p><strong><u>Competitive Benefits Package:</u></strong></p>\n<ul>\n<li>Annual compensation reviews to ensure you&#8217;re rewarded fairly.</li>\n<li>A remote office set-up bonus to enhance your workspace.</li>\n<li>A unique workation policy that allows you to work from different locations.</li>\n<li>An employee assistance program, offering resources and counseling.</li>\n<li>Plus, a perk that keeps giving: up to three free Jimdo websites for your personal or professional projects that you get to keep forever.</li>\n</ul>\n<p><em>Jimdo is proud to be an equal opportunity employer. This means that we don’t discriminate based on race or ethnic origin, color, the language(s) you speak, where you (or your parents) are from, or whether or not you consider yourself to have a disability. Neither will your age, gender, gender identity, sexual orientation, religion, beliefs, or political opinions play a part in your application with us. Our diverse team values and celebrates the uniqueness of each individual. We embrace differences and believe that they enrich our organization, making us stronger and more innovative. Join us, and let&#8217;s continue to create a workplace where everyone can thrive, regardless of background or identity.</em></p>",
        "url": "https://jobicy.com/jobs/116360-senior-business-analyst-2",
        "source": "Jobicy",
        "posted_at": "2025-04-18 04:39:22",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210311180131-465051.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-21"
    }
]