[
    {
        "title": "Account Executive Mid Market - Emerging Markets",
        "company": "GitLab",
        "location": "Europe",
        "description": "Mid-market Account Executives are the primary point of contact between prospective and existing customers of GitLab within a space defined as mid-market, which currently works with companies that employ up to 4000 employees. These GitLab team members manage the spectrum of project sizes, ranging from small fast growing teams in smaller agile organizations to complex&amp;#8230;",
        "html_description": "<p>Mid-market Account Executives are the primary point of contact between prospective and existing customers of GitLab within a space defined as mid-market, which currently works with companies that employ up to 4000 employees. These GitLab team members manage the spectrum of project sizes, ranging from small fast growing teams in smaller agile organizations to complex enterprise projects advising on the journey with GitLab to achieve specific business outcomes. Mid-Market AEs work closely in tandem with the business development team and sales management to manage a broad book of business spread over a large opportunity value range and focus on exceeding client expectations.</p>\n<h2><strong>What you’ll do</strong></h2>\n<ul>\n<li>Account Executive, Mid-market (AE) will report to an Area Sales Manager.</li>\n<li>Support GitLab for our Mid Market prospects.</li>\n<li>Contribute to root cause analyses on wins/losses.\n<ul>\n<li>Communicate lessons learned to the team, including account managers, the marketing team, and the technical team.</li>\n</ul>\n</li>\n<li>Take ownership of your book of business\n<ul>\n<li>document the buying criteria</li>\n<li>document the buying process</li>\n<li>document next steps and owners</li>\n<li>ensure pipeline accuracy based on evidence and not hope</li>\n</ul>\n</li>\n<li>Contribute to documenting improvements in our sales handbook.</li>\n<li>Provide account leadership and direction in the pre- and post-sales process</li>\n<li>Be the voice of the customer by contributing product ideas to our public issue tracker</li>\n</ul>\n<h2><strong>What you’ll bring </strong></h2>\n<ul>\n<li>A true desire to see customers benefit from the investment they make with you</li>\n<li>Demonstrated progressive experience with Software sales</li>\n<li>Interest in GitLab, and open source software</li>\n<li>Ability to leverage established relationships and proven sales techniques for success</li>\n<li>Effective communicator, strong interpersonal skills</li>\n<li>Motivated, driven and results oriented</li>\n<li>Excellent negotiation, presentation and closing skills</li>\n<li>Preferred experience with Git, Software Development Tools, Application Lifecycle Management</li>\n<li>You share our values, and work in accordance with those values.</li>\n<li>Ability to travel if needed and comply with the company’s travel policy</li>\n</ul>\n<p>Please note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from underrepresented groups are less likely to apply to a job unless they meet every single qualification. If you&#8217;re excited about this role, please apply and allow our recruiters to assess your application.</p>\n<p><strong>Country Hiring Guidelines: </strong>GitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.</p>",
        "url": "https://jobicy.com/jobs/116783-account-executive-mid-market-emerging-markets",
        "source": "Jobicy",
        "posted_at": "2025-04-08 15:35:04",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201207055737-109952.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Android Engineer",
        "company": "Life360",
        "location": "Canada,  USA",
        "description": "This role is for an Android Engineer within the Life360 team. This person will be an integral part of the core of our app as they will be required to become experts in technologies supporting our highly visible mapping, communication, driving &amp;amp; safety features. As a member of the team, it is expected that you&amp;#8230;",
        "html_description": "<p>This role is for an Android Engineer within the Life360 team. This person will be an integral part of the core of our app as they will be required to become experts in technologies supporting our highly visible mapping, communication, driving &amp; safety features. As a member of the team, it is expected that you will be highly involved in architecting, designing, and leading the development of the next generation of our systems and features.</p>\n<p><strong>Note: Please be aware that the job title for positions in Canada will be &#8220;Developer&#8221; in lieu of &#8220;Engineer.&#8221; </strong></p>\n<p>For candidates based in the US, the salary range for this position is 107,000 to 149,000 USD. For candidates based out of Canada, the salary range for this position is 125,500 to 140,000 CAD.</p>\n<p>We take into consideration an individual&#8217;s background and experience in determining final salary- therefore, base pay offered may vary considerably depending on geographic location, job-related knowledge, skills, and experience. The compensation package includes a wide range of medical, dental, vision, financial, and other benefits, as well as equity.</p>\n<h2>What You’ll Do</h2>\n<ul>\n<li>Work with a cross-functional team and collaborate closely with design, back-end engineering, marketing, data science, and product.</li>\n<li>Design and maintain robust frameworks for Android using tools such as Kotlin, Jetpack Compose, MVVM, or other relevant frameworks.</li>\n<li>Create foundational automation workflows that lead to better product quality and reliability.</li>\n<li>Opportunity to be on the leading edge of location experiences in a high-visibility team</li>\n<li>Roadmap innovative features to bring families closer together through contextual awareness, improved geolocation, and better communication</li>\n</ul>\n<h2>What We’re Looking For</h2>\n<ul>\n<li>Bachelor&#8217;s Degree or equivalent experience</li>\n<li>Strong debugging skills\n<ul>\n<li>Many problems in the sensor frameworks require understanding hard-to-pinpoint and non-reproducible problems.</li>\n<li>Identify and correct bottlenecks and fix bugs to improve application performance and responsiveness.</li>\n</ul>\n</li>\n<li>Problem-solving\n<ul>\n<li>We will be solving problems that do not have clear solutions with limited resources available online.</li>\n</ul>\n</li>\n<li>Architecture mindset\n<ul>\n<li>Will be spending equally as much time designing and prototyping as writing production code</li>\n<li>Strong understanding of software architecture principles and experience in making codebases more testable</li>\n</ul>\n</li>\n<li>Strong understanding of the Android ecosystem\n<ul>\n<li>Expert knowledge of Kotlin and familiarity with Android frameworks and APIs.</li>\n<li>Design, build, and maintain advanced applications for the Android platform with a focus on location-based services</li>\n</ul>\n</li>\n<li>Adaptable and able to pick up new concepts</li>\n<li>Drive to level up\n<ul>\n<li>Conduct code reviews and mentor junior engineers to promote best practices and improve code quality.</li>\n<li>Work closely with product managers, designers, and engineers to define, design, and ship new features and test strategies.</li>\n</ul>\n</li>\n<li>A Passion for quality\n<ul>\n<li>We want someone who will take the craftsmanship of their work seriously and strive to improve the areas they work in continually.</li>\n<li>Pioneer new test strategies via automation to enhance the reliability and efficiency of our testing processes.</li>\n<li>Proven experience in developing and implementing automated test strategies</li>\n</ul>\n</li>\n<li>Strong communication\n<ul>\n<li>Will communicate with multiple teams, including both systems and product teams</li>\n<li>At times, may need to communicate with external partners</li>\n</ul>\n</li>\n</ul>\n<h2>Bonus</h2>\n<ul>\n<li>Familiarity with location and other sensors</li>\n<li>Familiarity with background running tasks/services on Android</li>\n<li>Familiarity with networking and persistence technologies</li>\n<li>Familiarity with reactive programming, RxJava or combine</li>\n<li>Familiarity with developing highly polished user interfaces and animations</li>\n<li>Familiarity with all levels of automated testing</li>\n</ul>\n<h2>Our Benefits</h2>\n<ul>\n<li>Competitive pay and benefits.</li>\n<li>Medical, dental, vision, life and disability insurance plans (100% paid for US employees). We offer supplemental plans for medical and dental for Canadian employees.</li>\n<li>401(k) plan with company matching program in the US and RRSP with DPSP plan for Canadian employees.</li>\n<li>Employee Assistance Program (EAP) for mental wellness.</li>\n<li>Flexible PTO and 12 company wide days off throughout the year.</li>\n<li>Learning &amp; Development programs.</li>\n<li>Equipment, tools, and reimbursement support for a productive remote environment.</li>\n<li>Free Life360 Platinum Membership for your preferred circle.</li>\n</ul>\n<h2>Life360 Values</h2>\n<p>Our company’s mission-driven culture is guided by our shared values to create a trusted work environment where you can bring your authentic self to work and make a positive difference.</p>\n<ul>\n<li>Be a Good Person &#8211; We have a team of people with high integrity who you can trust.</li>\n<li>Be Direct With Respect &#8211; We communicate directly, even when it’s hard.</li>\n<li>Members Before Metrics &#8211; We focus on building an exceptional experience for families.</li>\n<li>High-Intensity High Impact &#8211; We do whatever it takes to get the job done.</li>\n</ul>\n<h2>Our Commitment to Diversity</h2>\n<p>We believe that different ideas, perspectives, and backgrounds create a stronger, more creative work environment that delivers better results. Together, we continue to build an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. It fuels our innovation and connects us closer to our customers and the communities we serve. We strive to create a workplace that reflects the communities we serve and where everyone feels empowered to bring their authentic best selves to work.</p>\n<p><em>We are an equal-opportunity employer and value diversity at Life360. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any legally protected status.  </em></p>\n<p><em>We encourage people of all backgrounds to apply. We believe that a diversity of perspectives and experiences creates a foundation for the best ideas. Come join us in building something meaningful. Even if you don’t meet 100% of the qualifications below, you should still seriously consider applying!</em></p>",
        "url": "https://jobicy.com/jobs/116777-android-engineer-5",
        "source": "Jobicy",
        "posted_at": "2025-04-08 10:34:10",
        "salary": "USD 107,000 - 149,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/f269bad3-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Fullstack Engineer",
        "company": "Oddball",
        "location": "USA",
        "description": "As a Service-Disabled Veteran-Owned Small Business (SDVOSB) civic technology agency, Wilcore Technologies is striving to transform the relationship between the people and government through accessible citizen-centered design and digital services. With our veteran-led team, we aim to revolutionize the digital landscape by crafting solutions that prioritize streamlined processes, anticipate user needs, and foster genuine connections&amp;#8230;.",
        "html_description": "<p>As a Service-Disabled Veteran-Owned Small Business (SDVOSB) civic technology agency, Wilcore Technologies is striving to transform the relationship between the people and government through accessible citizen-centered design and digital services. With our veteran-led team, we aim to revolutionize the digital landscape by crafting solutions that prioritize streamlined processes, anticipate user needs, and foster genuine connections. Working in tandem with Wilcore Technologies through our joint venture, we at Oddball, believe that we can make big changes happen and improve the daily lives of millions of people by bringing quality software to the federal space.</p>\n<p>We are hiring a <strong>Full Stack Engineer </strong> to work on a pivotal Federal program that is making a positive impact on millions of Americans&#8217; daily lives.</p>\n<h2><strong>What you&#8217;ll be doing</strong></h2>\n<p>We are hiring a Full Stack Engineer to join a modern and exciting program in the DoD Space Force program. Working hand in hand with other engineers in developing end-to-end testing solutions and API endpoints and services, day to day work will involve writing code, developing tests, and debugging.</p>\n<h2><strong>What you’ll bring</strong></h2>\n<ul>\n<li>3+ years of experience in PHP, Kotlin, Java, or Javascript.</li>\n<li>3+ years of experience with Spring Boot, React.JS, Vue or Redux.</li>\n<li>Experience in Test Driven Development (TDD) and agile methodologies.</li>\n<li>Strong communication skills and interest in a pair-programming environment.</li>\n<li>Experience using container technologies such as Docker or Kubernetes.</li>\n<li>Familiarity with DevSecOps tools and processes such as Git, Concourse, GitLabCI, SonarQube, Fortify, and ThreadFix.</li>\n<li>Demonstrated experience with API Development.</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<ul>\n<li>Must be a US Citizen and able to work domestically.</li>\n<li>Must possess or have the ability to obtain a secret clearance with the DoD.</li>\n</ul>\n<h2><strong>Education</strong></h2>\n<ul>\n<li>Bachelor’s Degree</li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Fully remote</li>\n<li>Annual stipend</li>\n<li>Comprehensive Benefits Package</li>\n<li>Company Match 401(k) plan</li>\n<li>Flexible PTO, Paid Holidays</li>\n</ul>\n<h2><strong>Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities</strong></h2>\n<p>Wilcore is an Equal Opportunity Employer and does not discriminate against applicants based on race, religion, color, disability, medical condition, legally protected genetic information, national origin, gender, sexual orientation, marital status, gender identity or expression, sex (including pregnancy, childbirth or related medical conditions), age, veteran status or other legally protected characteristics. Any applicant with a mental or physical disability who requires an accommodation during the application process should contact an Oddball HR representative to request such an accommodation by emailing hr[at]wilcore.io.</p>\n<p>The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)</p>\n<h2><strong>Compensation</strong></h2>\n<p>At Wilcore, it’s important each employee is compensated competitively and fairly. In alignment with state legal requirements. A range for the included position is listed below. Be advised, actual offer details are determined by job category, job location, and candidate skill level.</p>\n<p>United States Wage Range: $120,000 – $160,000</p>\n<p><em>This role reports to the team at Wilcore Technologies, a joint venture created by Oddball.</em></p>",
        "url": "https://jobicy.com/jobs/116110-fullstack-engineer-3",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:40:33",
        "salary": "USD 120,000 - 160,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/8c034287ffd7b6474f90645b1c72e60a.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Business Development Representative",
        "company": "PerfectServe",
        "location": "USA",
        "description": "If you are looking for an entry-level sales opportunity in healthcare technology with one of the fastest-growing private SaaS companies in North America, PerfectServe is the place for you. This opportunity will provide you with a solid foundation and jump-start your career in sales. When you join our team, you will receive comprehensive sales and healthcare&amp;#8230;",
        "html_description": "<p>If you are looking for an entry-level sales opportunity in healthcare technology with one of the fastest-growing private SaaS companies in North America, PerfectServe is the place for you. This opportunity will provide you with a solid foundation and jump-start your career in sales. When you join our team, you will receive comprehensive sales and healthcare training covering the latest sales technology, career planning, and mentoring by seasoned sales professionals.</p>\n<p>Serving the healthcare industry for over 20 years, PerfectServe is a leader in secure clinical communications, optimized physician scheduling, and patient and family engagement. Our array of SAAS (software-as-a-service) products are utilized by hospitals and medical practices across the country. Our mission is to improve the patient experience and drive positive outcomes in care delivery settings using innovative technology solutions.</p>\n<p>The Business Development Representative (BDR) team’s primary goal is to build our sales funnel with sales qualified leads. You will work closely with sales to identify strategic prospecting targets and execute outreach campaigns. This role offers a competitive base salary plus uncapped commission.</p>\n<h2><strong>Main responsibilities</strong></h2>\n<ul>\n<li>Increase sales by identifying, creating, and passing new qualified leads to designated sales representative.</li>\n<li>Implement best practices for marketing campaigns through creativity and problem solving.</li>\n<li>Execute outreach campaigns using phone, email, and social mediums.</li>\n<li>Acquire and set up new meetings with target clients through prospecting.</li>\n<li>Collaborate with key decision makers to initiate the start of internal sales cycle.</li>\n<li>Seek to understand patient flow issues, provider frustrations, and overall health system objectives.</li>\n<li>Adapt PerfectServe strategy as needed to meet client needs.</li>\n<li>Keep an accurate and up-to-date log of all prospect interactions in the SalesForce CRM.</li>\n<li>Research and implement strategies to increase market share.</li>\n<li>Maintain a strong knowledge of all PerfectServe products.</li>\n<li>Meet and exceed monthly sales targets.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>Motivated, competitive, and hardworking with a desire to grow in sales.</li>\n<li>Ability to create a great first impression and provide a PerfectServe experience.</li>\n<li>Salesforce experience preferred, not required.</li>\n<li>Possess excellent communication skills and demonstrate professional etiquette in all forms of communication.</li>\n<li>Not afraid of the phone or hearing ‘no thanks.’</li>\n<li>Pleasantly persistent and able to get to ‘yes’ in a sales conversation.</li>\n<li>Ambitious and open to coaching and new ideas.</li>\n<li>Energized by a fast-paced environment.</li>\n<li>Embody PerfectServe&#8217;s core values: collaboration, purpose, innovation, service, integrity, inclusion.</li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Remote first work environment</li>\n<li>Health, Dental, Vision, Life and Disability Insurance options available day one.</li>\n<li>401K &#8211; with match and immediately vested.</li>\n<li>17 company holidays, 2 floating holidays plus competitive paid time off policy</li>\n<li>Internal Advancement Opportunities</li>\n</ul>\n<p>PerfectServe offers unified healthcare communication solutions to help physicians, nurses, and care team members provide exceptional patient care. PerfectServe’s cloud-based solutions enhance patient safety and reduce provider burnout by automating workflows, speeding time to treatment, optimizing shift schedules, empowering nurse mobility, and engaging patients in their own care.</p>",
        "url": "https://jobicy.com/jobs/115402-tier-1-support-specialist-3",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:37:57",
        "salary": "",
        "job_type": "full-time",
        "category": "Business Development",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/04/7e6f5669fc8c9ea0aa484ce7c3058599.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Business Analyst",
        "company": "Designit",
        "location": "LATAM,  Canada,  USA",
        "description": "Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who care! We are analysts. Creators. Designers. Doers. Dreamers. Explorers. Geeks. Hipsters. Leaders. Learners. Renegades. Seekers. Strategists. Visionaries. And we fundamentally believe that we’re better together. We are looking for a Business Intelligence Analyst to&amp;#8230;",
        "html_description": "<p>Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who care!</p>\n<p>We are analysts. Creators. Designers. Doers. Dreamers. Explorers. Geeks. Hipsters. Leaders. Learners. Renegades. Seekers. Strategists. Visionaries. And we fundamentally believe that we’re better together.</p>\n<p>We are looking for a Business Intelligence Analyst to join our enterprise tech client’s design team.</p>\n<h2>Would you like to:</h2>\n<ul>\n<li>Works with key stakeholders across functions (Acquisition Marketing Lead, Consumer Go-To-Market, Global Media, Finance, Data Science) to provide digital marketing analytics and business intelligence to further business strategies in mobile acquisition.</li>\n<li>Prepares campaign analytics and return-on-investment analyses to aid in decisions on campaign and media costing optimization.</li>\n<li>Develop standardized metrics and analyze forecasts to evaluate and benchmark short- and long-term planning that will help shape effective strategies to better meet customer needs.</li>\n<li>Demonstrates an informed knowledge of marketing and business functions to resolve problems and suggest optimization opportunities.</li>\n<li>Supports one or more highly complex business processes.</li>\n<li>Serves as a liaison between the business, Data Science, and Media agencies in order to facilitate technical and analytical solutions to meet business and data needs.</li>\n<li>Develop and execute strategies to optimize processes, enhance operational efficiency, and drive business outcomes.</li>\n<li>Build strong relationships with stakeholders to understand strategic business needs and provide effective solutions.</li>\n<li>Manage budget hygiene activities including meeting with budget owners, managing purchase orders, expense reports, and tracking invoicing.</li>\n<li>Collaborate cross-functionally to identify opportunities for improvement and implement innovative solutions.</li>\n<li>Implement rhythm of business practices and lead data analytics initiatives to drive actionable insights and informed decision-making.</li>\n<li>Manage program resources effectively, ensuring alignment with strategic priorities and maximizing value delivery.</li>\n<li>Establish key performance indicators and develop regular reporting mechanisms to track program performance and provide insights to stakeholders</li>\n</ul>\n<h2>We would like you to have:</h2>\n<ul>\n<li>5-7+ years’ experience required.</li>\n<li>5-7+ years’ experience with mobile analytic experience &#8211; ideally in consumer media</li>\n<li>Basic knowledge of programming languages to comprehend reading code and basic functions.</li>\n<li>Ability to create business solutions that increase competitive advantage.</li>\n<li>Enterprise experience preferred</li>\n<li>Technology industry experience preferred</li>\n<li>Ability to exercise good judgment in selecting methods and techniques for obtaining solutions.</li>\n<li>Project management skills in order to handle diverse projects, often times simultaneously, and meet aggressive deadlines.</li>\n<li>Ability to solve technical problems/ processes and understand complex details.</li>\n<li>Ability to increase operating efficiency with produce high quality technical solutions.</li>\n<li>A high level of interpersonal and verbal communication skills necessary to relate to other people at their systems knowledge level.</li>\n<li>Ability to analyze complex situations and problems and do the necessary research using multiple sources of information to arrive at innovative solutions.</li>\n<li>Bachelor&#8217;s degree in a technical field such as computer science, computer engineering or related field required. MBA or other related advanced degree preferred.</li>\n</ul>\n<h2>Would you like to work for an organization that:</h2>\n<ul>\n<li>Embraces work-life balance – our employees’ well-being remains a top priority for us</li>\n<li>Promotes a culture of learning and advocacy across the globe &#8211; diversity will enable us to strengthen our impact</li>\n<li>Offers a comprehensive benefits package effective Day 1. Options include health, vision, &amp; dental insurance, FSAs, discounts on pet insurance, PTO, paid holidays, and more</li>\n<li>Encourages innovation and experimentation</li>\n<li>Emphasizes and rewards collaboration</li>\n<li>Works remotely. We continue to safeguard the health of our employees so our interviewing and on-boarding process will remain virtual until further notice</li>\n</ul>\n<p>Compensation Range: $40/hr &#8211; $55/hr.</p>\n<p>This compensation range is indicative of the role. Compensation offered is on the basis of evaluation during the interview process, the candidates range and depth of experience, business and market financials and internal pay parity.</p>",
        "url": "https://jobicy.com/jobs/111303-business-analyst-4",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:33:59",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/0802726040e35f2f86749890d2cbb6ba.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Senior Data Analyst",
        "company": "Target",
        "location": "USA",
        "description": "A role within Marketing Analytics and Insights means being a part of the team that enables faster, smarter and more scalable decision-making to compete and win the modern retail market. Here, you’ll leverage data, statistics and visualization to create the actionable insights that deliver value across all Target functions. Our savvy reporting and analytics pros&amp;#8230;",
        "html_description": "<p>A role within Marketing Analytics and Insights means being a part of the team that enables faster, smarter and more scalable decision-making to compete and win the modern retail market. Here, you’ll leverage data, statistics and visualization to create the actionable insights that deliver value across all Target functions. Our savvy reporting and analytics pros use market-leading tools and data automation to make a positive impact that’s felt across the business. If you’re an analyst who can work on autonomous teams, integrate the latest practices with your approach, write code to handle massive scale, simplify complex decisions by providing flexible, fast and sustainable decision-making solutions, then you’ll be successful here.</p>\n<p>The Loyalty Analytics team is committed to driving growth and change through data-driven insights. Our team is pushing for innovation and leveraging analytics to shape the future of Target. We are looking for a Senior Data Analyst who is passionate about data and eager to make a significant impact.</p>\n<p>The Senior Data Analyst plays a crucial role in our analytics team, providing deep insights and strategic recommendations to drive business growth. This position requires a highly analytical individual with strong problem-solving skills and the ability to work collaboratively with cross-functional teams.</p>\n<h2><b>Key Responsibilities:</b></h2>\n<ul>\n<li>Analyze complex data sets to identify trends, patterns, and insights that can drive business decisions.</li>\n<li>Develop and maintain dashboards and reports to monitor key performance indicators (KPIs).</li>\n<li>Collaborate with stakeholders to understand their analytical and reporting needs and provide actionable insights through the resulting work.</li>\n<li>Conduct ad-hoc analyses to support business initiatives and solve business problems.</li>\n<li>Present findings and recommendations to key leaders and other stakeholders.</li>\n<li>Mentor and guide junior analysts in best practices and advanced analytical techniques.</li>\n</ul>\n<p>Core responsibilities of this job are described within this job description. Job duties may change at any time due to business needs.</p>\n<h2><b>About you: </b></h2>\n<ul>\n<li>Four-year degree in a technical field (Statistics, Mathematics or a related field) or equivalent experience</li>\n<li>Advanced technical degree a plus</li>\n<li>3+ years in quantitative data analysis, with strong industry performance</li>\n<li>5+ years experience preferred</li>\n<li>Demonstrated problem solving and analytical skills, with a curious mindset and strong attention to detail</li>\n<li>Robust data mining and data creation ability</li>\n<li>Ability to support conclusions and recommendations through a clear, understandable story that leverages insight drawn from descriptive statistics, basic inferential statistics, and data visualizations</li>\n<li>Strong communication skills with the ability to speak to both business and technical teams</li>\n<li>Strong understanding of statistical methods and techniques</li>\n<li>Proven ability to work collaboratively in a team environment</li>\n<li>Proficiency in analytical and data visualization tools including: SQL, Hadoop, Hive, Spark, Python, R, Power BI, Tableau and/or equivalent technologies\n<ul>\n<li>Advanced SQL experience writing complex queries</li>\n<li>Intermediately accomplished with Python or R</li>\n</ul>\n</li>\n</ul>\n<p>The pay range is $87,000.00 &#8211; $156,000.00</p>\n<p>Pay is based on several factors which vary based on position. These include labor markets and in some instances may include education, work experience and certifications. In addition to your pay, Target cares about and invests in you as a team member, so that you can take care of yourself and your family. Target offers eligible team members and their dependents comprehensive health benefits and programs, which may include medical, vision, dental, life insurance and more, to help you and your family take care of your whole selves. Other benefits for eligible team members include 401(k), employee discount, short term disability, long term disability, paid sick leave, paid national holidays, and paid vacation.</p>\n<p>This position may be considered for a Remote or Hybrid (known internally at Target as &#8220;Flex for Your Day&#8221;) work arrangement based on Target&#8217;s needs.  A Remote work arrangement means the team member works full-time from home or an alternate location that&#8217;s not a Target location, does not have a desk at a Target location and may travel to HQ up to 4 times a year.  A Hybrid/Flex for Your Day work arrangement means the team member&#8217;s core role may be performed either remote or onsite at a Target location depending upon what your role, team and tasks require for that day. Work duties cannot be performed outside of the country of the primary work location, unless otherwise prescribed by Target.</p>",
        "url": "https://jobicy.com/jobs/116773-senior-data-analyst-5",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:32:28",
        "salary": "USD 87,000 - 156,000",
        "job_type": "full-time",
        "category": "Data Science &amp; Analytics",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/c41a31890959544c6523af684561abe5.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Privacy and Data Protection Manager",
        "company": "1Password",
        "location": "Canada,  USA",
        "description": "As the Privacy and Data Protection Program Manager you will be responsible for supporting the company’s global privacy and data protection programs. This role will ensure that 1Password complies with international, federal, and local data protection regulations, including the GDPR, PIPEDA, CCPA, and other relevant data privacy laws. The ideal candidate will be adept at&amp;#8230;",
        "html_description": "<p>As the Privacy and Data Protection Program Manager you will be responsible for supporting the company’s global privacy and data protection programs. This role will ensure that 1Password complies with international, federal, and local data protection regulations, including the GDPR, PIPEDA, CCPA, and other relevant data privacy laws. The ideal candidate will be adept at legal research, compliance monitoring, and providing guidance on privacy-related matters. They will work closely with various internal teams, such as IT, HR, Marketing, and Operations, to implement and maintain effective data protection practices.</p>\n<p>This role reports to the Senior Director of Privacy.</p>\n<p>This is a remote opportunity within Canada and the US.</p>\n<h2>What we&#8217;re looking for</h2>\n<ul>\n<li>Bachelor&#8217;s degree in Business, Legal Studies, or a related field; Juris Doctor from an accredited law school preferred.</li>\n<li>Experience working with privacy regulations such as GDPR, PIPEDA, CCPA/CPRA, and other regional or industry-specific privacy laws.</li>\n<li>2-5 years of experience in a legal, compliance, privacy role, preferably in a company serving customers globally.</li>\n<li>Experience conducting privacy impact assessments, audits, or compliance monitoring.</li>\n<li>Strong attention to detail and ability to handle confidential information with discretion.</li>\n<li>Excellent written and verbal communication skills, with the ability to explain complex legal concepts to non-legal stakeholders.</li>\n<li>Problem-solving mindset and ability to work independently, as well as collaboratively within cross-functional teams.</li>\n<li>Strong organizational skills and ability to manage multiple tasks simultaneously in a fast-paced environment.</li>\n<li>Proficiency in legal research and privacy management tools.</li>\n<li>Strong understanding of data protection technologies and information security principles (e.g., encryption, pseudonymization, access controls).</li>\n<li>Familiarity with IT systems, databases, and data flow mapping.</li>\n</ul>\n<h2><b>Bonus points for</b></h2>\n<ul>\n<li>Ability to work with international teams and understand cross-border data transfer rules</li>\n<li>Work experience in Privacy, Data Protection, Compliance, or a related field</li>\n<li>Privacy certification (e.g., Certified Information Privacy Professional (CIPP/C CIPP/US or CIPP/EU)</li>\n</ul>\n<h2>What you can expect</h2>\n<p><b>Legal Research &amp; Analysis</b></p>\n<ul>\n<li>Support research efforts on privacy-related legal developments, regulatory changes, and enforcement trends.</li>\n<li>Help analyze how changes in privacy laws may affect 1Password’s business operations.</li>\n<li>Collaborate with the commercial legal team in drafting and reviewing privacy-related agreements, including data processing agreements (DPAs) and vendor contracts.</li>\n<li>Monitor updates in data privacy laws and regulations and share insights with internal teams.</li>\n<li>Assist in developing and implementing internal privacy policies and procedures that align with legal requirements and industry standards.</li>\n</ul>\n<p><b>Incident Management</b></p>\n<ul>\n<li>Help maintain accurate records of incidents and support compliance with the 1Password’s incident response plan.</li>\n<li>Assist in preparing data breach notifications for regulatory authorities and impacted individuals, as required.</li>\n</ul>\n<p><b>Vendor Management</b></p>\n<ul>\n<li>Review and assess third-party service providers’ privacy practices to ensure alignment with the 1Password’s data protection standards.</li>\n<li>Advise on due diligence processes for onboarding new vendors, partners or customers, ensuring compliance with contractual and legal obligations.</li>\n<li>Support the management and organization of vendor data processing agreements and related documents.</li>\n</ul>\n<p>USA-based roles only: The annual base salary for this role is between $105,000 USD and $143,000 USD, plus immediate participation in 1Password&#8217;s benefits program (health, dental, 401k and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</p>\n<p>Canada-based roles only: The annual base salary for this role is between $94,000 CAD and $128,000 CAD, plus immediate participation in 1Password’s generous benefits program (health, dental, RRSP and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</p>\n<p>At 1Password, we approach each individual&#8217;s compensation with a promise of fair market value and internal equity commensurate with experience and specific skill set.</p>\n<p>We believe in the power of remote work, but we also recognize that in-person connection is sometimes important to help us achieve our mission. While we are a remote-first company, occasional travel for in-person engagement will be a part of this role. Frequency will depend on role and responsibilities, and may include, but is not limited to, annual department-wide offsites, team meetings, and customer/industry events. These events will typically be held in varying locations across Canada and the US.</p>\n<h2><b>What we offer</b></h2>\n<p>We believe in working hard, and resting hard. We’re always looking for new ways to support our team members, but here’s a glance at what we currently offer:</p>\n<p><b>Health and wellbeing</b></p>\n<p>&gt;  Maternity and parental leave top-up programs</p>\n<p>&gt;  Wellness spending account</p>\n<p>&gt;  Generous PTO policy</p>\n<p>&gt;  Company-wide wellness days off scheduled throughout the year</p>\n<p>&gt;  Wellness Coach membership</p>\n<p>&gt;  Comprehensive health coverage</p>\n<p><b> Growth and future </b></p>\n<p>&gt;  Employee stock option program for all full-time employees</p>\n<p>&gt;  Retirement matching program</p>\n<p>&gt;  Training budget, 1Password University access, and learning sessions</p>\n<p>&gt;  Free 1Password account (and friends and family discount!)</p>\n<p><b>Flexibility and community</b></p>\n<p>&gt;  Paid volunteer days</p>\n<p>&gt;  Employee-led DEIB programs and ERGs and ECGs</p>\n<p>&gt;  Fully remote environment</p>\n<p>&gt;  Peer-to-peer recognition through Bonusly</p>\n<p><b>You belong here. </b></p>\n<p><i>1Password is proud to be an equal opportunity employer. We are committed to fostering an inclusive, diverse and equitable workplace that is built on trust, support and respect. We welcome all individuals and do not discriminate on the basis of gender identity and expression, race, ethnicity, disability, sexual orientation, colour, religion, creed, gender, national origin, age, marital status, pregnancy, sex, citizenship, education, languages spoken or veteran status. Be yourself, find your people and share the things you love. </i></p>\n<p><i>Accommodation is available upon request at any point during our recruitment process. If you require an accommodation, please speak to your talent acquisition partner or email us at nextbit@agilebits.com and we’ll work to meet your needs. </i></p>\n<p><i>Remote work is a part of our DNA. Given that our company was founded remotely in 2005, we can safely say we&#8217;re experts at building remote culture. That said, remote work at 1Password does mean working from your home country. If you&#8217;ve got questions or concerns about this, your talent partner would be happy to address them with you.</i></p>\n<p><i>Successful applicants will be required to complete a background check that may consist of prior employment verification, reference checks, education confirmation, criminal background, publicly available social media, credit history, or other information, as permitted by local law.</i></p>",
        "url": "https://jobicy.com/jobs/114595-privacy-and-data-protection-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:30:59",
        "salary": "USD 105,000 - 143,000",
        "job_type": "full-time",
        "category": "Legal &amp; Compliance",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200909195848-296323.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "WordPress Developer",
        "company": "Awesome Motive",
        "location": "Anywhere",
        "description": "As a WordPress Developer, you&amp;#8217;re responsible for Making Stuff Go. You will build infrastructure to create new features, improve existing code, squash bugs, and help us rapidly scale our platform. To love this role, here’s the type of person you are: You’re a self-starter who loves taking initiative and seeing things through from conception to&amp;#8230;",
        "html_description": "<p>As a WordPress Developer, you&#8217;re responsible for Making Stuff Go. You will build infrastructure to create new features, improve existing code, squash bugs, and help us rapidly scale our platform.</p>\n<h2>To love this role, here’s the type of person you are:</h2>\n<ul>\n<li>You’re a self-starter who loves taking initiative and seeing things through from conception to completion. Our developers often &#8220;own&#8221; features/tasks and are responsible for scoping, development, and testing.</li>\n<li>You&#8217;re an excellent communicator, fluent in both verbal and written English, who makes sure nothing slips through the cracks. We believe communication is critical and there is no such thing as over communicating.</li>\n<li>You have the curiosity and desire to learn and grow your skills.</li>\n<li>You&#8217;re passionate about leaving your mark on the web for all to see and are excited to work on tasks that impact <em>millions</em> of users.</li>\n<li>You take pride in the quality and craftsmanship of your work rather than just doing it to get it done.</li>\n<li>You&#8217;re a team player who is comfortable working along side and helping other developers, and you don&#8217;t take critical feedback personally.</li>\n<li>You&#8217;re happy jumping between front-end and back-end development tasks, or tackling tasks which require both.</li>\n<li>You&#8217;re happy working on tasks of all sizes &#8211; from small bug fixes and enhancements to large features/rewrites.</li>\n</ul>\n<h2>Common responsibilities include (but are not limited to):</h2>\n<ul>\n<li>Triaging bugs and small enhancements that come into GitHub.</li>\n<li>Scoping, writing, and testing new product features and addons.</li>\n<li>Refactoring legacy code with a particular attention to backwards compatibility.</li>\n<li>Providing feedback and peer review for other developers (Github PRs).</li>\n<li>Communicating with the team and supporting your peers using chat, audio, and video.</li>\n</ul>\n<h2>Requirements:</h2>\n<ul>\n<li>Professional experience with WordPress plugin development, architecture, and standards.</li>\n<li>Advanced proficiency with PHP and MySQL, including modern PHP practices (OOP, autoloading, namespacing, traits, interfaces, etc).</li>\n<li>Strong familiarity with JavaScript (vanilla JS, jQuery, ES6, etc).</li>\n<li>Ability to use and extend build tools like gulp and webpack.</li>\n<li>Familiarity with package managers such as Composer and NPM.</li>\n<li>Experience working with third-party APIs (Eg Stripe, Drip, Zapier, etc).</li>\n<li>Competent with version control through git and GitHub.</li>\n<li>The ability to iterate and ship ideas quickly.</li>\n<li>Exceptional troubleshooting skills.</li>\n<li>Ability to keep complex ideas and features <em>simple</em>. (Simplicity is a core value!)</li>\n<li>Previous freelance or remote work experience.</li>\n<li>Personal Computer with Internet Access</li>\n<li>Availability to participate in audio/video meetings between the hours 9 am &#8211; 5 pm EST.</li>\n</ul>\n<h2><strong>Bonus points if you also have:</strong></h2>\n<ul>\n<li>Advanced proficiency in JavaScript frameworks like VueJS or React.</li>\n<li>Experience with e-commerce platforms or related APIs (Easy Digital Downloads, WooCommerce, Stripe, PayPal, etc).</li>\n<li>Experience with DevOps or infrastructure management.</li>\n</ul>\n<h2>Benefits:</h2>\n<p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.</p>\n<ul>\n<li>Competitive Salary.</li>\n<li>Term Life Insurance and Accidental Death &amp; Dismemberment for all full-time team members during their employment.</li>\n<li>Health, Dental, and Vision Insurance benefits for full-time U.S. employees.</li>\n<li>Health Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain &amp; Jamaica.</li>\n<li>Work from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.</li>\n<li>Flexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.</li>\n<li>Holidays (based on your location)</li>\n<li>Paid maternity and paternity leave.</li>\n<li>We happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.</li>\n<li>We cover all costs of company travel (including our annual all-company retreat and mini-team meetups).</li>\n<li>Additional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.</li>\n<li>We give you the opportunity to solve challenging and meaningful problems that make a difference.</li>\n<li>Ability to work with some of the best people in the business through frequent, if not daily, interactions.</li>\n<li>And in case you were wondering: no politics, no b.s., and no jerks.</li>\n</ul>\n<h2><strong>Location:</strong></h2>\n<p>This is a remote position &#8211; our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am &#8211; 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.</p>\n<h2><strong>Inclusion Statement:</strong></h2>\n<p>At Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.</p>\n<h2><strong>How to apply?</strong></h2>\n<p>If all of this sounds interesting, then please submit your application!</p>\n<h2><strong>Please clearly include the following in your cover letter:</strong></h2>\n<ul>\n<li>Your experience with WordPress plugin development.</li>\n<li>What is your favorite WordPress hook/function and why.</li>\n<li>Tell us a bit about yourself and why you should be considered. Details about your experience, qualifications, personality, etc are very helpful.</li>\n<li>Profile links with code samples (GitHub, GitLab, WordPress.org, etc).</li>\n<li>Other profile links if available (Your website, Twitter, LinkedIn, etc).</li>\n</ul>\n<p>Also note, don&#8217;t forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out </p>\n<p>We won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly.</p>",
        "url": "https://jobicy.com/jobs/9045-wordpress-developer-php-js",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:29:12",
        "salary": "",
        "job_type": "full-time",
        "category": "Programming",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b8e354b088bd65fd9f299af4f4bc1706.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Front End Engineer",
        "company": "Peerspace",
        "location": "USA",
        "description": "As a Front-End Engineer, you will play a key role in shaping the user experience of our platform, ensuring our front-end applications are modern, performant, and scalable. You will work closely with designers, product managers, and backend engineers to develop high-quality, reusable components and features while helping improve our front-end architecture. As a senior team&amp;#8230;",
        "html_description": "<p>As a Front-End Engineer, you will play a key role in shaping the user experience of our platform, ensuring our front-end applications are modern, performant, and scalable. You will work closely with designers, product managers, and backend engineers to develop high-quality, reusable components and features while helping improve our front-end architecture. As a senior team member, you will contribute to technical decisions, mentor junior engineers, and advocate for best practices in front-end development.</p>\n<h2><b>Qualifications:</b></h2>\n<p>You are a great fit for this role if you have:</p>\n<p><b>Experience</b>: 3-5 years in front-end development, with significant experience building modern web applications.</p>\n<p><b>Technical Expertise</b>:</p>\n<ul>\n<li>Strong proficiency in React (or similar modern front-end frameworks).</li>\n<li>Experience with Next.js, server-side rendering (SSR), and static site generation (SSG).</li>\n<li>Deep understanding of CSS, responsive design, and component-driven architecture.</li>\n<li>Strong knowledge of state management solutions (e.g., Redux, React Context).</li>\n<li>Experience integrating with APIs and backend services in a services-based architecture.</li>\n</ul>\n<p><b>Code Quality &amp; Performance</b>:</p>\n<ul>\n<li>Experience building accessible (a11y-compliant), high-performance web applications.</li>\n<li>Familiarity with front-end testing frameworks and CI/CD pipelines.</li>\n<li>Strong debugging and troubleshooting skills.</li>\n</ul>\n<p><b>Collaboration &amp; Leadership</b>:</p>\n<ul>\n<li>Ability to work cross-functionally with Product, Design, and Backend teams.</li>\n<li>Experience mentoring junior engineers and contributing to technical decision-making.</li>\n<li>Strong communication skills and ability to advocate for front-end best practices.</li>\n</ul>\n<h2><b>Responsibilities:</b></h2>\n<p>In this role, you will be responsible for:</p>\n<ul>\n<li><b>Develop &amp; Maintain Features</b>: Build scalable, maintainable front-end applications using modern frameworks and tools.</li>\n<li><b>Improve Front-end Architecture</b>: Contribute to technical decisions on architecture, performance optimization, and front-end best practices.</li>\n<li><b>Enhance Developer Experience</b>: Help refine our design system, component libraries, and development workflows.</li>\n<li><b>Mentor &amp; Lead</b>: Provide guidance and mentorship to junior developers, reviewing code and sharing knowledge.</li>\n<li><b>Ensure Quality &amp; Performance</b>: Write clean, well-tested code, optimizing for performance, accessibility, and SEO.</li>\n<li><b>Collaborate Across Teams</b>: Work closely with designers, product managers, and backend engineers to deliver high-quality user experiences.</li>\n</ul>\n<h2>Why Peerspace?</h2>\n<p>Peerspace is proudly certified as a Great Place to Work™ and we&#8217;re a remote first company with team members located in cities around the globe. Beyond competitive salary and equity compensation, we provide:</p>\n<ul>\n<li>100% employee coverage of medical, dental and vision insurance</li>\n<li>$500 annual professional development allowance</li>\n<li>Discount on all Peerspace bookings</li>\n<li>Laptop, high res display, and stipend to setup home office</li>\n<li>Monthly cell phone and internet credit</li>\n<li>Coworking membership if needed (in lieu of home office)</li>\n<li>Flexible take it as you need it time off policy</li>\n<li>Wellness Fridays observed company wide</li>\n<li>Annual in-person, all company offsites and team-building events</li>\n</ul>\n<p>The annual salary range for this role is $130,000 to $150,000. The actual salary will vary depending on experience, skills, and abilities as well as internal equity and market data.</p>\n<h2>Diversity</h2>\n<p>At Peerspace, we&#8217;re dedicated to creating a team that&#8217;s diverse, equitable and inclusive. We believe bringing people together from different backgrounds and identities makes us stronger and better serves the Peerspace community. We&#8217;d especially like to encourage applicants from different backgrounds, locations, and experiences.</p>",
        "url": "https://jobicy.com/jobs/116770-front-end-engineer-3",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:04:28",
        "salary": "USD 130,000 - 150,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/423c8cd867be08cf39987fcd193debe6.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Product Manager",
        "company": "Upwork",
        "location": "USA",
        "description": "As we continue to grow, we are seeking a Product Manager to join our Enterprise product team, reporting to Enterprise Product leadership. The role involves working with top global companies in a dynamic and expanding field, addressing complex challenges as Upwork explores new ways of working with Enterprise companies. Your Responsibilities Prioritize solving problems for&amp;#8230;",
        "html_description": "<p>As we continue to grow, we are seeking a Product Manager to join our Enterprise product team, reporting to Enterprise Product leadership. The role involves working with top global companies in a dynamic and expanding field, addressing complex challenges as Upwork explores new ways of working with Enterprise companies.</p>\n<h2>Your Responsibilities</h2>\n<ul>\n<li>Prioritize solving problems for customers (enterprise clients, talent, internal teams), not building features for the sake of building. In other words, don’t just ‘default’ to pushing for new features and functionality; evaluate build vs. buy vs. partner first to identify and implement scalable, high-impact solutions for customers, ensuring alignment with Upwork’s strategic goals of scaling Upworks Enterprise business.</li>\n<li>Take full cycle ownership of your work from ideation on bold, new solutions, design, review and feedback in the final test build and after release, and be proactive &amp; curious throughout the process.</li>\n<li>Prioritize speed and creating an impact over perfection.</li>\n<li>Be passionate about doing product work, not just managing/maintaining the existing platform.</li>\n<li>Focus on creating new solutions based on enterprise client needs. Identify client problems proactively, define high-impact solutions, and drive implementation of new solutions to achieve product-market fit.</li>\n</ul>\n<h2>What it takes to catch our eye</h2>\n<ul>\n<li>4+ years of product management experience in a fast-paced environment (ideally scaleup/start-up). Experience in the HRTech space is a nice-to-have, not a must-have</li>\n<li>Experience with products that are consumption-driven, not just SaaS. Ideally, experience at a company that is a tech-enabled services company. Preferably, at a company that is selling to enterprise customers; experience with ‘enterprise-grade use cases (complex, diverse, high volume).</li>\n<li>A good grasp of technical concepts relevant to the product. Technical background is a plus.</li>\n<li>Excellent communication and collaboration skills, with a demonstrated ability to work effectively with cross-functional teams, while driving results.</li>\n<li>Passionate about creating delightful experiences for both the end-user and our teams.</li>\n<li>Comfortable with ambiguity and being pro-active</li>\n<li>Invested in creating real impact, not just incremental improvements.</li>\n<li>Major plus: used / experimented / done work with LLMs and “post chat GPT AI” and able to leverage that experience when creating new and innovative solutions.</li>\n</ul>\n<p><i>The annual base salary for this position in California and Washington ranges from $124,000 &#8211; $185,000. The range displayed reflects the minimum and maximum salary for this position in California and Washington, and individual base pay will depend on your skills, qualifications, experience, and location. Additionally, this position is eligible for the annual bonus plan or sales incentive plan and eligibility to participate in our long term equity incentive program.</i></p>\n<h2>Come change how the world works</h2>\n<p>At Upwork, you&#8217;ll shape talent solutions for how the world works today. We are a remote-first organization working together to create exciting remote work opportunities for a global community of professionals. While we have physical offices in San Francisco and Chicago, currently we also hire full-time employees in 19 states in the United States.</p>\n<p>Our vibrant culture is built on shared values and our mission to create economic opportunities so that people have better lives. We foster amazing teams, put our community first, and have a bias toward action. We encourage everyone to bring their whole selves to work and grow together through development opportunities, mentorship, and employee resource groups. And oh yeah, we&#8217;ve also got amazing benefits &#8211; including medical insurance for you and your family, unlimited PTO, 401(k) with matching, 12 weeks of paid parental leave, and a generous Employee Stock Purchase Plan. Check out our Life at Upwork page to learn more about our benefits and the employee experience.</p>\n<p>Upwork is proudly committed to recruiting and retaining a diverse and inclusive workforce. As an Equal Opportunity Employer, we never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>\n<p><em>The annual base salary range for this position  is displayed below. The range displayed reflects the minimum and maximum salary for this position, and individual base pay will depend on your skills, qualifications, experience, and location. Additionally, this position is eligible for the annual bonus plan or sales incentive plan and eligibility to participate in our long term equity incentive program.</em></p>\n<p>Annual Base Compensation $136,250<!-- --> &#8211; <!-- -->$194,000<!-- --> <!-- -->USD</p>",
        "url": "https://jobicy.com/jobs/116111-product-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-08 04:00:16",
        "salary": "USD 136,250 - 194,000",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/upwork.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Sr. Solutions Consultant",
        "company": "Zendesk",
        "location": "USA",
        "description": "The Senior Solutions Consultant is responsible for all technical, solution, and competitive aspects of the Zendesk sales cycle. SC’s must be both sales focused and technically savvy. They must be successful selling to Enterprise and Mid Market executives, and convincing C-level and director level executives of the technical merits of the software solution. The SC&amp;#8230;",
        "html_description": "<p>The Senior Solutions Consultant is responsible for all technical, solution, and competitive aspects of the Zendesk sales cycle. SC’s must be both sales focused and technically savvy. They must be successful selling to Enterprise and Mid Market executives, and convincing C-level and director level executives of the technical merits of the software solution. The SC will work, in conjunction with Sales, Marketing, and Product Managers, to be the technical bridge between our Sales Representatives and their prospects. The SC will take ownership of the prime technical relationship with our prospects to drive customer happiness by proactively managing and delivering technical information to our customers both onsite, online, and via telephone.</p>\n<h2><b>What you bring to the role:</b></h2>\n<ul>\n<li>5+ years of Mid Market/Enterprise software selling experience.</li>\n<li>Experience mapping RFI/RFP requirements to software solutions.</li>\n<li>Excellent interpersonal, communication, persuasion, presentation and writing skills.</li>\n<li>Call Center Experience is Desired (and a huge plus!)</li>\n<li>Experience scoping, managing and executing customer pilots and Proof of Concepts.</li>\n<li>Knowledge in web / scripting technologies, HTML, CSS, JavaScript and SaaS applications.</li>\n<li>Outstanding problem solving skills, including the ability to meet a business requirement with a technical solution.</li>\n<li>Outstanding solution scoping abilities, using our existing solution and influencing new product development.</li>\n<li>Must be willing to work in a fast paced startup environment with multiple roles.</li>\n<li>Bachelor’s degree or equivalent experience is a must; graduate degree is a plus.</li>\n<li>Must be willing to travel.</li>\n<li>Obvious passion and people skills</li>\n<li>Desired Skills</li>\n<li>Previous consulting experience implementing enterprise class software solutions.</li>\n<li>In-depth knowledge of Customer Service Software, ITSM, data warehousing, business intelligence.</li>\n</ul>\n<p>The US annualized OTE (On Target Earnings) range for this position is $151,000.00-$227,000.00 with a pay mix of 80/20 (base/commission). This position may also be eligible for bonus, benefits, or related incentives. While this range reflects the minimum and maximum value for new hire salaries for the position across all US locations, the offer for the successful candidate for this position will be based on job related capabilities, applicable experience, and other factors such as work location. Please note that the compensation details listed in US role postings reflect the base salary only (or OTE for commissions based roles), and do not include bonus, benefits, or related incentives.</p>\n<p><b>The intelligent heart of customer experience</b></p>\n<p>Zendesk software was built to bring a sense of calm to the chaotic world of customer service. Today we power billions of conversations with brands you know and love.</p>\n<p>Zendesk believes in offering our people a fulfilling and inclusive experience. Our hybrid way of working, enables us to purposefully come together in person, at one of our many Zendesk offices around the world, to connect, collaborate and learn whilst also giving our people the flexibility to work remotely for part of the week.</p>",
        "url": "https://jobicy.com/jobs/116092-senior-solutions-consultant-2",
        "source": "Jobicy",
        "posted_at": "2025-04-07 03:09:34",
        "salary": "USD 151,000 - 227,000",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/05/a151608a9113acccb09c9ebf7b0b2b6a.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Product Designer",
        "company": "Firstbase.io",
        "location": "Anywhere",
        "description": "Firstbase is building an all-in-one Company OS to help define how founders across the globe launch, manage and grow their businesses. More than twenty thousand founders from over two hundred countries have used our products: Firstbase Start to launch a company, Firstbase Agent and Firstbase Mailroom to manage ongoing compliance, and Firstbase Loop to get&amp;#8230;",
        "html_description": "<p>Firstbase is building an all-in-one Company OS to help define how founders across the globe launch, manage and grow their businesses.</p>\n<p>More than twenty thousand founders from over two hundred countries have used our products: Firstbase Start to launch a company, Firstbase Agent and Firstbase Mailroom to manage ongoing compliance, and Firstbase Loop to get access to financial services in one click. We are building the future of company management.</p>\n<p>Firstbase is backed by Y Combinator &amp; our team, investors, and advisors include people from Apple, Gusto, Carta, Wise, Plaid, and many other great companies.</p>\n<h2><strong>Our design stack</strong></h2>\n<p>Our product is designed with Whimsical, Figma, and other design tools. Our front-end is built using JavaScript, HTML, CSS, Vue, etc. We use Slack, Clubhouse, Notion, and G Suite to collaborate and build together.</p>\n<h2><strong>Why you should join</strong></h2>\n<p>Our team is dedicated to building products &amp; solving some of the startups&#8217; hardest problems, with particular focus on:</p>\n<ul>\n<li>Democratizing access to financial infrastructure</li>\n<li>Automating tasks every founder faces when running a business</li>\n<li>Making tools and resources more accessible to everyone, everywhere</li>\n<li>Building integrated solutions for founders and removing friction</li>\n<li>Delivering opportunity to traditionally overlooked founders and companies</li>\n<li>Democratizing access to knowledge</li>\n</ul>\n<p>Join us on a mission to increase the number of growing companies.</p>\n<h2><strong>Who are we looking for</strong></h2>\n<p>We are looking for risk-takers with diverse experience able to provide fearless feedback.</p>\n<h2><strong>You will have the following responsibilities</strong></h2>\n<ul>\n<li>Work directly with the VP of Product to shape ideas, create prototypes, and build the product roadmap</li>\n<li>Partner with marketing to create and implement new designs consistent with the product experience</li>\n<li>Work with Customer Success to research and understand customer problems and pain points.</li>\n<li>Design and collaborate with engineering to implement new Vue UI components and improve existing ones</li>\n<li>Creating design guidelines for our products to ensure interface consistency across devices.</li>\n<li>Designing beautiful, clear interfaces for the website and necessary marketing assets.</li>\n<li>Illustrating intuitive iconography for our applications</li>\n<li>Helping instill a design culture in the company as a whole — we want everyone to value and understand the role of design</li>\n<li>Creating original graphic designs (e.g., images, sketches, and tables)</li>\n</ul>\n<h2><strong>Minimum requirements</strong></h2>\n<ul>\n<li>3+ years of experience in a similar role at a high-growth startup</li>\n<li>Knowledge of startups and products in our space</li>\n<li>Great taste for elegant and beautiful product experiences</li>\n<li>Ability to work through design problems from beginning to end, efficiently</li>\n<li>A knack for distilling complex problems into effective solutions</li>\n<li>Strong communication skills to collaborate with various stakeholders</li>\n<li>Hard-working and dedicated team player that needs little to no supervision, but enjoys working a team toward a common goal</li>\n<li>Analytical mind with problem-solving aptitude</li>\n<li>Self-motivated with an ability to work in the unknown</li>\n<li>Ability to communicate technical topics to both technical and non-technical team members.</li>\n<li>Demonstrated collaboration with product managers, engineers, and other designers to drive outcomes</li>\n<li>Proficient in both oral and written English communication</li>\n</ul>\n<h2><strong>Some perks you might enjoy<br />\n</strong></h2>\n<ul>\n<li><strong>Competitive salary &amp; equity</strong></li>\n</ul>\n<p>We lean on some of the best market data to ensure that we offer the most competitive compensation.</p>\n<ul>\n<li><strong>Hybrid work environment</strong></li>\n</ul>\n<p>We work both remotely &amp; from our office in New York City – optimizing for collaboration while providing flexibility to team members.</p>\n<ul>\n<li><strong>21 days of PTO + birthday off</strong></li>\n</ul>\n<p>We offer flexibility to allow people to relax and recharge whenever they need it.</p>\n<ul>\n<li><strong>Build your ideal work setup</strong></li>\n</ul>\n<p>We understand that how you work is extremely important, so we provide a stipend to set you up for success here at Firstbase.</p>\n<ul>\n<li><strong>Health benefits</strong></li>\n</ul>\n<p>Firstbase offers health insurance reimbursements to both US and international employees</p>\n<ul>\n<li><strong>Learning &amp; development</strong></li>\n</ul>\n<p>We provide a stipend together with resources to help people grow and develop in their careers.</p>\n<ul>\n<li><strong>Amazing annual bonuses</strong></li>\n</ul>\n<p>Every team at Firstbase has a bonus structure which usually accounts for 10% of OTE.</p>\n<p><em>If you think you&#8217;re unqualified or don&#8217;t meet all the requirements for this role, we encourage you to still apply. We celebrate diverse candidates, adjacent experiences, and simply put, good people who want to build great things. If that&#8217;s you, then we&#8217;d love to meet.</em></p>",
        "url": "https://jobicy.com/jobs/113337-product-designer-6",
        "source": "Jobicy",
        "posted_at": "2025-04-07 03:07:21",
        "salary": "",
        "job_type": "full-time",
        "category": "Web &amp; App Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/06/0957540f8833648730fb94c40501bbd3.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Creative Manager",
        "company": "Kickstarter",
        "location": "USA",
        "description": "Kickstarter is seeking a highly skilled and self-driven Creative Manager to join our dynamic team. In this role, you will be responsible for overseeing all aspects of the creative design process from concept to execution. You will manage creative vendors, lead design projects, and maintain timelines to ensure high-quality, impactful creative outputs. This role requires&amp;#8230;",
        "html_description": "<p>Kickstarter is seeking a highly skilled and self-driven Creative Manager to join our dynamic team. In this role, you will be responsible for overseeing all aspects of the creative design process from concept to execution. You will manage creative vendors, lead design projects, and maintain timelines to ensure high-quality, impactful creative outputs. This role requires hands-on design capabilities as well as strong project management skills to execute and deliver with little oversight. You will collaborate cross-functionally with marketing, content, and product teams to ensure that creative assets align with the company&#8217;s brand and business goals.</p>\n<p>The salary for this role in the United States is $105,000 &#8211; $120,000.</p>\n<h2>In this role, you will:</h2>\n<ul>\n<li><strong>Creative Vendor Management:</strong> Source, evaluate, and manage external creative vendors, including freelancers, agencies, and production companies, ensuring that deliverables meet brand guidelines, quality standards, and project timelines.</li>\n<li><strong>Creative Project Management</strong>: Oversee all aspects of creative design projects, including timelines, budgets, and resources. Lead the creative development process from concept to delivery, ensuring that all assets are delivered on time and meet business objectives.</li>\n<li><strong>Hands-on Design Expertise:</strong> Lead and drive the creation of compelling assets end-to-end that reinforce our brand identity while applying strategic thinking to design executions for all OOH, digital, print, and IRL branded experiences.</li>\n<li><strong>Brand Consistency:</strong> Spearhead the development of new brand guidelines to ensure consistency across all platforms and consumer touchpoints, including digital, print, and social media.</li>\n<li><strong>Cross-Functional Collaboration:</strong> Work closely with internal teams, including marketing, product, and content, to understand project goals and translate them into compelling visual solutions.</li>\n<li><strong>Stakeholder Communication:</strong> Present creative concepts and designs to senior leadership and key stakeholders, incorporating feedback effectively to refine deliverables.</li>\n<li><strong>Continuous Improvement:</strong> Stay up-to-date with industry trends, tools, and best practices to continuously elevate the creative output of the team.</li>\n</ul>\n<h2><strong>About You</strong></h2>\n<ul>\n<li>5+ years of experience in a creative design role, with at least 2 years of experience managing creative operations using Asana or another project management tool, as well as vendors.</li>\n<li>Proven hands-on experience in graphic design, including proficiency with tools such as Adobe Creative Suite (Photoshop, Illustrator, InDesign, After Effects etc.), and Figma.</li>\n<li>Strong project management skills, with the ability to juggle multiple projects and deadlines with minimal oversight.</li>\n<li>Experience sourcing and managing creative vendors and agencies.</li>\n<li>Exceptional communication skills, both written and verbal, with the ability to present and articulate design concepts.</li>\n<li>Highly creative with a strong attention to detail and a passion for high-quality design.</li>\n<li>Ability to thrive in a fast-paced, deadline-driven environment.</li>\n<li>Experience working in industries such as technology, e-commerce, or media.</li>\n<li>Familiarity with web design, UI/UX principles, and digital content creation.</li>\n<li>Background for creating strong internal assets (decks, one-sheets, etc.) as well as product design and campaign creative assets.</li>\n</ul>\n<h2>What You&#8217;ll Enjoy</h2>\n<ul>\n<li>A fully remote workforce with plenty of opportunities to get to know your colleagues</li>\n<li>100% employer-paid health plan offerings</li>\n<li>16 paid vacation days, 10 sick days, and a company-wide winter break between Christmas and New Years</li>\n<li>25 volunteer hours each year to give back to your community</li>\n<li>16 weeks of parental leave plus fertility/family planning resources</li>\n<li>Annual stipends including a Remote Working &amp; Wellness Stipend of $3,000 USD (prorated) each calendar year for expenses related to remote working, wellness, health, and fitness, and a $500 Role Development Stipend</li>\n<li>Kickstarter currently operates with a 4-day workweek, a model that aligns our belief in a healthy work-life balance and gives staff the space to be more than their work</li>\n<li>Incredibly talented and inspiring colleagues who know how to blend their creative endeavors into their work</li>\n</ul>\n<h2>Our Fully Virtual Team</h2>\n<p>We’re currently able to support employees based in the following US locations: CA, CO, CT, FL, IL, MA, MD, NC, NJ, NY, OR, VA, VT, and WA. We&#8217;re also able to support employees in the United Kingdom. If you live in—or are willing to move to—any of these locations, we look forward to your application! If there is a required or preferred location for an open role, it will be listed in the job description.</p>\n<p>Kickstarter is an equal opportunity employer. As part of our commitment to fight for equality, we work to ensure a fair and consistent interview process. We celebrate diversity and we are committed to an inclusive work environment.</p>\n<p><strong>Reminder to applicants:</strong> Authentic communications from Kickstarter will always originate from official Kickstarter email domains (@kickstarter.com). Exercise caution and verify the legitimacy of anyone who claims to be representing Kickstarter on other platforms.</p>",
        "url": "https://jobicy.com/jobs/116744-creative-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-07 03:06:13",
        "salary": "USD 105,000 - 120,000",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/75b1d293ecc0cbc2e59d27d84f2b74d6.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Full Stack Engineer - Web",
        "company": "Eight Sleep",
        "location": "LATAM,  Canada,  Europe,  UK,  USA",
        "description": "We&amp;#8217;re looking for a talented Full Stack Engineer to join our team, with responsibilities spanning all parts of our web stack, including our consumer website, payments and ecommerce infrastructure, and online member experience. If you are a mission-oriented engineer who is excited working across a diverse set of challenges to ship game-changing health and fitness&amp;#8230;",
        "html_description": "<p>We&#8217;re looking for a talented <strong>Full Stack Engineer</strong> to join our team, with responsibilities spanning all parts of our web stack, including our consumer website, payments and ecommerce infrastructure, and online member experience. If you are a mission-oriented engineer who is excited working across a diverse set of challenges to ship game-changing health and fitness experiences, this is the right opportunity for you.</p>\n<p>This is a <strong>full time position remote</strong> position.</p>\n<h2><strong>How you&#8217;ll contribute:</strong></h2>\n<ul>\n<li>Build and own full stack consumer experiences, from pixel-perfect interfaces to robust, scalable backend infrastructure</li>\n<li>Run experiments and iterate towards a best-in-class ecommerce storefront that accelerates growth and serves as a compelling first touchpoint for our future members.</li>\n<li>Collaborate with product managers, designers, and engineers across the organization to bring our game-changing member experience to the web</li>\n<li>Shape the future of our growing software team by laying the groundwork for new product areas</li>\n</ul>\n<h2><strong>About you:</strong></h2>\n<ul>\n<li>You’re excited about the health and fitness technology space and the opportunity to measurably improve lives</li>\n<li>You have the desire to make an outsized impact as part of a rapidly growing, dynamic team</li>\n<li>You are willing to roll up your sleeves and use whatever language or framework will best help you get the job done</li>\n<li>You love thinking about things from the customer’s perspective and trying to understand what motivates and drives decision making</li>\n<li>You have side projects outside of work that you’re excited to tell us about</li>\n</ul>\n<h2><strong>What you&#8217;ll need to succeed:</strong></h2>\n<ul>\n<li>3+ years of experience shipping high-quality consumer web apps using React</li>\n<li>Expertise in Javascript, TypeScript and Node.js</li>\n<li>End-to-end knowledge of modern web app architecture (including relational databases, API design, cloud infrastructure, and security) as well as best development practices</li>\n<li>Familiarity with manipulating and processing complex data</li>\n<li>BA/BS in Computer Science, or equivalent experience</li>\n</ul>\n<h2><strong>Bonus points for:</strong></h2>\n<ul>\n<li>Familiarity with Next.js, Three.js, GSAP</li>\n<li>Experience working at a consumer products company focusing on health and wellness.</li>\n<li>Knowledge of design programs (Figma, Sketch, Photoshop).</li>\n</ul>\n<h2><strong>Why you’ll love Eight Sleep:</strong></h2>\n<ul>\n<li>We’re a tight-knit, passionate team that’s working to improve people’s lives by improving the way they sleep</li>\n<li>Leadership is committed to employees’ wellness and career development</li>\n<li>You’ll get a better night sleep every night; all full-time employees receive the Pod</li>\n<li>Flexible, generous PTO</li>\n</ul>\n<p>At Eight Sleep we continually celebrate the diverse community different individuals cultivate. As an equal opportunity employer, we stay true to our values by ensuring everyone feels they can flourish and grow. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.</p>",
        "url": "https://jobicy.com/jobs/112127-full-stack-engineer-web",
        "source": "Jobicy",
        "posted_at": "2025-04-07 03:04:22",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/76713d2f1b795ffde1c2777d9f74e684.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "HR Business Partner",
        "company": "WorkWave",
        "location": "USA",
        "description": "WorkWave is seeking an HR Business Partner (HRBP) to play a strategic role in aligning business objectives with employees and management within designated business units. This position partners across HR functions to provide value-added services that support business goals. The HRBP is expected to have a deep understanding of the business unit&amp;#8217;s financial status, culture,&amp;#8230;",
        "html_description": "<p>WorkWave is seeking an HR Business Partner (HRBP) to play a strategic role in aligning business objectives with employees and management within designated business units. This position partners across HR functions to provide value-added services that support business goals. The HRBP is expected to have a deep understanding of the business unit&#8217;s financial status, culture, long-term plans, and competitive landscape.</p>\n<h2>WHAT YOU&#8217;LL DO</h2>\n<ul>\n<li><b>Strategic HR Planning: </b>Collaborate with business leaders to develop and execute HR strategies that align with business objectives and enhance organizational performance.</li>\n<li><b>Employee Relations: </b>Act as a liaison between management and the Employee Relations team, addressing complex issues and ensuring legal compliance.</li>\n<li><b>Talent Management: </b>Work with the Talent team to address staffing needs and develop workforce plans.</li>\n<li><b>Professional Development:</b> Partner with the Professional Development team to manage succession planning and career and leadership development initiatives.</li>\n<li><b>Change Management: </b>Lead and support organizational change initiatives, ensuring effective transitions and employee buy-in.</li>\n<li><b>Organizational Development:</b> Proactively assess HR-related needs and develop integrated solutions to address them.</li>\n<li><b>Compliance: </b>Ensure adherence to labor laws and company policies, offering guidance on HR procedures and ensuring consistency across the organization.</li>\n<li><b>Data-Driven Decisions: </b>Use HR metrics and analytics to guide decision-making and identify areas for improvement.</li>\n<li><b>Culture and Engagement: </b>Promote employee engagement and a positive organizational culture aligned with company values.</li>\n<li><b>Compensation and Benefits: </b>Collaborate with the Compensation and Benefits team on salary benchmarking, job evaluations, and pay reviews.</li>\n</ul>\n<h2>WHAT YOU&#8217;LL BRING</h2>\n<ul>\n<li>Bachelor&#8217;s degree in Human Resources, Business Administration, or a related field. A Master’s degree or HR certifications (e.g., SHRM-CP, SHRM-SCP, PHR, SPHR) are a plus.</li>\n<li>At least 7 years in HR, with a minimum of 4 years in an HR Business Partner or strategic HR role.</li>\n<li>Deep understanding of HR processes, labor laws, and industry best practices.</li>\n<li>Exceptional interpersonal and communication abilities, with a knack for building relationships across all levels.</li>\n<li>Proven consulting skills for both management and employees, with strong problem-solving capabilities.</li>\n<li>Proficient in HRIS systems; Dayforce experience is a plus.</li>\n<li>Strong analytical abilities to interpret HR data and trends effectively.</li>\n<li>Experience with organizational development and change management.</li>\n<li>Strategic thinker with a solid business acumen.</li>\n<li>Highly organized with strong project management skills.</li>\n<li>Trusted to handle sensitive information with discretion and maintain confidentiality.</li>\n<li>Self-motivated and able to work independently with minimal supervision.</li>\n<li><b>Commutable to Holmdel, NJ is preferred </b></li>\n</ul>\n<h2><b>WHAT YOU SHOULD KNOW ABOUT US</b></h2>\n<ul>\n<li>We are laid back but buttoned up. We offer a casual work environment and remote work flexibility and have a passion for developing creative, innovative best in class solutions that directly contribute to the success of our customers</li>\n<li>We care deeply and deliver service and solutions that make a real difference in the lives of our clients and their businesses</li>\n<li>We openly accept others as they are and build strong partnerships based on trust</li>\n<li>Teamwork and collaboration is key to help our colleagues and customers solve their challenges</li>\n<li>Our team is energetic, fun, naturally inquisitive and eager to make an impact, we invite you to join us!</li>\n</ul>\n<h2><b>LOVE WHAT YOU DO, NO MATTER WHERE YOU DO IT</b></h2>\n<p>Join our Remote-First Global Work Community: WorkWave provides an innovative and dynamic remote-first Global Work Community that encourages growth, creativity, and collaboration. No matter what stage of your career or where you live, WorkWave is your place to be part of a global company with a startup feel, where your ideas matter and your growth is a priority.</p>\n<h2><b>A GLOBAL COMPANY WITH A LOCAL PRESENCE</b></h2>\n<ul>\n<li>We know that there are benefits of being in the office and working from home. WorkWave promotes a healthy work/life balance and provides employees with the flexibility of collaborating in the office or the option to work virtually if desired. Our teams are well versed at working collaboratively in a fully virtual environment.</li>\n<li>Our HQ is based at our state of the art home office in the historic Bell Works complex located in Holmdel Township, New Jersey. We keep our offices available to all to use when working remotely isn’t feasible, or to help with cross training, team building and/or brainstorming.</li>\n<li>We have employees in over 30 states, 7 countries and many regional offices &#8211; each with their own set of perks and opportunities to give back to the local community.</li>\n<li>Whether you work remotely or take advantage of one of our offices, you’ll find a community of WorkWavers that value diversity, and care deeply about our products, clients, our communities and each other.</li>\n</ul>\n<h2><b>RELAX, WE&#8217;VE GOT YOU COVERED</b></h2>\n<p>Employees can expect a robust benefits package, including health and dental and 401k with company match</p>\n<h2><b>AND BEYOND&#8230;</b></h2>\n<ul>\n<li>Find your perfect work/life balance with our Flexible Time Off policy or generous PTO plan (role dependent) and paid holidays</li>\n<li>Up to 4 weeks paid bonding leave</li>\n<li>Tuition reimbursement</li>\n<li>Robust Employee Assistance Program through TotalCare offering free counseling 24/7/365, plus financial counseling, legal guidance, adoption assistance services and much more!</li>\n<li>24/7 access to virtual medical care with Teladoc</li>\n<li>Quarterly awards based on peer nominations</li>\n<li>Regional discounts and perks</li>\n<li>Opportunities to participate in charitable events and give back to the community</li>\n</ul>\n<h2><b>GROW WITH US</b></h2>\n<ul>\n<li>We understand the impact of attracting and keeping top talent and reward intellectual curiosity and a thirst for personal and professional growth</li>\n<li>Encouraging our employees that already have an intimate knowledge of and passion for our products to apply for other roles within our walls just makes sense!</li>\n<li>Our employees have access to extensive video libraries for soft skill and role specific training available 24/7 and live trainings are provided throughout the year</li>\n</ul>\n<h2><b>JOIN OUR WINNING TEAM! </b></h2>\n<ul>\n<li>10 Time winner of Best Place to Work in New Jersey by NJBiz!</li>\n<li>WorkWave has been recognized with multiple awards for its outstanding products, growth and culture, including the Inc. 5000, SaaS Award, IT World Awards, Globe Awards, Silver Stevie Award for Employer of the Year, and Best Place to Work Inc. Magazine</li>\n<li>Recently named one of The Software Report&#8217;s 3rd annual list of the Top 100 Software Companies of 2022 (worldwide!)</li>\n</ul>\n<p><i><b>We’re an equal opportunity employer. All applicants will be considered for employment without attention to race, color, age, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status:</b></i><i> </i>Don&#8217;t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At WorkWave, we are dedicated to building a diverse, inclusive and authentic workplace, so if you feel like you could make a great impact in this role but your past experience doesn&#8217;t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may just be the right candidate for this or other roles!</p>\n<p><i>WorkWave supports salary transparency, however please note that salary estimates provided by websites (LinkedIn, Glassdoor, etc.) and not by WorkWave may not accurately reflect the actual salary range for the position.</i></p>",
        "url": "https://jobicy.com/jobs/116064-hr-business-partner-2",
        "source": "Jobicy",
        "posted_at": "2025-04-06 03:46:33",
        "salary": "USD 95,000 - 106,000",
        "job_type": "full-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/78458cfe50d13ec79a5afc7a7a557272.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Strategic Sales Manager",
        "company": "Adaptavist",
        "location": "Germany",
        "description": "The Strategic Sales Manager will play a key role in the Adaptavist Sales Process, and managing this end-to-end. This role will work with various teams across the business to define solutions for our clients, guide the production of proposals which oversee our commercial approach and solution offering, as well as manage the client through the&amp;#8230;",
        "html_description": "<p>The Strategic Sales Manager will play a key role in the Adaptavist Sales Process, and managing this end-to-end. This role will work with various teams across the business to define solutions for our clients, guide the production of proposals which oversee our commercial approach and solution offering, as well as manage the client through the Adaptavist Sales Process.</p>\n<p>The role of the Strategic Sales Manager is to engage with potential Enterprise clients to understand their primary needs and drivers. You will develop and execute enterprise account strategy aligned with the customer&#8217;s business goals, generating and developing business growth opportunities and identifying appropriate Adaptavist resources, services and products to resolve them.</p>\n<h2>Communication, Networking, Impact and Influence</h2>\n<ul>\n<li>Listening and communicating openly, honestly, and respectfully with different audiences, promoting dialogue and building consensus.</li>\n<li>Handles difficult on-the-spot questions (e.g., from senior executives, public officials, interest groups, or the media).</li>\n<li>Secures support for ideas or initiatives through high-impact communication to overcome resistance.</li>\n<li>Establishing, sustaining and fostering professional contacts to build, enhance and connect networks for work purposes.</li>\n<li>Creates opportunities to initiate new connections (including partnerships) that will facilitate the achievement of strategic goals.</li>\n<li>Evaluate the current network for effectiveness, sufficiency/inclusivity and relevance to achieving Adaptavist’s strategic objectives.</li>\n</ul>\n<h2>Client Focus, Consultative Selling Process, Customer Relationship Management and Negotiation</h2>\n<ul>\n<li>Identifies and develops business opportunities within assigned territory of Mid Market high growth and Enterprise Accounts</li>\n<li>Manages individual sales funnel and archives individual Sales targets</li>\n<li>Addresses the unidentified, underlying and long-term client needs.</li>\n<li>Enhances client service delivery systems and processes.</li>\n<li>Seeks to resolve different perspectives or matters of dispute by discovering shared interests and finding mutually acceptable solutions.</li>\n<li>Adjusts strategies in negotiations, recognising when to compromise and when to seek a fresh perspective.</li>\n<li>Manages own emotions when dealing with irrational counterparts or challenging relationships, taking a constructive approach that focuses on solutions.</li>\n<li>Reaches mutually acceptable solutions in complex, formal negotiations (e.g. negotiates highly complex, multi-year contracts; negotiates/mediates in situations where the positions of the parties are ambiguous or keep shifting).</li>\n</ul>\n<h2>Product Knowledge</h2>\n<ul>\n<li>Understanding Adaptavist products and services and how they integrate with and improve Atlassian products.</li>\n<li>Matches product knowledge to the implicit needs of the customer.</li>\n<li>Describes how Adaptavist&#8217;s products/services can create a competitive advantage for the customer&#8217;s business.</li>\n<li>Uses knowledge of alternative products/services to enable upselling.</li>\n<li>Reviews Adaptavist products/service offerings on a continual basis in order to ensure quality.</li>\n</ul>\n<h2>What we&#8217;re looking for</h2>\n<ul>\n<li>Experience in technical consultancy &#8211; being able to work with a range of different software solutions to meet a customer’s needs.</li>\n<li>Proven sales success within a consultative B2B sales with a focus on winning net new Enterprise customers, including influencing and negotiating with C-suite executives</li>\n<li>Comfortable working collaboratively both face-to-face and through online tools such as Zoom, Slack, Skype, etc.</li>\n<li>Has highly developed skills around solution selling and experience of working in a pre-sales environment, as part of larger teams</li>\n<li>A strong relationship builder who establishes rapport with people easily and has strong communication skills with the ability to present effectively</li>\n<li>Can understand a prospect&#8217;s challenges and can work with internal stakeholders to create a solution that meets their needs</li>\n<li>Proven ability to articulate the distinct aspects of products and services and position them against competitors</li>\n<li>Experience in leading on expanding into new territories, and being able to manage a level of strategic planning and autonomy around this working with a remote business support team.</li>\n<li>Understands the specific needs within a Sales Process, around forecasting and opportunity progression with the ability to own, manage, orchestrate and execute strategic account plans for assigned Enterprise accounts.</li>\n<li>Have managed a complex software sales cycle from start to finish.</li>\n<li>Based in Germany</li>\n<li>Fluent English and German communication skills.</li>\n</ul>\n<p>At The Adaptavist Group, we are committed to promoting a diverse and inclusive community and believe this positively impacts both the creation of our innovative products and our delivery of bespoke solutions to our global customers and our own unique culture. We encourage all qualified applicants, regardless of age, disability, race, sexual orientation, religion or belief, sex, gender identity, pregnancy and maternity, marriage, and civil partnership status. From our family-friendly policies to our flexible work environment we offer a range of benefits and policies in order to support staff from all different backgrounds. If you have any questions, please do ask us.</p>",
        "url": "https://jobicy.com/jobs/115350-sales-associate",
        "source": "Jobicy",
        "posted_at": "2025-04-06 03:45:45",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201008144400-224969.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Senior Revenue Accountant",
        "company": "GoHealth Urgent Care",
        "location": "USA",
        "description": "In this role you will support the monthly revenue accounting process in close partnership and collaboration with the Company’s Revenue Cycle group. This role will also help identify and implement continuous improvement opportunities and integrate new joint venture partnerships into the revenue accounting process of our fast-paced, high-growth organization. The Revenue Senior Accountant is a&amp;#8230;",
        "html_description": "<p>In this role you will support the monthly revenue accounting process in close partnership and collaboration with the Company’s Revenue Cycle group. This role will also help identify and implement continuous improvement opportunities and integrate new joint venture partnerships into the revenue accounting process of our fast-paced, high-growth organization. The Revenue Senior Accountant is a full-time role and reports to the Revenue Accounting Manager with visibility to leadership throughout the Company, including the Chief Accounting Officer, VP of Finance and Director of Revenue Accounting. This position will maintain close working relationships with the broader</p>\n<p>Controllership team and various departments throughout the organization, including Revenue Cycle and FP&amp;A. The individual serving in this role can work remotely, but may have to travel to the Company’s corporate headquarters in Atlanta, GA as needed.</p>\n<h2>RESPONSIBILITIES:</h2>\n<ul>\n<li>Prepare journal entries and review accounting classifications in accordance with generally accepted accounting principles</li>\n<li>Calculate Contractual and Bad Debt Allowance for patient revenue</li>\n<li>Responsible for month end close for the revenue function and understands revenue recognition in a healthcare setting</li>\n<li>Prepare Balance Sheet reconciliations for assigned general ledger accounts emphasis on the revenue function</li>\n<li>Review P&amp;L and Balance Sheet accounts for accuracy</li>\n<li>Participate in monthly financial reviews and provide explanations for variance inquiries related to revenue</li>\n<li>First level of review for specific balance sheet reconciliations completed by other team members for revenue and accounts receivable</li>\n<li>Seek to improve processes as needed</li>\n<li>Ad hoc requests as needed</li>\n</ul>\n<h2>QUALIFICATIONS:</h2>\n<ul>\n<li>Bachelor’s degree in Accounting</li>\n<li>CPA required</li>\n<li>At least three to five years of relevant accounting experience</li>\n<li>Experience working with a fully integrated accounting system strongly preferred</li>\n<li>Solid understanding and experience applying U.S. GAAP</li>\n<li>Understanding of the Income Statement, Balance Sheet, &amp; Statement of Cash Flow</li>\n<li>Healthcare revenue accounting experience preferred, but not required</li>\n<li>Advanced MS Excel skills required; experience with Great Plains software a plus</li>\n<li>Experience with year-end audit preparation</li>\n</ul>\n<h2>SKILLS/QUALITIES:</h2>\n<ul>\n<li>Strong verbal and written communication skills</li>\n<li>High energy, passionate individual who is focused on continuous improvement</li>\n<li>Curious mindset and desire to work collaboratively with various internal stakeholders to pragmatically resolve issues and questions</li>\n<li>Attention to detail and accuracy of accounts</li>\n<li>Works well across a multi-site organization</li>\n<li>High integrity and personal standards for quality of work</li>\n<li>Effective problem solver</li>\n<li>Motivated by and thrives in a fast-paced environment with frequent ad hoc requests and changing priorities</li>\n<li>Ability to grow with the company</li>\n</ul>",
        "url": "https://jobicy.com/jobs/114464-senior-revenue-accountant-7",
        "source": "Jobicy",
        "posted_at": "2025-04-06 03:43:20",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/42e418cd6b53869ddcd1812cfeb7790b.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Patient Account Specialist",
        "company": "GoHealth Urgent Care",
        "location": "USA",
        "description": "The Patient Account Specialist is responsible for executing all duties for the Patient Statement Process which includes taking all inbound phone calls, researching patient issues, collecting from the patients, transitioning past due patient accounts to outside collections, responding to all patient inquiries via fax/email/calls, processing financial assistance and processing all correspondence. ***Bilingual (Spanish) Strongly preferred***&amp;#8230;",
        "html_description": "<p>The Patient Account Specialist is responsible for executing all duties for the Patient Statement Process which includes taking all inbound phone calls, researching patient issues, collecting from the patients, transitioning past due patient accounts to outside collections, responding to all patient inquiries via fax/email/calls, processing financial assistance and processing all correspondence.</p>\n<p><strong>***Bilingual (Spanish) Strongly preferred***</strong></p>\n<h2><strong>JOB REQUIREMENTS</strong></h2>\n<p><strong>Education</strong></p>\n<ul>\n<li>High School Diploma or GED required</li>\n<li>Associate’s degree in business administration or related field preferred</li>\n</ul>\n<p><strong>Work Experience</strong></p>\n<ul>\n<li>1-2 years of Customer Service experience- required</li>\n<li>2 years Medical Billing experience preferred</li>\n<li>Medical insurance billing and claims processing preferred</li>\n</ul>\n<p>Required Licenses/Certifications</p>\n<ul>\n<li>CPAR – Certified Patient Account Representative preferred</li>\n</ul>\n<p><strong>Additional Knowledge, Skills and Abilities Required</strong></p>\n<ul>\n<li>Hands on knowledge of CPT and ICD codes</li>\n<li> Excellent phone, communication, organizational skills, computer skills and mathematical skills</li>\n<li>Ability to maintain patient confidentiality</li>\n</ul>\n<p><strong>Additional Knowledge, Skills, and Abilities Preferred</strong></p>\n<ul>\n<li>Epic or eClinicalWorks experience</li>\n<li>Experience with Microsoft Excel and Word</li>\n<li><strong>Bilingual Preferred </strong></li>\n</ul>\n<h2><strong>ESSENTIAL FUNCTIONS</strong></h2>\n<p>Essential functions are those tasks, duties and responsibilities that comprise the means of accomplishing the job’s purpose and objectives. Essential functions are critical or fundamental to the performance of the job. They are the major functions for which the person in the job is held accountable. Following are the essential functions of the job.</p>\n<ul>\n<li>Maintain Daily communication with Team Leaders/Section Leaders</li>\n<li>Maintain a high-level customer service approach to working with Accounts Receivable Specialists, payors and centers</li>\n<li>Establish and maintain a high-level customer service approach to working with all patients</li>\n<li>PAS will work each call to its conclusion including but not limited to working with other teams to research, review and respond to the patient’s needs and provide follow up within 24-hour period.</li>\n<li>PAS will be responsible for assigned reports that will be completed in the allotted timeframe. This will include but not limited to Bankruptcies, Death notifications, Agency Referral, Hold Reports, Cancellation reports, Payment Plan reports, statement requests, address mail changes and any other report that will need to be worked to complete patient record.</li>\n<li>PAS will be responsible for collecting unpaid balances</li>\n<li>PAS will be responsible for processing credit card payments.</li>\n<li>PAS are responsible for updating patient demographic information from returned mail and address<br />\ncorrection reports</li>\n</ul>\n<h3><strong>Required knowledge, skills and abilities</strong></h3>\n<p>Customer service skills:</p>\n<ul>\n<li>Ability to represent the Department in a professional manner when interacting with patients, guests,<br />\nphysicians and their staff</li>\n<li>Ability to handle service issues professionally</li>\n<li>Ability to follow through with customers</li>\n</ul>\n<p>Communication Skills:</p>\n<ul>\n<li>Ability to communicate effectively to patients about their medical conditions and the financial aspects of their care.</li>\n</ul>\n<p>Keyboard skills:</p>\n<ul>\n<li>Ability to type proficiently</li>\n</ul>\n<p>Teamwork:</p>\n<ul>\n<li>Ability to function effectively as extension of the Center</li>\n<li>Be flexible and open-minded in thought processes</li>\n<li>Maintain focus under pressure</li>\n<li>Share relevant information with other employees</li>\n<li>Volunteer to assist others when time permits</li>\n</ul>\n<p>Medical Terminology &amp; Insurance</p>\n<ul>\n<li>Ability to understand basic medical terminology</li>\n<li>Ability to calculate deductible and co-insurance correctly</li>\n<li>Ability to read and understand carrier Explanation of Benefits</li>\n</ul>\n<p>All other duties as assigned.</p>\n<p>Note: this job description is not inclusive of all the duties of the position. You may be asked by leaders to perform other duties. Management reserves the right to revise this position description at any time.</p>\n<h3><b>Internet Requirements for Remote Call Center Employees</b></h3>\n<p>To ensure optimal and a seamless customer experience, the following internet connection requirements must be met by all the call center employees working from home.</p>\n<ul>\n<li><strong>Connection Type:</strong>\n<ul>\n<li><strong>A hardwired (Ethernet) connection is mandatory to ensure stability and reliability.</strong></li>\n<li>Wireless (Wi-Fi) connections are not permitted for work purposes due to potential signal fluctuations, interference, and latency issues.</li>\n</ul>\n</li>\n<li><strong>Minimum Internet Speed:</strong>\n<ul>\n<li>Download speed: At least 100 Mbps</li>\n<li>Upload speed: At least 10 Mbps</li>\n<li>These speeds are required to handle voice, video calls, and data transmission simultaneously.</li>\n</ul>\n</li>\n<li><strong>Latency (Ping):</strong>\n<ul>\n<li>The network latency must not exceed 100ms to avoid delays in communication.</li>\n</ul>\n</li>\n<li><strong>Internet Service Provider (ISP):</strong>\n<ul>\n<li>The employee must subscribe to a reliable ISP that provide high-speed broadband services (e.g.,Fiber Optic, Cable).</li>\n<li>DSL, satellite, or mobile hotspot connections are not recommended due to higher latency and potential service disruption.</li>\n</ul>\n</li>\n<li><strong>Backup Internet Connection (Optional but Recommended):</strong>\n<ul>\n<li>Employees should have a backup internet source (e.g.,secondary broadband or mobile data) in case of primary service disruption.</li>\n</ul>\n</li>\n<li><strong>Testing and Compliance:</strong>\n<ul>\n<li>Employees are required to perform a speed test using a reliable tool (such as Speedtest by Ookla) before the start of their shifts.</li>\n<li>A record of compliance may be requested periodically to ensure adherence to these guidelines.</li>\n</ul>\n</li>\n<li><strong>Equipment:</strong>\n<ul>\n<li>Employees are responsible for ensuring that they have the appropriate modem, router, and Ethernet cable to meet these standards.</li>\n<li>The router should be placed in a location that minimizes interference and maximizes the signal strength to the modem.</li>\n</ul>\n</li>\n</ul>",
        "url": "https://jobicy.com/jobs/113132-patient-account-specialist",
        "source": "Jobicy",
        "posted_at": "2025-04-06 03:43:08",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/42e418cd6b53869ddcd1812cfeb7790b.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Recruiter - Business",
        "company": "Revolut",
        "location": "Brazil,  Mexico,  Poland,  Portugal,  Romania,  Spain",
        "description": "People deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 50+ million customers get more from their money every day. As we continue our&amp;#8230;",
        "html_description": "<p>People deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 50+ million customers get more from their money every day.</p>\n<p>As we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we&#8217;ve been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we&#8217;re looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.</p>\n<h2>About the role:</h2>\n<p>We love our people. They&#8217;re brilliant, solution-oriented, passionate individuals. Together we&#8217;re like a professional sports team, and Recruiters are the ones who make sure we’ve got the best players. They hire elite athletes and place them in the right spots to win. That&#8217;s how the #DreamTeam is being created.</p>\n<p>We&#8217;re looking for a Recruiter who&#8217;ll make sure candidates have a great experience during our hiring process. We need a smooth communicator with a great sense of people who&#8217;ll plan and execute first-class hiring strategies to bring the world’s top A-Players to Revolut.</p>\n<p>You&#8217;ll innovate, drive, and deliver hiring solutions effectively and efficiently, seeking out opportunities and improvements across the recruitment lifecycle.</p>\n<p>Up to shape the future of finance? Let&#8217;s get in touch.</p>\n<h2>What you’ll be doing:</h2>\n<ul>\n<li>Recruiting exceptional A-Players to join Revolut&#8217;s rapidly growing teams</li>\n<li>Collaborating with hiring managers and stakeholders to create the ideal candidate profile</li>\n<li>Developing and refining interview processes that enhance our assessment quality and optimise candidate experience</li>\n<li>Being a trusted talent acquisition advisor with a solid understanding of the talent pool</li>\n<li>Facilitating a pipeline of qualified candidates for future needs</li>\n<li>Screening CVs and interviewing prospective candidates, promoting Revolut as an employer of choice</li>\n<li>Driving the offer process and closing candidates</li>\n<li>Consistently ensuring a fantastic candidate experience</li>\n<li>Being a subject-matter expert in your specialist market</li>\n<li>Implementing modern sourcing/recruiting methods</li>\n</ul>\n<h2>What you&#8217;ll need:</h2>\n<ul>\n<li>2+ years of experience as a recruiter (seniority will be based on your experience)</li>\n<li>A proven track record of delivering results in a dynamic, high-growth environment, meeting ambitious timelines and KPIs</li>\n<li>Experience collaborating with senior stakeholders and hiring managers</li>\n<li>Business acumen with the ability to quickly learn and adapt to new domains, supporting cross-functional recruitment efforts</li>\n<li>Solid organisational, multi-tasking, and time-management skills</li>\n<li>Familiarity with ATS and recruitment analytics tools</li>\n<li>Strong problem-solving skills with excellent attention to detail</li>\n<li>High ambition, self-motivation, and passion about our vision</li>\n<li>Exceptional communication skills, both verbal and written</li>\n<li>Fluency in English</li>\n</ul>\n<h2>Nice to have:</h2>\n<ul>\n<li>Experience in a recruitment agency, hyper-growth start-up, and/or fintech</li>\n<li>Fluency in other languages</li>\n</ul>\n<p>Building a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&amp;I Framework, designed to help us thrive and grow everyday. We&#8217;re not just doing this because it&#8217;s the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.</p>\n<h2><b>Important notice for candidates:</b></h2>\n<p>Job scams are on the rise. Please keep these guidelines in mind when applying for any open roles.</p>\n<p>• <b>Only apply through official Revolut channels.</b> We don’t use any third-party services or platforms for our recruitment.</p>\n<p>• <b>Always double-check the emails you receive.</b> Make sure all communications are being done through official Revolut emails, with an @revolut.com domain.</p>\n<p><b>We won&#8217;t ask for payment or personal financial information during the hiring process.</b> If anyone does ask you for this, it’s a scam. Report it immediately.</p>\n<p>By submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Revolut. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Revolut may be terminated summarily or I may be dismissed.</p>",
        "url": "https://jobicy.com/jobs/116065-recruiter-business",
        "source": "Jobicy",
        "posted_at": "2025-04-06 03:42:54",
        "salary": "",
        "job_type": "full-time",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/08/FNDL-200825111113-468175.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Sr. Software Engineer, Privacy",
        "company": "Chainlink Labs",
        "location": "Anywhere",
        "description": "Join a brand new team as the first engineer focused on embedding privacy-enhancing technologies into the Chainlink product stack. This role spans the development of both off-chain and on-chain privacy solutions to enhance the Chainlink runtime Environment. The mission is to introduce privacy solutions at every layer of Chainlink&amp;#8217;s operations, ensuring robust, customer-centric implementations to&amp;#8230;",
        "html_description": "<p>Join a brand new team as the first engineer focused on embedding privacy-enhancing technologies into the Chainlink product stack. This role spans the development of both off-chain and on-chain privacy solutions to enhance the Chainlink runtime Environment. The mission is to introduce privacy solutions at every layer of Chainlink&#8217;s operations, ensuring robust, customer-centric implementations to protect consumers and enable new use cases that rely on privacy.</p>\n<p>Our approach is practical and implementation-driven, emphasizing battle-tested protocols that meet the privacy requirements of diverse customers, from native DeFi protocols to traditional financial institutions navigating blockchain adoption in regulated settings. Experience with technologies like Privacy Pools, Zero Knowledge Proofs (ZKPs), Fully Homomorphic Encryption (FHE), Trusted Execution Environments (TEEs), and Stealth Addresses will be highly advantageous.</p>\n<p>You will work closely with our internal research team and other engineering teams to deliver reliable, scalable, and pragmatic privacy solutions that address real-world challenges.</p>\n<h2><strong>Your Impact:</strong></h2>\n<ul>\n<li>Spearhead the development of a groundbreaking, privacy feature within the Chainlink Runtime Environment, becoming a key contributor within your first six months.</li>\n<li>Shape the future of privacy technologies at Chainlink Labs by directly contributing to the 12-month roadmap and driving innovative architectural designs.</li>\n<li>Influence long-term strategy by ensuring forward-thinking solutions are ready for implementation.</li>\n<li>Lead critical architectural design initiatives that translate privacy roadmaps into actionable development projects, creating scalable and secure systems.</li>\n<li>Collaborate with and manage diverse stakeholders, ensuring seamless integration of privacy technologies across Chainlink&#8217;s platforms and services.</li>\n</ul>\n<h2><strong>Requirements:</strong></h2>\n<ul>\n<li>4+ years of experience in software engineering</li>\n<li>Familiarity and experience working on privacy preserving technologies and/or cryptography</li>\n<li>Experience with blockchains or distributed ledgers</li>\n<li>Professional experience with large distributed systems</li>\n<li>Experience working with Trusted Execution Environments, such as SGX, AWS Nitro, GCP Confidential Compute</li>\n</ul>\n<h2><strong>Preferred Requirements:</strong></h2>\n<ul>\n<li>Experience with GO, Rust, or familiarity working with WASM preferred</li>\n<li>Proven product focused engineering and customer empathy</li>\n<li>Experience working on traditional banking or finance systems a plus</li>\n<li>Experience writing production smart contracts in the EVM ecosystem a plus</li>\n</ul>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).</em></p>\n<p><strong>Commitment to Equal Opportunity</strong></p>\n<p>Chainlink Labs is an equal opportunity employer. All qualified applicants will receive equal consideration for employment in compliance with applicable laws, regulations, or ordinances. If you need assistance or accommodation due to a disability or special need when applying for a role or in our recruitment process, please contact us via this <a href=\"https://docs.google.com/forms/d/1wrB1WRRxShkLHI7roFKlyWDobNc3ex_wfGX2Eau5FLc/edit\"><u>form</u></a>.</p>",
        "url": "https://jobicy.com/jobs/107177-site-reliability-engineer-emea",
        "source": "Jobicy",
        "posted_at": "2025-04-06 03:41:24",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Sr. Revenue Accountant",
        "company": "Upwork",
        "location": "USA",
        "description": "We are seeking a highly analytical and detail-oriented Senior Revenue Accountant to join our growing Enterprise Financial Management Team. This role will be responsible for analyzing revenue transactions, reconciling accounts, supporting the month-end close process, and ensuring the integrity of revenue-related financial data. Reporting to the Revenue Manager, this position will work closely with Accounting,&amp;#8230;",
        "html_description": "<p>We are seeking a highly analytical and detail-oriented Senior Revenue Accountant to join our growing Enterprise Financial Management Team. This role will be responsible for analyzing revenue transactions, reconciling accounts, supporting the month-end close process, and ensuring the integrity of revenue-related financial data. Reporting to the Revenue Manager, this position will work closely with Accounting, FP&amp;A, Sales Operations, and external auditors to maintain strong revenue accounting processes in a fast-growing tech environment.</p>\n<h2><strong>Your Responsibilities</strong></h2>\n<ul>\n<li>Support the monthly and quarterly revenue close process, ensuring accurate and timely recognition of revenue and related expenses</li>\n<li>Conduct variance analysis and reporting on revenue trends and discrepancies for both the Enterprise and Manage Services products</li>\n<li>Support the month end close for various functions; including the preparation of journal entries, account reconciliations, flux analysis for revenue-related accounts, including deferred revenue and accounts receivable</li>\n<li>Partner with external auditors by providing documentation, explanations, and support for SOX compliance and audit requests</li>\n<li>Collaborate with Accounts Receivable to analyze bad debt reserves, prepare related journal entries, and ensure proper accounting treatment of doubtful accounts.</li>\n<li>Partner with FP&amp;A and other business partners to record, reconcile and maintain accrual balances and monthly forecast vs actual analysis</li>\n<li>Identify process improvements and internal control enhancements related to revenue accounting</li>\n<li>Help with implementations, report maintenance, close efficiency, audit readiness and ad-hoc projects</li>\n</ul>\n<h2><strong>What it takes to catch our eye</strong></h2>\n<ul>\n<li>Marketplace or technology industry experience</li>\n<li>Excellent communication and collaboration abilities</li>\n<li>Ability to work in a fast-paced, deadline-driven environment</li>\n<li>4+ years of experience in revenue accounting or public accounting (Big 4 preferred)</li>\n<li>CPA certification (or progress toward CPA) is highly preferred</li>\n<li>Experience in a Public Company and Sarbanes Oxley (SOX) compliance</li>\n<li>Solid knowledge of accounting policies/procedures and financial statements</li>\n<li>Ability to resolve problems where analysis requires the in-depth evaluation of various factors</li>\n</ul>\n<p><strong>Come change how the world works.</strong></p>\n<p>At Upwork, you’ll shape talent solutions for how the world works today. We are a remote-first organization working together to create exciting remote work opportunities for a global community of professionals.  While we a have physical office in San Francisco , currently we also support hiring of corporate full-time employees in 19 states in the United States. Please speak with a member of our recruitment team to determine whether you are located in a state in which we are hiring corporate full-time employees.</p>\n<p>At the core of our vibrant culture are shared values that form the foundation of our organization. These values revolve around trust, risk-taking, customer focus, and excellence. Our overarching mission is to create economic opportunities so that people have better lives. We foster an environment where individuals are encouraged to bring their authentic selves to work, nurturing personal and professional growth through development opportunities, mentorship programs, and participation in Upwork Belonging Communities.</p>\n<p>We take pride in providing exceptional benefits to our employees. These include comprehensive medical insurance coverage for both you and your family, unlimited paid time off, a 401(k) plan with matching contributions, 12 weeks of paid parental leave, and an Employee Stock Purchase Plan. To explore these benefits in detail, as well as gain insights into our company values, working principles, and the overall employee experience, we invite you to visit our Life at Upwork page.</p>\n<p>Upwork is proudly committed to recruiting and retaining a diverse and inclusive workforce. As an Equal Opportunity Employer, we never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>\n<p>Additionally, a criminal background check may be run on a candidate after a conditional offer of employment is made. Qualified applicants with arrest or conviction records will be considered in accordance with applicable law, including the California Fair Chance Act and local Fair Chance ordinances.</p>\n<p><em>The annual base salary range for this position  is displayed below. The range displayed reflects the minimum and maximum salary for this position, and individual base pay will depend on your skills, qualifications, experience, and location. Additionally, this position is eligible for the annual bonus plan or sales incentive plan and eligibility to participate in our long term equity incentive program.</em></p>\n<p>Annual Base Compensation $80,250<!-- --> &#8211; <!-- -->$97,250<!-- --> <!-- -->USD</p>",
        "url": "https://jobicy.com/jobs/116028-senior-revenue-accountant-8",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:25:44",
        "salary": "USD 80,250 - 97,250",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/upwork.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Manager - Mid-Market Customer Success",
        "company": "Boulevard",
        "location": "USA",
        "description": "As the Manager of Mid-Market Customer Success, you will lead and mentor a team of Mid-Market Customer Success Managers, driving the success and satisfaction of our customers. You will be responsible for shaping and executing strategies to enhance customer engagement, adoption, and retention. Your leadership in building strong relationships, addressing customer challenges, and ensuring the&amp;#8230;",
        "html_description": "<p>As the Manager of Mid-Market Customer Success, you will lead and mentor a team of Mid-Market Customer Success Managers, driving the success and satisfaction of our customers. You will be responsible for shaping and executing strategies to enhance customer engagement, adoption, and retention. Your leadership in building strong relationships, addressing customer challenges, and ensuring the team delivers outstanding value will be crucial to our continued growth and success.</p>\n<ul>\n<li>Lead and mentor a team of Mid-Market Customer Success Managers, providing guidance, support, and coaching to help them excel in their roles. Foster a culture of excellence, collaboration, and continuous improvement across the organization.</li>\n<li>Refine and execute on a customer engagement strategy that prioritizes customer success and satisfaction, ensuring sustained relationships and ongoing value realization.</li>\n<li>Champion the voice of the customer within the organization by gathering feedback and helping to shape product development, features, and improvements based on customer needs and pain points.</li>\n<li>Drive customer retention and expansion by boosting adoption of our full feature set, ensuring that customers derive maximum value from the platform.</li>\n<li>Continuously analyze and refine the criteria used in the customer health score. This helps identify early indicators of customer needs or potential churn</li>\n<li>Leverage data-driven insights to identify customer trends, behaviors, and opportunities for improvement in the customer journey, making informed decisions that enhance overall customer experience.</li>\n<li>Develop and maintain strong relationships with key mid-market accounts, ensuring their success, engagement, and long-term retention on the platform.</li>\n<li>Act as the primary escalation point for the team, effectively orchestrating resources across the company to resolve customer issues and ensure a successful customer journey from start to finish</li>\n<li>Define, track, and analyze Customer Success KPIs, utilizing data trend analysis to identify opportunities for improvement and optimize customer outcomes.</li>\n</ul>\n<h2><strong>What You’ll Need To Thrive</strong></h2>\n<ul>\n<li><strong>Experience:</strong> At least 8 years of experience in customer success or account management, with 3+ years of leadership experience within a revenue-focused customer success team. The ideal candidate will have a track record of managing a mid-market customer base with ARR ranging from $50K to $150K.</li>\n<li><strong>Collaborative:</strong> Proven ability to collaborate effectively with leaders across departments, ensuring alignment and fostering a culture of teamwork to meet both customer and business goals.</li>\n<li><strong>Expert prioritization: </strong>Strong skills in managing competing priorities and delivering results in a fast-paced, ever-changing environment. Able to make decisions quickly while keeping the bigger picture in mind.</li>\n<li><strong>Data Driven:</strong> Deep understanding of SaaS metrics, including ARR, churn, NPS, NRR, and expansion numbers. Uses data to inform decisions and provide actionable insights to drive business growth and customer success.</li>\n<li><strong>Communication:</strong> Exceptional communication and relationship-building skills, both with customers and internal executives. Able to clearly convey insights and strategies while maintaining strong relationships with key stakeholders.</li>\n</ul>\n<p>Your total budgeted cash compensation for this role is between $100,800 &#8211; $144,000 USD, depending on your current skills, experience, training, and overall market demands. This salary range is subject to change, and there is always room for growth and advancement.</p>\n<p>In addition to the wonderful people you’ll get to work with and challenging projects that’ll push you &#8211; Boulevard is here to make sure you’re always at the top of your game emotionally, mentally, and physically.</p>\n<ul>\n<li>✨ We’ve got you covered with a 401(k) match plus dental, medical, vision, and life insurance.</li>\n<li> Take a break whenever you need with our flexible vacation day policy.</li>\n<li> Fully remote so you can choose where you want to work. You’ll receive a work from home stipend every month.</li>\n<li> Family planning resources and specialized support programs.</li>\n<li> Equity: get ahead on the ground floor and grow with Boulevard.</li>\n<li> Boulevard Bucks Learning and Development program allows employees to explore businesses in the market we serve.</li>\n</ul>\n<p><em>Boulevard Labs, Inc. is an Equal Opportunity Employer committed to hiring a diverse workforce and sustaining an inclusive culture. All employment decisions at Boulevard Labs, Inc. are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.</em></p>",
        "url": "https://jobicy.com/jobs/116030-manager-mid-market-customer-success",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:24:34",
        "salary": "USD 100,800 - 144,000",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/a45167e12b0ed51058a884cf9cd0c76f.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Inside Sales Representative",
        "company": "Liberty Mutual",
        "location": "USA",
        "description": "The typical starting salary range for this role is determined by a number of factors including skills, experience, education, certifications and location. The full salary range for this role reflects the competitive labor market value for all employees in these positions across the national market and provides an opportunity to progress as employees grow and&amp;#8230;",
        "html_description": "<p>The typical starting salary range for this role is determined by a number of factors including skills, experience, education, certifications and location. The full salary range for this role reflects the competitive labor market value for all employees in these positions across the national market and provides an opportunity to progress as employees grow and develop within the role. Some roles at Liberty Mutual have a corresponding compensation plan which may include commission and/or bonus earnings at rates that vary based on multiple factors set forth in the compensation plan for the role.</p>\n<p><strong>Our Remote Inside Sales Agent position is available for candidates based in AL, AR, AZ, FL, GA, IA, IL, IN, KS, KY, LA, MA, MD, MI, MN, MO, NC, NE, NH, NJ, NM, NV, OH, OK, OR, PA, SC, TN, TX, UT, VA, WA, WI and WV and for Licensed candidates based in ID, MT and WY. Applicants must reside within these specified locations to be considered for this role.</strong></p>\n<h2><strong>Why Liberty Mutual?</strong></h2>\n<p>Positivity. Flexibility. Determination and a persuasive personality. Qualities like these cannot be taught. But they can be sharpened, strengthened, and appropriately compensated when you join Liberty Mutual Insurance as a part of our Contact Center Sales Organization. Bring your unique sales talent to our Fortune 100 company and receive paid-training, licensing in all 50 states, and a dynamic role that directs only warm leads your way (no cold calls) – because we believe in supporting your success, not holding it back. Join our sales team and realize the rewards of a career with unlimited earning potential, generous commissions, and a portfolio of benefits that start on day one.</p>\n<h2><strong>Job Details</strong></h2>\n<p>As an Inside Sales Agent you will be handling inbound calls and warm leads, consulting with customers on their insurance needs and match the correct coverages, products, and benefits to convert sales leads into policyholders.</p>\n<p><strong>You’d be a great fit if you are: </strong></p>\n<p><strong>A Passionate Seller: </strong>When a lead comes in, you skillfully pick up the phone and use your sales expertise to turn prospects into happy, confident Liberty Mutual policyholders.</p>\n<p><strong>A Front Lines Liaison:</strong> You rise to the role of representing the Liberty brand, you believe in what you’re selling, and you enjoy connecting customers to the right products for their individual needs.</p>\n<p><strong>A Reliable Teammate:</strong> Whether you work at the office or from home, you adapt well to different environments, schedules, and the varying needs of our policyholders.</p>\n<p><strong>A Customer-Centric Closer:</strong> While sales is in your title, integrity is in your nature. That means you sincerely care that our customers get exactly the quality products and services they need to embrace today and confidently pursue tomorrow.</p>\n<h2><strong>Pay Details</strong></h2>\n<ul>\n<li>Starting base salary is $45K with opportunity for growth.</li>\n<li>Average earnings range from $55K-$75K through a combination of base salary and generous commission.</li>\n<li>Top Performing Agents in their second year and onward, can earn up to $85k+.</li>\n</ul>\n<h2><strong>Position Details</strong></h2>\n<p>From day one you will begin paid training in a remote work environment. All insurance representatives need to hold a Property &amp; Casualty Insurance license. If you do not have one, no worries, paid training also includes licensing!</p>\n<ul>\n<li>Training extends over a period of 16 weeks for licensed hires and 18 weeks for unlicensed hires.</li>\n<li>Comprehensive medical benefits from Day 1.</li>\n<li>No cold calls, all incoming warm leads.</li>\n<li>Opportunities for rewards and recognition.</li>\n<li>Must be available to work a schedule of 4 weekdays and 1 weekend day with a mid-morning start time. Example 11am-8pm (CST). This schedule can be expected for a minimum of 12 months before consideration for another shift.</li>\n<li>All computer equipment is provided. You must be able to maintain department Work at home (W@H) requirements which include a professional workspace/room with a dedicated desk and wired (cable, fiber of DSL service) high-speed internet connection with a minimum 100 MBps download speed and 20 MBps upload speed. Liberty Mutual does not support satellite and mobile internet services.</li>\n</ul>\n<h2><b>Qualifications</b></h2>\n<ul>\n<li>2-3 years sales experience preferred. 2 years of sales/service-related work experience required.</li>\n<li>Strong, engaging interpersonal and persuasion skills needed to close sales</li>\n<li>Ability to communicate well to both prospects and customers</li>\n<li>Excellent analytical, decision-making and organizational skills</li>\n<li>Strong typing capabilities and PC proficiency</li>\n<li>Property and Casualty License required after hire.</li>\n</ul>\n<h2><b>About Us</b></h2>\n<p>As a purpose-driven organization, Liberty Mutual is committed to fostering an environment where employees from all backgrounds can build long and meaningful careers. Through strong relationships, comprehensive benefits and continuous learning opportunities, we seek to create an environment where employees can succeed, both professionally and personally.</p>\n<p>At Liberty Mutual, we believe progress happens when people feel secure. By providing protection for the unexpected and delivering it with care, we help people embrace today and confidently pursue tomorrow.</p>\n<p>We are proud to support a diverse, equitable and inclusive workplace, where all employees feel a sense of community, belonging and can do their best work. Our seven Employee Resource Groups (ERGs) offer a centralized, open space to bring employees and allies together to connect, learn and engage.</p>\n<p>Liberty Mutual is an equal opportunity employer. We will not tolerate discrimination on the basis of race, color, national origin, sex, sexual orientation, gender identity, religion, age, disability, veteran&#8217;s status, pregnancy, genetic information or on any basis prohibited by federal, state or local law.</p>",
        "url": "https://jobicy.com/jobs/94821-inside-sales-representative-10",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:16:39",
        "salary": "USD 55,000 - 75,000",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/a0f68d769896c0f098621799a6396382.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Full Stack Software Engineer",
        "company": "SugarCRM",
        "location": "Romania",
        "description": "From the very beginning, SugarCRM had a unique vision: to offer a different kind of Customer Relationship Management (CRM). We pioneered the first commercial open-source CRM platform, and now, more than two decades later, are on a mission to provide products and services that make the hard things easier for sales, marketing and customer service teams. In&amp;#8230;",
        "html_description": "<p>From the very beginning, SugarCRM had a unique vision: to offer a different kind of Customer Relationship Management (CRM). We pioneered the first commercial open-source CRM platform, and now, more than two decades later, are on a mission to provide products and services that make the hard things easier for sales, marketing and customer service teams. In fact, we help mid-market businesses around the globe reach new levels of performance and predictability by letting our award-winning CRM platform do the work.</p>\n<p>Our diverse group of worldwide employees are united and driven by a shared passion for our mission, culture, and values. We treat our employees like humans not line items and are building a culture where your work at Sugar helps fuel personal, professional and business growth – check out our recent ‘Great Place to Work’ certification that we are so proud of. Work/life fit and flexibility for our team matters and together we pride ourselves on solving for our customers, always.</p>\n<p>We are looking for a curious, highly motivated Full Stack Software Engineer to create the next generation of SugarCRM software products and tools. In this role you will be a member of a Scrum Team utilizing modern technologies to develop both front end and back end components for various products with a strong emphasis on reliable, maintainable, and scalable solutions that run in high volume, high availability environments.</p>\n<p>To be successful in this role you must be independent, and be a quick learner with a can-do attitude and a willingness to work with new and emerging technologies. You will have stellar project organization and communication skills, a strong desire to collaborate with your peers, and work well in cross-functional teams.</p>\n<p>*Preference given to candidates seeking Employee/Employer relationship, over b2b contract employment*</p>\n<h2>Impact you will make in the role:</h2>\n<ul>\n<li>Produce high-quality software on schedule</li>\n<li>Extend and optimize current software architecture</li>\n<li>Perform design and code reviews regularly</li>\n<li>Explore and evangelize new software design and architecture</li>\n<li>Challenge, mentor, and learn from your peers</li>\n<li>Experiment in order to continually improve processes and products</li>\n</ul>\n<h2>What you will bring:</h2>\n<ul>\n<li>2 &#8211; 5 years of experience with enterprise software development and/or distributed SaaS systems</li>\n<li>2 &#8211; 5 years of practical Object Oriented Programming, software programming for the web, experience with emerging languages, technologies and writing unit tests</li>\n<li>JavaScript with modern front-end frameworks like React experience is required</li>\n<li>Knowledge of, and experience with, creating and consuming RESTful APIs, and advanced SQL and NoSQL data stores</li>\n<li>Experience in Agile software development methodologies</li>\n<li>Excellent communication skills across a global cross-functional audience</li>\n<li>Bachelor&#8217;s Degree in Computer Science or related field, or 2 &#8211; 5 years relevant work experience</li>\n</ul>\n<h2>Preferred Experience:</h2>\n<ul>\n<li>Experience with state management solutions such as Redux is a plus</li>\n<li>Experience with Angular.js, NodeJS, Golang, Kubernetes is a plus</li>\n<li>Experience with DevOps, AWS, and cloud services is a plus</li>\n<li>Experience with microservices, containers, and pipelines is a plus</li>\n<li>Experience with test automation is a plus</li>\n<li>Experience with Git, Jira, Jenkins and other agile tools a plus</li>\n<li>*Preference given to candidates seeking Employee/Employer relationship, over b2b contract*</li>\n</ul>\n<p>lei7.855 &#8211; lei8.500 a month<br />\nExpected monthly NET salary range, depending on experience.</p>\n<p>Location:  This role is fully remote in Romania, offering flexibility to work from home, on the road, or anywhere in between.</p>\n<p><i>We understand that no candidate is perfectly qualified for any job. Experience comes in different forms; many skills are transferable; and passion goes a long way. Even more important than your resume is a clear demonstration of dedication, impact, and the ability to thrive in a fluid and collaborative environment. We want you to learn new things in this role, and we encourage you to apply if your experience is close to what we’re looking for. We also know that diversity of background and thought makes for better problem solving and more creative thinking, which is why we&#8217;re dedicated to adding new perspectives to the team.</i><i> </i></p>\n<h2><b>Benefits and Perks:</b></h2>\n<p>Beyond a stellar work environment, friendly people, and inspiring work, we have some sweet benefits and perks:</p>\n<ul>\n<li>Private medical insurance including basic check-ups, hospitalization, and vital care</li>\n<li>Vision exam and discounted glasses every year</li>\n<li>Meal tickets 40 RON/working day</li>\n<li>Gift tickets 300 RON/ Easter &amp; Christmas</li>\n<li>Cultural tickets 200 RON/month</li>\n<li>Health &amp; Wellness reimbursement</li>\n<li>Professional development reimbursement program</li>\n<li>Educational Resources &#8211; Career &amp; Personal Development Program</li>\n<li>Travel discounts</li>\n<li>Birthday day off</li>\n<li>Extra days off when public holidays fall on weekend days</li>\n<li>Annual Teambuilding</li>\n<li>We are a merit-based company with many opportunities to learn, excel and grow your career!</li>\n</ul>",
        "url": "https://jobicy.com/jobs/112975-software-engineer-6",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:15:57",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/740de732ede10f0bfc582b8ac1c2bbe0.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Educational Support Representative",
        "company": "Varsity Tutors",
        "location": "USA",
        "description": "As an Educational Support Representative, you&amp;#8217;ll leverage your educational background to guide prospective students and families toward personalized learning solutions. This is a SALES position that requires a consultative approach when selling to clients. Success in this role comes from: Conducting meaningful needs assessment conversations with families Applying your teaching/training experience to recommend tailored learning&amp;#8230;",
        "html_description": "<p>As an Educational Support Representative, you&#8217;ll leverage your educational background to guide prospective students and families toward personalized learning solutions. This is a <strong>SALES</strong> position that requires a consultative approach when selling to clients. Success in this role comes from:</p>\n<ul>\n<li>Conducting meaningful needs assessment conversations with families</li>\n<li>Applying your teaching/training experience to recommend tailored learning solutions</li>\n<li>Building trust through consultative conversations</li>\n<li>Demonstrating subject matter expertise in educational products and services</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>Bachelor&#8217;s degree preferred</li>\n<li>3+ years teaching, training, or educational sales experience strongly preferred</li>\n<li>Demonstrated success in metrics-driven environments</li>\n<li>Ability to work a <strong>FULL-TIME</strong> schedule, including some evenings and weekends</li>\n<li>Strong technical aptitude and ability to learn new systems quickly</li>\n<li>Stable, distraction-free remote work environment</li>\n<li>Reliable high-speed internet connection</li>\n<li>Understand and appreciate that Nerdy is an apolitical company and that we can have the largest impact if we are united in our focus on helping people learn and not divided or distracted by advancing unrelated causes<strong> </strong></li>\n</ul>\n<h2>Our most successful Educational Support Representatives typically bring</h2>\n<ul>\n<li>Educational experience and expertise (particularly from teaching and working directly with students and parents)</li>\n<li>Proven track record of exceeding metrics and performance goals</li>\n<li>Career progression showing increased responsibility and leadership</li>\n<li>Experience in needs assessment and solution-based selling</li>\n<li>Commitment to continuous learning and professional development</li>\n</ul>\n<h2><strong>Career Growth &amp; Development</strong></h2>\n<p>This role offers clear pathways for advancement based on performance:</p>\n<ul>\n<li>Structured promotion track from Educational Support Representative to Senior Sales Representative</li>\n<li>Merit-based advancement opportunities into training, management, and other business areas</li>\n<li>Comprehensive paid training program focusing on educational consulting and sales excellence</li>\n<li>Mentorship and leadership development opportunities</li>\n</ul>\n<h2><strong>Pay/Benefits</strong></h2>\n<p>We offer a competitive compensation package including:</p>\n<ul>\n<li>$40,000 base salary plus $3,000 annual variable compensation target</li>\n<li>Performance-based advancement opportunities with increased earning potential</li>\n<li>Comprehensive healthcare benefits</li>\n<li>401(k) matching with immediate vesting (no waiting period)</li>\n<li>Paid training and professional development</li>\n<li>Company-provided MacBook and equipment</li>\n<li>Free Varsity Tutors Learning Membership for your household</li>\n</ul>\n<p><strong>Location:</strong> Fully Remote Position</p>\n<p><strong>Upcoming Start Dates/Training: </strong>Two week paid virtual training will take place Monday &#8211; Friday 9am-6pm Central Time</p>\n<p><em>Nerdy is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. (INDHP)</em></p>",
        "url": "https://jobicy.com/jobs/116053-educational-support-representative-2",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:10:22",
        "salary": "USD 40,000+",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210313085850-559044.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Business Systems Manager",
        "company": "Makeship",
        "location": "Canada",
        "description": "As an early member of the team, you’ll play a huge role in shaping our culture, our process, and the future of Makeship. Every day, you’ll collaborate learn more about the content creation space, and watch your work make an impact (on the company and their community!). We want this to be the best work&amp;#8230;",
        "html_description": "<p>As an early member of the team, you’ll play a huge role in shaping our culture, our process, and the future of Makeship. Every day, you’ll collaborate learn more about the content creation space, and watch your work make an impact (on the company and their community!).</p>\n<p>We want this to be the best work experience of your life, so we’ll pay you well, offer great benefits, invest deeply in your growth, and welcome you with our branded swag. You will also be joining one of Canada&#8217;s fastest-growing start-up companies!</p>\n<h2>What We Are Looking For</h2>\n<p>We are looking for a Business Systems Manager to optimize and scale the tools, workflows and systems that power Makeship’s product design and development, customer service, and supply chain. This role will leverage data insights &amp; user feedback to drive improvements, ensure system performance and seamless integrations, and enhance operational efficiency across teams.</p>\n<p>Ideal candidates have experience building, managing, and scaling business systems via low-code platforms (e.g., Airtable). Strong stakeholder &amp; project management skills are essential, as this role will lead cross-functional initiatives across the supply chain. Mandarin Chinese fluency is a strong plus.</p>\n<h2>Your Key Responsibilities</h2>\n<ul>\n<li>Manage and optimize operational systems across product development, customer service, and supply chain to ensure efficiency, scalability, and alignment with business goals.</li>\n<li>Lead the development and integration of tools &amp; workflows, ensuring seamless cross-team collaboration and automation, particularly within Airtable and other low-code SaaS/PaaS platforms.</li>\n<li>Streamline supply chain, manufacturing, and fulfilment processes, enhancing efficiency and improving both internal workflows and customer experience.</li>\n<li>Own data reporting &amp; analysis, setting up dashboards and tracking key operational metrics to identify improvements across product development, supply chain, and customer service.</li>\n<li>Collaborate cross-functionally with stakeholders from all teams across Makeship, ensuring tools and initiatives align with broader business strategy and goals.</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>5+ years of experience in supply chain operations, systems management, or business process optimization, with a track record of scaling and managing cross-functional tools and workflows.</li>\n<li>Expertise in managing and optimizing tools such as low-code SaaS/PaaS platforms (e.g., Airtable), automation/API platforms (e.g., Zapier), ticketing systems (e.g., JIRA, Zendesk), and CRM/e-commerce platforms (e.g., HubSpot, Shopify).</li>\n<li>Hands-on coding skills &amp; experience (e.g., JavaScript) for automation and software customization. Strong foundation in data analytics (e.g., SQL), with experience turning data into actionable business insights.</li>\n<li>Bachelor’s degree in Business, Operations, Computer Science, Engineering, or a related field.</li>\n<li>Strong stakeholder &amp; project management skills — able to lead cross-functional collaboration and manage complex, multi-team initiatives.</li>\n<li>Driven to deliver high-quality work, achieve operational excellence, and produce impactful outcomes.</li>\n<li>Eager to learn, grow, and adapt in a fast-paced environment. Open to feedback and constantly seeking improvement.</li>\n</ul>\n<h2>Bonus</h2>\n<ul>\n<li>Fluency in Mandarin Chinese for collaboration with supply chain teams.</li>\n<li>Experience in business or supply chain operations, especially in a fast-scaling e-commerce environment.</li>\n<li>Experience deploying and monitoring systems at scale in a cloud environment.</li>\n<li>Experience working in remote or distributed teams.</li>\n<li>Passion for the creator economy and digital content space.</li>\n</ul>\n<h2>Benefits &amp; Perks</h2>\n<ul>\n<li>Work remotely anywhere in Canada and/or access any of our hubs</li>\n<li>Health and dental benefits from day 1</li>\n<li>4 weeks of paid vacation (including paid time off on your birthday)</li>\n<li>Additional 1 week of paid time off during the holidays</li>\n<li>Monthly phone allowance</li>\n<li>$400 home office setup allowance</li>\n<li>RRSP Matching Program</li>\n<li>Pregnancy and Parental Leave Top-up Program</li>\n<li>Education Assistance Program</li>\n<li>Employee Referral Program</li>\n</ul>\n<p>Salary Band: $95-115K CAD per annum. Individual salaries will be dependent on unique skills, experience and qualifications.</p>\n<p><em>At Makeship we are committed to fostering an environment that welcomes people of all backgrounds, experiences, and identities. We are passionate about building an equitable and inclusive culture for our unique and diverse team of employees which makes us Makeship. As an equal-opportunity employer, we value and embrace everyone&#8217;s opinions and differences, and actively seek new Makeshippers who will work respectfully with our team, propelling our company and the community forward. If there are any accommodations we can provide to make your interview experience more accessible and inclusive, please let us know in your application.</em></p>",
        "url": "https://jobicy.com/jobs/116054-systems-operations-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:09:35",
        "salary": "CAD 95,000 - 115,000",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/05/Jobicy-210504193703-328994.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Marketing Assistant",
        "company": "Scorpion",
        "location": "USA",
        "description": "Scorpion is the leading provider of technology and services helping local businesses thrive. We do this by helping customers understand local market dynamics, make the most of their marketing, and deliver experiences their customers will love. We offer tools to know what’s going on with marketing, competitors, and customers. We offer a unique blend of&amp;#8230;",
        "html_description": "<p>Scorpion is the leading provider of technology and services helping local businesses thrive. We do this by helping customers understand local market dynamics, make the most of their marketing, and deliver experiences their customers will love. We offer tools to know what’s going on with marketing, competitors, and customers. We offer a unique blend of AI support and teams of real human people with local expertise committed to customer success. At Scorpion, we are ready to do whatever it takes to help our clients reach their goals. Our technology and personalized tools bring everything together to help local businesses easily understand their unique business, market, and customer needs. We put SEO, Reviews, Advertising, Email Marketing, Chat and Messaging, Social Media, Website, Lead Management, Appointment Scheduling, and more to work for local businesses. We’re a technology-led service with a human touch.</p>\n<h2>About the Role:</h2>\n<p>We’re looking for a detail-oriented and motivated individual to join our team as a Marketing Assistant. No prior experience in digital marketing is required—just a strong willingness to learn and an interest in marketing.</p>\n<p>In this role, you’ll receive structured training and hands-on experience in digital advertising. You’ll work closely with account managers to support client digital campaign execution and ensuring seamless coordination across teams.</p>\n<h2>What your success will look like:</h2>\n<ul>\n<li>Manage and track all campaign requests and project updates for internal teams, clients, and agency partners.</li>\n<li>Organize and oversee creative assets, ensuring they are properly stored and accessible.</li>\n<li>Communicate updates on upcoming campaigns, assets, and landing pages across teams, clarifying outstanding questions or issues.</li>\n<li>Monitor and track new landing page requests, ensuring quality and timely delivery.</li>\n<li>Support project coordination and tracking, helping the team stay organized and on schedule.</li>\n<li>Participate in weekly client calls, providing clear and concise campaign launch updates.</li>\n<li>Join status meetings with agency partners to align on project progress and priorities.</li>\n</ul>\n<h2>Who you are and what you bring:</h2>\n<ul>\n<li>Education: Bachelor&#8217;s degree in Marketing, Advertising, Business, Communications, or a related field—or equivalent practical experience.</li>\n<li>Experience: 0-1 year, including internships. Great for recent graduates or early-career professionals.</li>\n<li>Skills:\n<ul>\n<li>Exposure to digital marketing through coursework or experience in SEO, SEM, or social media.</li>\n<li>Familiarity with content management systems (CMS) and customer support platforms (CS).</li>\n<li>Strong communication skills, with the ability to engage professionally with internal teams and external partners.</li>\n<li>Highly organized and detail-oriented, with a proactive approach to tracking projects and meeting deadlines.</li>\n</ul>\n</li>\n</ul>\n<h2>Our Scorpion Values:</h2>\n<p><strong>Winning Mindset:</strong>  When our clients win, we win.<br />\n<strong>Genuine Care: </strong> We only succeed when we are truly invested in our clients and each other.<br />\n<strong>Unmatched Results:</strong>  We deliver more than expected–and then some–driving the best results and impacting lives.<br />\n<strong>Constant Improvement: </strong> We believe there is always a better way. We learn we ask “What if?” we build and then do it again.<br />\n<strong>Unbeatable Teamwork:</strong>  We come from different backgrounds but have the same vision. We only get there by doing it together, as a team.</p>\n<h2>Our Benefits:</h2>\n<p>We invest in our employees by offering them diverse benefits from best-in-class carriers. These benefits provide enough choice and flexibility to keep our employees and their families healthy and happy—today and tomorrow.</p>\n<ul>\n<li>100% employer-paid medical, dental, and vision insurance</li>\n<li>Flexible paid time off, so you can rest, relax, and recharge away from work</li>\n<li>Employee equity program</li>\n<li>Paid parental leave</li>\n<li>Paid cell phone and service</li>\n<li>Remote office allowance</li>\n<li>Professional development and development courses</li>\n<li>Regular manager check-ins to drive performance and career growth through Lattice</li>\n</ul>\n<h2>Compensation:</h2>\n<p>We acknowledge that states have passed legislation promoting pay transparency. As a national employer, Scorpion has made the decision to post our expected pay rate or pay range (as applicable) in all our job postings, regardless of geographic location.</p>\n<ul>\n<li>The base salary range is $52,000 (entry-level) &#8211; $60,000 (highly experienced), exclusive of fringe benefits. If you are hired at Scorpion, your final base salary compensation will be determined based on factors such as geographic location, skills, education, and/or experience. Additionally, we believe in the importance of pay equity and consider the internal equity of our current team members as a part of any final offer. Please keep in mind that the range mentioned above is the total salary range for the role. Hiring at the maximum of the range would not be typical in order to allow for future &amp; continued salary growth. The compensation package may also include incentive compensation opportunities in the form of discretionary bonuses or commissions.</li>\n<li>The compensation package may also include incentive compensation opportunities in the form of discretionary bonuses or commissions.</li>\n</ul>\n<p>Scorpion is an equal opportunity employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, or physical or mental disability. We believe in creating a dynamic work environment that values diversity and inclusion.</p>\n<p>Scorpion participates in the E-Verify program to confirm employment authorization of all newly hired employees. The E-Verify process is completed during new hire onboarding and completion of the Form I-9, Employment Eligibility Verification, at the start of employment. E-Verify is not used as a tool to pre-screen candidates. For more information on E-Verify, please visit www.uscis.gov.</p>",
        "url": "https://jobicy.com/jobs/116055-marketing-assistant",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:07:30",
        "salary": "USD 52,000 - 60,000",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/5d0f5219d1a5557d70758202f92e0076.png",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Compliance Program Manager",
        "company": "Dropbox",
        "location": "USA",
        "description": "Protecting Dropbox and our users is critical to being worthy of trust. As a Compliance Program Manager at Dropbox, you will join a growing team to design, implement, and coordinate programs to promote user trust and manage risks to their data. You will work with teams across the organization, from Engineering, Product, &amp;amp; Infrastructure, to&amp;#8230;",
        "html_description": "<p>Protecting Dropbox and our users is critical to being worthy of trust. As a Compliance Program Manager at Dropbox, you will join a growing team to design, implement, and coordinate programs to promote user trust and manage risks to their data. You will work with teams across the organization, from Engineering, Product, &amp; Infrastructure, to Sales to Customer Experience, in order to manage risks to Dropbox and users alike. You will work in depth with other parts of the business to ensure Dropbox meets our security, privacy, and regulatory commitments.</p>\n<p>If you are passionate about protecting Dropbox and our users, are looking for an opportunity to stretch and grow yourself in a dynamic team, and thrive in an environment where you can constantly learn, then this role is for you.</p>\n<p>As a Compliance Program Manager on the Governance, Risk, &amp; Compliance team, you will play a crucial role in building Compliance across our product set. You will be responsible for completing all compliance related tasks to enable our products to be a secure, safe, and effective platform for individual users and businesses that meets global compliance standards and regulatory requirements.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Promote and foster a culture of trust within and outside of Dropbox.</li>\n<li>Partner with teams to execute on cross-team and/or multi-phase projects from design through implementation against a wide variety of regulatory and compliance frameworks (SOC 1/2/3/, ISO 27001, ISO 27017, ISO 27018, ISO 22301, ISO 27701, ISO 42001, HIPAA, NIST, ISMAP, etc.)</li>\n<li>Identify the right solutions to clarify and solve ambiguous, open-ended problems across various compliance programs.</li>\n<li>Mature our overall compliance program. Improve and implement controls for internal systems, processes, and policies through bold and innovative approaches.</li>\n<li>Facilitate ongoing risk and compliance initiatives and monitor control effectiveness.</li>\n<li>Collaborate with internal teams and external auditors throughout compliance assessments.</li>\n<li>Play an active part in responding and mitigating compliance challenges across multiple time zones and jurisdictions.</li>\n<li>Drive automation efforts across the Compliance function via the ServiceNow GRC module</li>\n<li>Identify opportunities impacting the Compliance function and establish the strategy and cross-functional alignment to achieve these objectives.</li>\n<li>Conduct gap assessments to identify areas of non-compliance or areas for improvement, and develop action plans to address these gaps.</li>\n<li>Provide guidance to management on the impact of new laws and regulations and recommend changes in business practices where necessary.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>8+ years of experience building or maintaining compliance programs across a wide variety of regulatory and compliance frameworks (SOC 1/2/3/, ISO 27001, ISO 27017, ISO 27018, ISO 22301, ISO 27701, ISO 42001, HIPAA, NIST, ISMAP, etc.).</li>\n<li>Familiarity with a broad range of technical concepts relevant to cloud computing environments: logical access, agile development process, security architecture, information security, network security, and privacy.</li>\n<li>Deep subject matter expertise in Compliance programs, preferably within the Tech Sector.</li>\n<li>Strong project management and organizational skills.</li>\n<li>Great people skills and ability to work well in fast paced team environment with a wide range of technical and non-technical teams.</li>\n<li>Excellent writing, communication, and organizational skills &#8211; strong attention to detail.</li>\n<li>Ability to confidently convey nuanced information to senior leaders.</li>\n</ul>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience at a fast paced technology company.</li>\n<li>Ability to communicate complex topics succinctly to a wide range of audiences, including executives</li>\n<li>Sufficient technical knowledge to have effective conversations with Dropbox engineers and product teams.</li>\n</ul>\n<h2>Compensation</h2>\n<p>US Zone 1<br />\nThis role is not available in Zone 1</p>\n<p>US Zone 2<br />\n$156,100—$211,100 USD</p>\n<p>US Zone 3<br />\n$138,700—$187,700 USD</p>\n<p>The range(s) listed above is the expected annual salary/OTE (On-Target Earnings) for this role, subject to change.</p>\n<p>Please note, OTE are for sales roles only.</p>\n<p>Salary/OTE is just one component of Dropbox’s total rewards package. All regular employees are also eligible for the corporate bonus program or a sales incentive (target included in OTE) as well as stock in the form of Restricted Stock Units (RSUs).</p>\n<p>Dropbox takes a number of factors into account when determining individual starting pay, including job and level they are hired into, location/metropolitan area, skillset, and peer compensation.  We target most new hire offers between the minimum up to the middle of the range.</p>\n<p>Dropbox uses the zip code of an employee’s remote work location to determine which metropolitan pay range we use. Current US Zone locations are as follows:</p>\n<p>• US Zone 1: San Francisco metro, New York City metro, or Seattle metro<br />\n• US Zone 2: Austin (TX) metro, Chicago metro, California (outside SF metro), Colorado, Connecticut (outside NYC metro), Delaware, Massachusetts, New Hampshire, New York (outside NYC metro), Oregon, Pennsylvania (outside NYC or DC metro), Washington DC metro, and West Virginia (DC metro)<br />\n• US Zone 3: All other US locations</p>\n<h2>Benefits</h2>\n<p>Dropbox is committed to investing in the holistic health and wellbeing of all Dropboxers and their families. Our benefits and perks programs include, but are not limited to:</p>\n<ul>\n<li>Competitive medical, dental, and vision coverage</li>\n<li>401(k) plan with a generous company match and immediate vesting</li>\n<li>Flexible PTO/Paid Time Off, paid holidays, Volunteer Time Off, and more, allowing you time to unplug, unwind, and refresh</li>\n<li>Income Protection Plans: Life and disability insurance</li>\n<li>Business Travel Protection: Travel medical and accident insurance</li>\n<li>Perks Allowance to be used on what matters most to you, whether that’s wellness, learning and development, food and groceries, and much more</li>\n<li>Parental benefits including: Parental Leave, Child and Adult Care, Day Care FSA, Fertility Benefits, Adoption and Surrogacy Support, and Lactation Support</li>\n<li>Access to over 10,000 global co-working spaces through Gable.to, making it easy to book flexible workspaces for collaboration or individual work</li>\n<li>Quarterly Cell phone and internet allowance</li>\n<li>Mental health and wellness benefits</li>\n<li>Disability and neurodivergence support benefits</li>\n</ul>\n<p>Additional benefit details are available upon request.</p>",
        "url": "https://jobicy.com/jobs/116719-compliance-program-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:05:54",
        "salary": "USD 138,700 - 211,100",
        "job_type": "full-time",
        "category": "Legal &amp; Compliance",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200923071227-398427.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Senior Web Designer, Customer Education",
        "company": "Webflow",
        "location": "USA",
        "description": "We’re looking for a Senior Web Designer to help craft engaging and intuitive digital experiences for Webflow University. You’ll craft user flows, wireframes, and interactive content while designing eye-catching graphics, illustrations, and branded elements. Plus, you’ll build a scalable design system that keeps everything looking sharp. If you have a knack for designing seamless SaaS&amp;#8230;",
        "html_description": "<p>We’re looking for a Senior Web Designer to help craft engaging and intuitive digital experiences for Webflow University. You’ll craft user flows, wireframes, and interactive content while designing eye-catching graphics, illustrations, and branded elements. Plus, you’ll build a scalable design system that keeps everything looking sharp. If you have a knack for designing seamless SaaS or enterprise websites, love creating smooth navigation experiences, and have a genuine interest in education, we’d love to hear from you!</p>\n<h2><strong>About the role:</strong></h2>\n<ul>\n<li>Location: Remote-first (United States)</li>\n<li>Full-time</li>\n<li>Permanent</li>\n<li>Exempt</li>\n<li>The cash compensation for this role is tailored to align with the cost of labor in different geographic markets. We&#8217;ve structured the base pay ranges for this role into zones for our geographic markets, and the specific base pay within the range will be determined by the candidate’s geographic location, job-related experience, knowledge, qualifications, and skills.\n<ul>\n<li>United States  (all figures cited below are in USD and pertain to workers in the United States)\n<ul>\n<li>Zone A: $114,950 &#8211; $155,800</li>\n<li>Zone B: $108,300 &#8211; $146,300</li>\n<li>Zone C: $101,000 &#8211; $137,275</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>This role is also eligible to participate in Webflow&#8217;s company-wide bonus program. Target amounts are a percentage of base salary and vary by career level. Payouts are based on company performance against established financial and operational goals.</p>\n<ul>\n<li>Reporting to the Sr. Manager, Education Platforms</li>\n</ul>\n<h2>As a <strong>Senior Web Designer </strong>you’ll …</h2>\n<ul>\n<li>Collaborate with Webflow University Platform team to execute on large-scale initiatives as well as to support ad hoc projects</li>\n<li>Create intuitive user flows, wireframes, prototypes, and interactive content</li>\n<li>Develop and maintain visual assets such as illustrations, graphics, and branded elements to ensure a cohesive and engaging customer education experience</li>\n<li>Build and maintain a design system for Customer Education, including brand guidelines, design specifications and reusable components</li>\n</ul>\n<p>In addition to the responsibilities outlined above, at Webflow we will support you in identifying where your interests and development opportunities lie and we&#8217;ll help you incorporate them into your role.</p>\n<h2><strong>About you:</strong></h2>\n<p>You’ll thrive as a <strong>Senior Web Designer</strong> if you:</p>\n<ul>\n<li>Have experience designing, developing, and maintaining websites for SaaS and/or enterprise software products. Bonus points if it was focused on customer education or product enablement.</li>\n<li>Are proficient in Figma or similar tools to create wireframes, prototypes and high-fidelity mockups, familiarity with designing in Webflow is a plus!</li>\n<li>Have experience designing intuitive navigation structures and search functionalities to enhance content discoverability and user experience.</li>\n<li>Thrive in ambiguous environments by proactively identifying solutions, taking initiative, and driving clarity.</li>\n<li>Are a strong communicator with the ability to articulate design decisions, navigate feedback, and build alignment with stakeholders.</li>\n</ul>\n<h2><strong>Our Core Behaviors:</strong></h2>\n<ul>\n<li><strong>Obsess over customer experience.</strong> We deeply understand <em>what</em> we’re building and <em>who</em> we’re building for and serving. We define the leading edge of what’s possible in our industry and deliver the future for our customers</li>\n<li><strong>Move with heartfelt urgency.</strong> We have a healthy relationship with impatience, channeling it thoughtfully to show up better and faster for our customers and for each other. Time is the most limited thing we have, and we make the most of every moment</li>\n<li><strong>Say the hard thing with care.</strong> Our best work often comes from intelligent debate, critique, and even difficult conversations. We speak our minds and don’t sugarcoat things — and we do so with respect, maturity, and care</li>\n<li><strong>Make your mark.</strong> We seek out new and unique ways to create meaningful impact, and we champion the same from our colleagues. We work as a <em>team</em> to get the job done, and we go out of our way to celebrate and reward those going above and beyond for our customers and our teammates</li>\n</ul>\n<h2><strong>Benefits &amp; wellness</strong></h2>\n<ul>\n<li>Equity ownership (RSUs) in a growing, privately-owned company</li>\n<li>100% employer-paid healthcare, vision, and dental insurance coverage for full-time employees (working 30+ hours per week) and their dependents. Full-time employees may also be eligible for voluntary insurance options where applicable in the respective country of employment</li>\n<li>12 weeks of paid parental leave for both birthing and non-birthing caregivers, as well as an additional 6-8 weeks of pregnancy disability leave for birthing parents to be used before child bonding leave (note: where local requirements are more generous, employees receive the greater benefit); full-time employees also have access to family planning care and reimbursement</li>\n<li>Flexible PTO for all locations and sabbatical program</li>\n<li>Access to mental wellness and professional coaching, therapy, and Employee Assistance Program</li>\n<li>Monthly stipends to support work and wellness</li>\n<li>401k plan or pension schemes (in countries where statutorily required), and other financial wellness benefits, like CPA and financial advisor coverage</li>\n</ul>\n<p><em>Temporary employees may be eligible for paid holiday and time off, statutory leaves of absence, and company-sponsored medical benefits depending on their Fixed Term Contract and their country/state of employment.</em></p>\n<h2><strong>Remote, together</strong></h2>\n<p>At Webflow, equality is a core tenet of our culture. We are an Equal Opportunity (EEO)/Veterans/Disabled Employer and are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law. Pursuant to the San Francisco Fair Chance Ordinance, Webflow will consider for employment qualified applicants with arrest and conviction records.</p>",
        "url": "https://jobicy.com/jobs/116718-senior-web-designer-customer-education-2",
        "source": "Jobicy",
        "posted_at": "2025-04-05 03:00:46",
        "salary": "USD 101,000 - 155,800",
        "job_type": "full-time",
        "category": "Web &amp; App Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b75fa7e9-221.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-08"
    },
    {
        "title": "Community Engagement Consultant",
        "company": "Granicus",
        "location": "Australia,  New Zealand",
        "description": "Granicus Australia/New Zealand (ANZ) is seeking a passionate and strategic Community Engagement Consultant to work with government agencies, and organisations in health and utility sectors, to improve their community engagement practices. The ideal candidate will be responsible for advising and supporting government agencies in developing and implementing effective community engagement strategies that align with policy&amp;#8230;",
        "html_description": "<p>Granicus Australia/New Zealand (ANZ) is seeking a passionate and strategic <b>Community Engagement Consultant</b> to work with government agencies, and organisations in health and utility sectors, to improve their community engagement practices. The ideal candidate will be responsible for advising and supporting government agencies in developing and implementing effective community engagement strategies that align with policy objectives and public interests. This role requires strong expertise in fostering relationships, building trust, and enhancing participatory processes within government-led initiatives.</p>\n<p>You will work closely with EngagementHQ clients to deliver services that enhance our clients’ engagement activities. You will mentor and provide strategic coaching to EngagementHQ clients to assist with engagement methodology and best-practice utilisation of EngagementHQ.</p>\n<p>This role sits in the Client Education and Training team and works closely with multiple teams such as Customer Success, Product, Marketing and Sales to deliver and refine our suite of engagement services.</p>\n<h2>What your impact will look like here:</h2>\n<ul>\n<li>Advise government organisations on best practices for community engagement and public participation.</li>\n<li>Assist clients with revenue generating packages to strategically plan their allocated hours, ensuring maximum value from their package and fostering motivation for renewal in subsequent years.</li>\n<li>Deliver a range of presentations in the service catalogue such as Capacity Building sessions for government agency staff [LR1] and Strategic Mentoring sessions for Community Engagement teams.</li>\n<li>Liaise with Product Trainers and Data Analysts to coordinate and assign tasks related to service catalog delivery, ensuring effective communication of task requirements and alignment with engagement objectives.</li>\n<li>Maintain and enhance the current services catalog, evolving and developing new services to address client needs and align with emerging community engagement trends.</li>\n<li>Conduct regular outreach efforts to ensure continuous engagement and to drive increased participation in services by keeping clients informed and motivated to use their package hours.</li>\n<li>Organise and lead client networking sessions to foster valuable connections, encourage knowledge sharing, and strengthen relationships that drive future collaboration and business growth.</li>\n<li>Work with the Marketing team to attend engagement events, such as the IAP2 conference, and represent Granicus products and services at industry events.</li>\n<li>Work with Granicus&#8217;s marketing team to facilitate and host webinars with community engagement industry thought leaders on topical community engagement issues.</li>\n<li>Provide training and capacity-building training internally to upskill Granicus staff in contemporary community engagement methodologies.</li>\n<li>Stay up to date on federal and local community engagement legislation, trends, challenges, and opportunities.</li>\n</ul>\n<h2>You will love this job if you have:</h2>\n<ul>\n<li>IAP2 Certificate of Engagement mandatory</li>\n<li>Bachelor’s degree in Communications, Public Relations, Social Work, Community Development, Public Administration, or a related field.[YP1] [LR2]</li>\n<li>10+ years of community engagement experience in local and/or state government.</li>\n<li>Demonstrated experience working on major infrastructure projects.</li>\n<li>Demonstrated experience working on high outrage/contentious projects.</li>\n<li>Experience facilitating community panels and deliberative panels.</li>\n<li>Proven experience advising government organizations on community engagement strategies.</li>\n<li>Strong interpersonal and communication skills, with the ability to engage diverse audiences and facilitate complex discussions.</li>\n<li>Experience in policy development, strategic planning, and stakeholder engagement.</li>\n<li>Proficiency in using tools for outreach.[LR3] [YP4]</li>\n<li>Proficiency in using online engagement platforms (preferably EngagementHQ) for community engagement projects. You will need to demonstrate your best practice utilisation of online engagement platforms and how this helped achieve your engagement outcomes on past projects.</li>\n<li>Ability to work independently and collaboratively in a dynamic environment.</li>\n<li>Strong organisational and multitasking skills with the ability to manage and follow up on multiple client accounts while consistently delivering outstanding customer service.</li>\n<li>Strong presentation and public speaking skills with the ability to effectively engage diverse audiences</li>\n<li>Demonstrated experience creating consultation reports, analyzing, and presenting consultation data to stakeholders.</li>\n<li>Experience creating interactive dashboards in business intelligence tools such as Power BI, Tableau, or Zoho Analytics is a plus.</li>\n<li> Proficiency in Microsoft Suite (Outlook, Teams, Word and Excel etc[LR1] .) and project management tools such as Wrike.</li>\n<li>Knowledge of federal, state and local government community engagement legislation and trends.</li>\n</ul>\n<p>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit!</p>\n<h2><b>Security and Privacy Requirements</b></h2>\n<ul>\n<li>Responsible for Granicus information security by appropriately preserving the Confidentiality, Integrity, and Availability (CIA) of Granicus information assets in accordance with the company&#8217;s information security program.</li>\n<li>Responsible for ensuring the data privacy of our employees and customers, their data, as well as taking all required privacy training in a timely manner, in accordance with company policies.</li>\n</ul>\n<h2><b>The Team</b></h2>\n<ul>\n<li>We are a remote-first company with a globally distributed workforce across the United States, Canada, United Kingdom, India, Armenia, Australia, and New Zealand.</li>\n</ul>\n<h2><b>The Culture</b></h2>\n<ul>\n<li>At Granicus, we are building a transparent, inclusive, and safe space for everyone who wants to bea part of our journey.</li>\n<li>A few culture highlights include – Employee Resource Groups to encourage diverse voices</li>\n<li>Coffee with Mark sessions – Our employees get to interact with our CEO on very important andsometimes difficult issues ranging from mental health to work-life balance and current affairs.</li>\n<li>Microsoft Teams communities focused on wellness, art, furbabies, family, parenting, and more.-=- &#8211; We bring in special guests from time to time to discuss issues that impact our employee</li>\n<li>population</li>\n</ul>\n<p><i>Granicus is committed to providing equal employment opportunities. All qualified applicants and employees will be considered for employment and advancement without regard to race, color, religion, creed, national origin, ancestry, sex, gender, gender identity, gender expression, physical or mental disability, age, genetic information, sexual or affectional orientation, marital status, status regarding public assistance, familial status, military or veteran status or any other status protected by applicable law.</i></p>",
        "url": "https://jobicy.com/jobs/116717-community-engagement-consultant",
        "source": "Jobicy",
        "posted_at": "2025-04-05 02:57:59",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c3b43ee4862a75f6e3a7bd3f4f08630d.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-08"
    }
]