[
    {
        "title": "Customer Experience Associate, Account Security",
        "company": "Discord",
        "location": "Netherlands",
        "description": "As a team member, you’ll be on the frontlines of supporting our communities, listening to their feedback, and sharing these insights with other stakeholders to help make the Discord experience the best it can be! If you’re looking for an amazing support team, join us! What You&amp;#8217;ll Be Doing Working the Morning Shift on Tuesday&amp;#8230;",
        "html_description": "<p>As a team member, you’ll be on the frontlines of supporting our communities, listening to their feedback, and sharing these insights with other stakeholders to help make the Discord experience the best it can be! If you’re looking for an amazing support team, join us!</p>\n<h2><strong>What You&#8217;ll Be Doing</strong></h2>\n<ul>\n<li>Working the Morning Shift on Tuesday to Saturday (9 AM to 6 PM CEST)\n<ul>\n<li>We work remotely but expect you to occasionally be present in our Amsterdam office to connect with the team.</li>\n<li>Candidates must be local.</li>\n</ul>\n</li>\n<li>Delivering timely, accurate, and thoughtful responses to our users’ questions and requests through our support channels.</li>\n<li>Investigating user account requests, providing timely, accurate, and educational responses to our users.</li>\n<li>Monitoring Discord user security trends, identify opportunities for improved operational efficiency, and provide actionable feedback to partners.</li>\n<li>Ensuring the security and integrity of user accounts by implementing and enforcing security protocols and best practices.</li>\n<li>Investigating and resolving suspicious or unauthorized account activities, including identifying potential security breaches.</li>\n<li>Collaborating with cross-functional teams to address user account issues and implement solutions that enhance user experience and security.</li>\n<li>Educating users on account security measures and promote awareness of potential risks and vulnerabilities.</li>\n<li>Maintaining accurate records of user interactions and resolutions, and contribute to developing support documentation and knowledge base resources.</li>\n</ul>\n<h2><strong>What you should have</strong></h2>\n<ul>\n<li>Proficiency in troubleshooting account-related issues.</li>\n<li>Excellent communication skills, both written and verbal, with the ability to explain technical concepts clearly to non-technical users.</li>\n<li>Only English is necessary, but any of the following languages are a plus: Brazilian Portuguese, Russian, French, German, and Turkish with both written and speaking fluency.</li>\n<li>Ability to work collaboratively in a fast-paced environment and prioritize tasks effectively.</li>\n<li>Technical skills with knowledge of desktop and mobile operating systems.</li>\n<li>Experience with customer service solutions platforms.</li>\n<li>A passion for building communities and belief in our mission at Discord.</li>\n<li>A commitment to diversity and inclusion.</li>\n<li>Experience with customer support or technical support roles is required, as well as a passion for supporting our users with unwavering patience and empathy.</li>\n</ul>\n<h2><strong>Why Discord? </strong></h2>\n<p>Discord plays a uniquely important role in the future of gaming. We&#8217;re a multiplatform, multigenerational and multiplayer platform that helps people deepen their friendships around games and shared interests. We believe games give us a way to have fun with our favorite people, whether listening to music together or grinding in competitive matches for diamond rank. <strong>Join us in our mission! Your future is just a click away!</strong></p>",
        "url": "https://jobicy.com/jobs/116669-customer-experience-associate-account-security",
        "source": "Jobicy",
        "posted_at": "2025-04-02 18:21:39",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/02/WRILS-210216185819-522054.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sports Graphic Designer",
        "company": "Storyteller",
        "location": "Europe",
        "description": "Storyteller is a platform that allows brands to integrate Stories functionality into their apps and websites. The platform is in use by multiple global brands serving millions of users. We are looking for a Graphic Designer with a solid grasp of typography, typesetting, and design tools, primarily Figma and Adobe Photoshop. You&amp;#8217;ll be working with&amp;#8230;",
        "html_description": "<p>Storyteller is a platform that allows brands to integrate Stories functionality into their apps and websites. The platform is in use by multiple global brands serving millions of users.</p>\n<p>We are looking for a Graphic Designer with a solid grasp of typography, typesetting, and design tools, primarily Figma and Adobe Photoshop.</p>\n<p>You&#8217;ll be working with a friendly, talented team and have the opportunity to grow and lead both technically and in managing others. If the idea of a fast-paced, dynamic role with tonnes of opportunity for change, responsibility and innovation sounds exciting to you, then read on!</p>\n<p><strong>** PLEASE ENSURE YOUR CV AND PORTFOLIO ARE IN ENGLISH WHEN SUBMITTING YOUR APPLICATION **</strong></p>\n<p><strong>Up to 25k EUR </strong>per year (or currency equivalent) full time contractor contract</p>\n<p> Fully remote working within Europe!<br />\n✨ Exciting high growth product, relied on by leading global sports brands<br />\n Working with the latest hardware, tech stack and tools</p>\n<p><strong>The working hours for this role are 9am &#8211; 5pm UK time.</strong></p>\n<h2><strong>ABOUT US:</strong></h2>\n<p>Storyteller is a high growth B2B SaaS platform, which allows companies to integrate Stories into their owned and operated platforms. Popularised by Instagram and Snapchat, Stories are perfectly suited for boosting user engagement, audience retention, and driving advertising revenue. For customers, building their own stories experience can take years and a lot of investment however Storyteller has solved this by allowing companies to integrate in days, not years all for one monthly cost.</p>\n<p>Our end‑to‑end platform gives companies a best‑in‑class Stories experience in days with native iOS, Android, and Web SDKs, publishing tools, analytics, and ad support.</p>\n<p>We work with globally-recognised clients in US TV and Sports industries. Every day we produce work that is innovative, challenging, and enjoyed by millions of people!</p>\n<h2><strong>RESPONSIBILITIES:</strong></h2>\n<p><strong>Key areas of focus include: </strong></p>\n<ul>\n<li><strong>Software Proficiency:</strong> Figma, Adobe Photoshop, Adobe Illustrator</li>\n<li><strong>Design Principles:</strong> Grid systems, hierarchy, balance, layout, typography, typesetting, colour theory.</li>\n<li><strong>Attention to Detail:</strong> Meticulous, intelligence in layer naming and file organization.</li>\n<li><strong>Organisation:</strong> Strong organisational skills and able to manage multiple projects in a fast-paced environment.</li>\n<li><strong>Traits:</strong> Creative and conceptualisation skills, versatile and tech-savvy.</li>\n</ul>\n<p><strong>What can you expect?</strong></p>\n<ul>\n<li>Use Figma to produce high-quality content for high-profile sporting clients.</li>\n<li>Design and produce promotional materials, advertisements, and digital assets.</li>\n<li>Create visually compelling posters and digital assets</li>\n<li>Produce assets that convey a clear and effective message with impact and creative flair.</li>\n<li>Follow client accounts and competitors on digital and traditional media to research and propose ideas for engaging and innovative content.</li>\n<li>Manage time effectively to produce multiple assets per day and communicate with managers on progress.</li>\n<li>Learn and utilize collaborative tools to drive assets through internal processes.</li>\n<li>Develop your skills by learning from other team members and through independent research.</li>\n<li>Extended hours as required.</li>\n</ul>\n<h2><strong>QUALIFICATIONS:</strong></h2>\n<p><strong>What&#8217;s important to us:  </strong></p>\n<ul>\n<li>Degree/Diploma in Graphic Design, Visual Arts, or equivalent experience.</li>\n<li>Proven experience as a Graphic Designer, with a strong portfolio showcasing a range of design work.</li>\n<li>Excellent eye for detail, particularly regarding typography, layout and color.</li>\n<li>Advanced understanding of Figma.</li>\n<li>Experience with workplace collaboration tools such as Slack, Airtable.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Ability to take creative direction and work independently with minimal supervision.</li>\n<li>Ability to manage multiple projects at a time and meet strict deadlines in a fast-paced environment.</li>\n<li>Proactive individual with a high sense of urgency.</li>\n<li>Ability to adjust well to feedback and changing priorities.</li>\n<li>High work ethic, self-motivation, dependable and reliable.</li>\n<li>Fluent in English, both written and spoken. (min. C1 English)</li>\n<li>Experience with social media platforms and digital marketing.</li>\n</ul>\n<p><strong>What’s nice to have:  </strong></p>\n<ul>\n<li>Experience with design system, building one from scratch</li>\n<li>UI Design</li>\n<li>Illustrations</li>\n</ul>\n<h2><strong>RECRUITMENT PROCESS: </strong></h2>\n<p>Firstly, you will be asked to complete a design task that aims to test your skills (which you will be compensated for completing).</p>\n<p>If successful after task review, you will be invited for a 60 minute interview via MS Teams with Elia, our Design Director.</p>",
        "url": "https://jobicy.com/jobs/115278-graphic-designer-4",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:55:27",
        "salary": "EUR 25,000+",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/08/82e26b40-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Experience Partner",
        "company": "Granicus",
        "location": "USA",
        "description": "Our Experience Partners have strong experience in customer-facing environments. They are CX practitioners and delivery experts across the portfolio of Granicus services, technology, and data solutions, responsible for developing and articulating comprehensive experience proposals. Ideal candidates have experience as a human-centered design practitioner, data-driven analyst, digital content creator, technology strategist, program manager, business development manager,&amp;#8230;",
        "html_description": "<p>Our Experience Partners have strong experience in customer-facing environments. They are CX practitioners and delivery experts across the portfolio of Granicus services, technology, and data solutions, responsible for developing and articulating comprehensive experience proposals. Ideal candidates have experience as a human-centered design practitioner, data-driven analyst, digital content creator, technology strategist, program manager, business development manager, account manager and/or customer relationship manager.</p>\n<p>Our Experience Partners are involved during pre-sales and lead post-sales activities. They will maintain the executive relationships with their customers and act as a main contact for the programs they own, ensuring tight alignment, offering proactive and prescriptive advice, and ultimately resulting in outstanding Customer Success. This may include the following:</p>\n<ul>\n<li>Pre-sales alignment and experience definition.</li>\n<li>Project kickoff.</li>\n<li>Bringing industry expertise and perspective.</li>\n<li>Drive better outcomes through extensive experience, services, data, and technical expertise.</li>\n<li>Deep understanding of Granicus solutions.</li>\n<li>Alignment to and support of customer objectives.</li>\n<li>Regular customer check-ins.</li>\n<li>Ensure project operational compliance.</li>\n<li>Executive Relationship building.</li>\n<li>Owning their book of business, constituted by programs across an assigned set of customers.</li>\n<li>Being customer&#8217;s primary Point of Contact for owned programs.</li>\n<li>Protect existing program revenues and prevent/mitigate program and customer churn.</li>\n<li>Grow revenues through direct upsells within the programs and generating cross-selling leads.</li>\n</ul>\n<h2>What Your Impact Will Look Like Here</h2>\n<ul>\n<li>Develop, grow, and manage strategic customer relationships.</li>\n<li>Create and deliver effective presentations and proposals to address the specific needs of a customer or prospect.</li>\n<li>Work with customers to identify and align programs, agency, or mission objectives to improve CX outcomes.</li>\n<li>Design &amp; deliver strategic program reviews to infuse CX subject matter expertise and develop relationships with agency’s executive stakeholders.</li>\n<li>Identify and develop customer engagement and recognition opportunities.</li>\n<li>Drive organic growth by leveraging our current book of business and relationships.</li>\n<li>Work with customer to create demand for Granicus services and solutions.</li>\n<li>Collaborate with Granicus leadership to shape development of new services based on customer demand and insight.</li>\n<li>Serve as the voice of the customer, bringing their needs and concerns back into the company to inform our solutions and processes.</li>\n<li>Represent Granicus in speaking roles, panel participation, and internal or external engagements.</li>\n</ul>\n<h2>You will love this job if you have</h2>\n<ul>\n<li>2-3 years of experience in digital services, managing a portfolio of projects, including delivery, quality assurance, and growth of programs, preferably with an understanding of human-centered design best practices and approaches.</li>\n<li>Ability to serve as a trusted, strategic adviser to top professionals.</li>\n<li>Demonstrated commercial acumen and successful track record of customer or project P&amp;L management.</li>\n<li>Passion for public service, citizen engagement, service transformation and communication.</li>\n<li>Exceptional interpersonal skills for internal and external relationship building at all levels of the organization, including cross-departmental colleagues and customers.</li>\n<li>Self-motivated, flexible problem solver, who can keep the trains running (managing the routine) but can also adapt quickly and find alternative ways to get the work done.</li>\n<li>Exceptional interpersonal skills for internal and external relationship-building.</li>\n<li>Ability to thrive in a lean, self-propelling, proactive environment.</li>\n<li>Commitment to diversity of thought and consideration of different ideas.</li>\n<li>Prior to the shutdown for the Covid-19 pandemic, CXS staff were expected to be available for on-site customer meetings. This included travel in some instances. As our customers&#8217; expectations and responses to the pandemic continue to evolve, CXS team members may once again be expected to be available for in-person customer meetings.</li>\n</ul>\n<p>Potential base salary. Does not include bonus OR commission and benefits.</p>\n<p>COMPENSATION RANGE: $80,000-$90,000 USD</p>\n<p>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above, but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit!</p>\n<h2><b>Security and Privacy Requirements</b></h2>\n<ul>\n<li>Responsible for Granicus information security by appropriately preserving the Confidentiality, Integrity, and Availability (CIA) of Granicus information assets in accordance with the company&#8217;s information security program.</li>\n<li>Responsible for ensuring the data privacy of our employees and customers, their data, as well as taking all required privacy training in a timely manner, in accordance with company policies.</li>\n</ul>\n<p>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit!</p>\n<h2><b>The Team</b></h2>\n<p>We are a remote-first company with a globally distributed workforce across the United States, Canada, United Kingdom, India, Armenia, Australia, and New Zealand.</p>\n<h2><b>The Culture</b></h2>\n<ul>\n<li>At Granicus, we are building a transparent, inclusive, and safe space for everyone who wants to be</li>\n<li>a part of our journey.</li>\n<li>A few culture highlights include – Employee Resource Groups to encourage diverse voices</li>\n<li>Coffee with Mark sessions – Our employees get to interact with our CEO on very important and</li>\n<li>sometimes difficult issues ranging from mental health to work-life balance and current affairs.</li>\n<li>Microsoft Teams communities focused on wellness, art, furbabies, family, parenting, and more.-=- &#8211; We bring in special guests from time to time to discuss issues that impact our employee</li>\n<li>population</li>\n</ul>\n<h2><b>The Benefits</b></h2>\n<p>At Granicus, we offer a competitive benefits package that allows employees to tailor benefits to their needs. Benefits listed below are for employees based in the U.S.</p>\n<ul>\n<li>&#8211; Flexible Time Off</li>\n<li>&#8211; Medical (includes an option that is paid 100% by Granicus!), Dental &amp; Vision Insurance</li>\n<li>&#8211; 401(k) plan with matching contribution</li>\n<li>&#8211; Paid Parental Leave</li>\n<li>&#8211; Employer-paid Short and Long Term Disability Insurance, Group Term Life Insurance and AD&amp;D Insurance</li>\n<li>&#8211; Group legal coverage</li>\n<li>&#8211; And more!</li>\n</ul>\n<p><i>Granicus is committed to providing equal employment opportunities. All qualified applicants and employees will be considered for employment and advancement without regard to race, color, religion, creed, national origin, ancestry, sex, gender, gender identity, gender expression, physical or mental disability, age, genetic information, sexual or affectional orientation, marital status, status with regard to public assistance, familial status, military or veteran status or any other status protected by applicable law.</i></p>",
        "url": "https://jobicy.com/jobs/116657-experience-partner",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:52:44",
        "salary": "USD 80,000 - 90,000",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c3b43ee4862a75f6e3a7bd3f4f08630d.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Full Stack Engineer",
        "company": "Bixal",
        "location": "USA",
        "description": "Bixal is a consulting company based in Fairfax, VA, working alongside governments and organizations to help them deliver better services and experiences to the communities they serve. Using evidence-based knowledge and technology, Bixal empowers clients to deliver on their missions more effectively by fostering a culture of learning and continuous improvement. Location This role can&amp;#8230;",
        "html_description": "<p>Bixal is a consulting company based in Fairfax, VA, working alongside governments and organizations to help them deliver better services and experiences to the communities they serve. Using evidence-based knowledge and technology, Bixal empowers clients to deliver on their missions more effectively by fostering a culture of learning and continuous improvement.</p>\n<h2><b>Location</b></h2>\n<p>This role can work remotely from anywhere in the USA. You must be legally authorized to work in the US. Bixal does not provide visa sponsorship.</p>\n<h2><b>What will you do?</b></h2>\n<p>We are looking for a <b>Full Stack Engineer</b> to develop and maintain front-end components and back-end services that power the <b>VA.gov platform and VA Health &amp; Benefits mobile app</b>. This role is perfect for someone passionate about <b>accessible, scalable, and secure government digital services</b>.</p>\n<h2><b>Important Note</b></h2>\n<p>This is a full-time position contingent on contract award by our client, with a defined performance period of up to one year. This role offers you a unique opportunity to make a meaningful impact on a project that aligns with Bixal’s mission of delivering innovative, human-centered solutions. While the role has a fixed duration, we are committed to transparency and collaboration, keeping you informed about contract updates and new opportunities.</p>\n<h2>Responsiblities</h2>\n<ul>\n<li>Develop and maintain full-stack applications that support the VA Design System and Forms Library, ensuring a seamless user experience for Veterans and their families.</li>\n<li>Build and optimize React-based front-end components that align with the U.S. Web Design System (USWDS) and VA Design System (VADS) standards.</li>\n<li>Implement RESTful APIs and microservices to support scalable and reusable back-end functionality.</li>\n<li>Ensure performance, security, and accessibility compliance (Section 508, WCAG 2.2 AA, Mobile Content Accessibility Guidelines &#8211; MCAG) across web and mobile platforms.</li>\n<li>Work with React, React Native, Node.js, TypeScript, Express.js, and PostgreSQL (or similar technologies) to develop scalable solutions.</li>\n<li>Maintain and optimize infrastructure on AWS or other cloud environments, ensuring reliability and security.</li>\n<li>Collaborate with designers, UX researchers, and other engineers in an agile development environment to continuously improve the VA’s digital platforms.</li>\n<li>Participate in code reviews, technical discussions, and knowledge sharing to support a culture of engineering excellence.</li>\n<li>Other relevant duties as assigned</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor’s degree, plus at least three years of relevant experience, or an equivalent combination of education and/or experience.</li>\n<li>Experience in full-stack software development.</li>\n<li>Strong proficiency in JavaScript/TypeScript, React, and Node.js.</li>\n<li>Experience with server-side frameworks like Express.js, NestJS, or similar.</li>\n<li>Understanding of database management (PostgreSQL, MySQL, or MongoDB) and writing efficient queries.</li>\n<li>Familiarity with API development (REST, GraphQL) and authentication (OAuth, JWT, SAML).</li>\n<li>Knowledge of cloud services (AWS, Azure, or GCP), CI/CD pipelines, and containerization (Docker, Kubernetes).</li>\n<li>Commitment to writing clean, maintainable, and well-documented code.</li>\n<li>Experience working with federal web accessibility standards (Section 508, WCAG 2.2 AA, ARIA roles, screen readers like JAWS &amp; NVDA, etc.).</li>\n<li>User-Centered Mindset – Passion for building accessible and user-friendly solutions for Veterans, service members, and their families.</li>\n<li>Problem-Solving – Ability to troubleshoot complex issues and optimize system performance.</li>\n<li>Collaboration &amp; Communication – Strong ability to work in an agile, remote team environment and explain technical concepts to non-technical stakeholders.</li>\n<li>Adaptability &amp; Growth – Eagerness to learn new technologies, contribute to open-source projects, and iterate on solutions based on feedback.</li>\n<li>Attention to Detail – Commitment to maintaining high standards for security, scalability, and performance.</li>\n<li>Must be able to obtain and maintain a Public Trust clearance.</li>\n</ul>\n<h2>Nice to haves</h2>\n<ul>\n<li>Experience with React Native for mobile app development.</li>\n<li>Familiarity with Figma and collaborating with design teams.</li>\n<li>Experience working in federal contracting, civic tech, or government digital services.</li>\n<li>Background in DevOps, infrastructure automation, and monitoring tools (Terraform, Datadog, Prometheus).</li>\n</ul>\n<p>$120,000 &#8211; $130,000 a year</p>\n<h2><b>Perks &amp; Benefits</b></h2>\n<ul>\n<li>Flex hours</li>\n<li>401K with matching incentive</li>\n<li>Parental Leave</li>\n<li>Medical/dental/vision benefits</li>\n<li>Flex Spending Account</li>\n<li>Company provided short-term disability and life insurance</li>\n<li>Commuter benefits</li>\n<li>Generous PTO</li>\n<li>11 Paid holidays</li>\n<li>Professional development opportunities</li>\n</ul>\n<p><b>Please note that candidates selected may undergo a background investigation and, if applicable, meet eligibility requirements for suitability.</b></p>\n<p>Our company is committed to providing equal employment opportunities for all individuals and complies with all applicable federal, state, and local anti-discrimination laws. Employment decisions are based on merit, qualifications, and business needs.</p>",
        "url": "https://jobicy.com/jobs/116656-full-stack-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:47:54",
        "salary": "USD 120,000 - 130,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/b9bfe9bea27184872c3356b52540e09f.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Senior Sales Specialist",
        "company": "Twilio",
        "location": "UK",
        "description": "Twilio is looking for a Senior Sales Specialist to join our Wholesale Trading team and have Revenue responsibility for a selected number of strategic accounts. You will be responsible for defining the strategy and executing upon the growth strategy of your partners. You will own both supply and demand with the ultimate goal to maximize&amp;#8230;",
        "html_description": "<p>Twilio is looking for a Senior Sales Specialist to join our Wholesale Trading team and have Revenue responsibility for a selected number of strategic accounts. You will be responsible for defining the strategy and executing upon the growth strategy of your partners. You will own both supply and demand with the ultimate goal to maximize profitability.</p>\n<h2><strong>Responsibilities</strong></h2>\n<p>In this role, you’ll:</p>\n<ul>\n<li>Develop and drive strategy to achieve optimized profitability within account territory,</li>\n<li>Ruthlessly prioritize by identifying trading opportunities to maximize profitability</li>\n<li>Own pricing strategy and execution, working closely with routing specialists to maximize volume aggregation and account health,</li>\n<li>Cultivate relationships with partners to drive cost efficiencies and quality improvements</li>\n<li>Work with cross-functional stakeholders to manage rates, routes and yield</li>\n<li>Represent Twilio and our values with partners at industry events</li>\n</ul>\n<h2><strong>Qualifications </strong></h2>\n<p>Twilio values diverse experiences from all kinds of industries, and we encourage everyone who meets the required qualifications to apply. If your career is just starting or hasn&#8217;t followed a traditional path, don&#8217;t let that stop you from considering Twilio. We are always looking for people who will bring something new to the table!</p>\n<h3><strong>Required</strong></h3>\n<ul>\n<li>8+ years in international telecom industry in a partner management role</li>\n<li>Highly analytical and strategic attitude with proven ability to analyze and compile large amounts of data to inform decision making</li>\n<li>Demonstrated ability to lead partnerships and exceed critical metrics</li>\n<li>A bias for action with the ability to test and iterate on new ideas quickly with the appropriate controls and data in place to measure success and change or double down on tactics when needed.</li>\n<li>Comfortable working with highly technical, operational and other cross functional teams, while influencing their understanding, building supportive partnerships and driving expected outcome</li>\n<li>Strong individual self drive</li>\n<li>Strong negotiation skills</li>\n</ul>\n<h3><strong>Desired</strong></h3>\n<ul>\n<li>Established relationship with key regional accounts</li>\n<li>Understanding of the SMS supplier ecosystem</li>\n<li>Domain expertise from a highly quant industry such as investment banking, security or commodity trading especially in non-standard segments</li>\n</ul>\n<h2><strong>Location</strong></h2>\n<p>This role will be remote, and based in the United Kingdom.</p>\n<h2><strong>Travel </strong></h2>\n<p>We prioritize connection and opportunities to build relationships with our customers and each other. For this role, approximately 10% travel is anticipated to help you connect in-person in a meaningful way.</p>\n<h2><strong>What We Offer</strong></h2>\n<p>Working at Twilio offers many benefits, including competitive pay, generous time off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.</p>\n<h2><strong>Twilio thinks big. Do you?</strong></h2>\n<p>We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That&#8217;s why we seek out colleagues who embody our values — something we call Twilio Magic. Additionally, we empower employees to build positive change in their communities by supporting their volunteering and donation efforts.</p>\n<p><strong>Twilio is proud to be an equal opportunity employer.</strong> We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Additionally, Twilio participates in the E-Verify program in certain locations, as required by law.</p>",
        "url": "https://jobicy.com/jobs/115962-digital-sales-representative-social-impact-sales",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:36:12",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201023175858-722503.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "B2B Sales Manager - Business Development",
        "company": "ModSquad",
        "location": "Mexico,  USA",
        "description": "Are you a high-energy sales professional looking to join a creative, industry leader? Do you want to accelerate your career growth? You need to stop thinking about the day one stuff. Instead think year one and beyond. If you are interested, here’s what year one with us is all about. Developing new clients, building your&amp;#8230;",
        "html_description": "<p>Are you a high-energy sales professional looking to join a creative, industry leader? Do you want to accelerate your career growth? You need to stop thinking about the day one stuff. Instead think year one and beyond.</p>\n<p>If you are interested, here’s what year one with us is all about. Developing new clients, building your book of business that will keep on giving for years to come. Realistically, we need someone who is a hunter/farmer who is open to learn our processes. Beside a solid base salary, this position is structured with uncapped commission to attract the best of the best.</p>\n<p>ModSquad is currently seeking a Manager level sales executive to join our crew to continue driving forward and close the right type of clients to make ModSquad successful. This position reports to the VP of Sales with responsibility for sales to all small and mid market levels.</p>\n<p>ModSquad is a global leader in the remote workforce model, so we are positioned for success in today’s new world. We support top global brands such as Starz, National Geographic, Kroger, Wounded Warrior Project, Electronic Arts (EA), Children’s Miracle Network Hospitals, and many more. If this is your DNA, apply now!</p>\n<p><b>Hours: </b><b>Standard business hours; more as needed</b></p>\n<p><b>100% Remote role available to US, Jamaica, Mexico </b></p>\n<h2><b>Key Responsibilities:</b></h2>\n<ul>\n<li>Cultivate and develop new business relationships and serve as a trusted business consultant to senior decision-makers</li>\n<li>Assume a lead role in managing sales opportunities and customer negotiations in your region</li>\n<li>Identify proficient sales strategies and tactics for generating leads and closing business (it&#8217;s all about MRR!)</li>\n<li>Develop strong relationships with key strategic partners and, when appropriate, orchestrate the sales process through channel partners</li>\n<li>Engage and utilize the marketing team to target top regional prospects</li>\n</ul>\n<h2><b>What we are looking for:</b></h2>\n<ul>\n<li>University degree in business, marketing, technology, or related field</li>\n<li>3+ years of consultative or value-add sales experience, with a background in closing recurring services such as customer support, moderation, community management, and social media management</li>\n<li>Ability to identify, close, manage, and grow multiple deals each month</li>\n<li>Excellent consultative selling skills</li>\n<li>Concise communication skills</li>\n<li>Experience working with Salesforce.com, Zoom, Slack, Google Docs and similar online/mobile apps</li>\n<li>Strong Excel formula skills for revenue and cost modeling are a requirement as well as contract management, negotiation and legal knowledge.</li>\n<li>Hands-on knowledge of the top social and messaging platforms, and customer-service toolsets, and their role in engaging today’s digital customer</li>\n<li>Ability to travel as needed</li>\n<li>A flexible work schedule allowing for regular interactions with customers and ModSquad teammates in time zones around the world</li>\n<li>Ability to collaborate and strategize on complex issues with the team</li>\n</ul>\n<h2>About ModSquad:</h2>\n<p>ModSquad has been reinventing the Customer Experience Services industry since 2007. Top brands around the globe turn to us for customer support, content moderation, trust and safety, community management, and social media services. We work with startups and Fortune 500 companies and everything in between. Our client list includes Spotify, VSCO, Vimeo, Tourism Ireland, and a ton of other companies we aren’t at liberty to talk about. We support over 50 languages in more than 90 countries. We’re primarily a remote company so you’ve already seen our/your office. If you want to work with great people on cool projects for amazing brands, you’ve come to the right place.</p>\n<p><i>ModSquad is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), gender, national origin, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.</i>Individual base pay or rate depends on various factors, in addition to primary work location, such as complexity and responsibility of role, job or contract duties/requirements, and relevant experience and skills.</p>",
        "url": "https://jobicy.com/jobs/116645-b2b-sales-manager-business-development",
        "source": "Jobicy",
        "posted_at": "2025-04-01 15:47:07",
        "salary": "",
        "job_type": "full-time",
        "category": "Business Development, Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910162701-890885.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "B2B Copywriter - Demand Generation",
        "company": "ModSquad",
        "location": "Anywhere",
        "description": "ModSquad has been reinventing the Customer Experience Services industry since 2007. Top brands around the globe turn to us for customer support, content moderation, trust and safety, community management, and social media services. We work with startups and Fortune 500 companies and everything in between.  Our client list includes Spotify, VSCO, Vimeo, Tourism Ireland, and&amp;#8230;",
        "html_description": "<p>ModSquad has been reinventing the Customer Experience Services industry since 2007. Top brands around the globe turn to us for customer support, content moderation, trust and safety, community management, and social media services. We work with startups and Fortune 500 companies and everything in between.  Our client list includes Spotify, VSCO, Vimeo, Tourism Ireland, and a ton of other companies we aren’t at liberty to talk about. We support over 50 languages in more than 90 countries. We’re primarily a remote company so you’ve already seen our/your office. If you want to work with great people on cool projects for amazing brands, you’ve come to the right place.</p>\n<p>We’re looking to add a writer to our marketing team.</p>\n<p>Are you a person who can build and maintain a content engine that generates demand and drives revenue?  We are seeking someone who can turn visitors into readers, readers into leads, and leads into clients; A writer who can fuel conversations online at scale to pave the way for sales, positioning the sales team as in-demand, trusted experts.</p>\n<p>We’re looking for someone who is data-driven. Someone who understands the ROI of content marketing, how to measure it, and how to maximize it.</p>\n<p>And that someone will have to do it in our signature style.</p>\n<p>We want a writer who resists the easy cliche, the empty jargon, and the overwrought sentences. Someone who aims for more than vapid generalizations and sophomoric insights. A writer who crafts copy that’s clear and conversational, interesting and useful.</p>\n<h2><b>Responsibilities &amp; Duties:</b></h2>\n<ul>\n<li>Develop an inbound content program and roadmap</li>\n<li>Maintain a content calendar with months of revenue-enabling ideas</li>\n<li>Conduct content and market research and run interviews</li>\n<li>Produce authoritative copy that educates and informs</li>\n<li>Write short and long-form pieces: everything from emails to ebooks</li>\n<li>Tailor and repurpose content to a variety of formats and channels</li>\n<li>Utilize SEO best practices to drive organic traffic</li>\n<li>Develop KPIs and track them through GA4, Hubspot, and Salesforce</li>\n<li>Analyze content performance metrics and optimize content accordingly</li>\n</ul>\n<h2><b>Skills and Experience:</b></h2>\n<ul>\n<li>Knows how to tell a compelling story, about anything</li>\n<li>Has an intuitive sense of our brand and voice and can write in our style</li>\n<li>Is committed to deeply understanding our industry and audience</li>\n<li>Can write for every step of the buyer journey</li>\n<li>Cranks out quality copy quickly and efficiently</li>\n<li>Reads stuff like Revising Prose and Several Short Sentences About Writing for fun</li>\n<li>Can articulate our value propositions and bring our messaging framework to life</li>\n<li>Experiments and iterates in a methodical, data-driven way</li>\n<li>Obsesses over ROI</li>\n<li>Stays abreast of new strategies and tactics in this quickly evolving area of marketing</li>\n</ul>\n<h2><b>Requirements:</b></h2>\n<ul>\n<li>3-5 years of proven success as a demand generation content writer</li>\n<li>Bachelor’s degree or equivalent</li>\n<li>Experience or familiarity with our services and related technologies (especially AI)</li>\n<li>Demonstrable knowledge of online content strategy and creation</li>\n<li>Excellent writing, editing, proofreading, and research skills</li>\n<li>Excellent time-management and organizational skills</li>\n<li>Highly familiar with digital customer experiences and the buyer’s journey</li>\n</ul>\n<p><i>ModSquad is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), gender, national origin, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.</i></p>",
        "url": "https://jobicy.com/jobs/116644-b2b-copywriter-demand-generation",
        "source": "Jobicy",
        "posted_at": "2025-04-01 15:44:55",
        "salary": "",
        "job_type": "full-time",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910162701-890885.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. Software Engineer - Platform",
        "company": "Branch",
        "location": "USA",
        "description": "Branch is on a mission to empower workers with financial freedom. We do this by helping companies accelerate payments and providing working Americans with accessible, free financial services. We’re committed to building and delivering more inclusive, transparent, and frictionless financial products. Our goal of empowerment extends to our own employees, too. Have a great idea?&amp;#8230;",
        "html_description": "<p>Branch is on a mission to empower workers with financial freedom. We do this by helping companies accelerate payments and providing working Americans with accessible, free financial services. We’re committed to building and delivering more inclusive, transparent, and frictionless financial products.</p>\n<p>Our goal of empowerment extends to our own employees, too. Have a great idea? Share it today and it might just get implemented tomorrow. As a member of our team, your voice and creativity matter—and they can directly impact our products, company, and culture.</p>\n<p>We not only focus on attracting great talent from across the country, but also on building teams that help that talent thrive. That means valuing a diversity of opinions and working styles, while creating a shared belief in innovation, initiative, and winning together.</p>\n<p>Come join our team as we develop new ways to improve the lives of working Americans.</p>\n<h2><strong>Responsibilities include, but are not limited to</strong></h2>\n<ul>\n<li>Develop core components for our product suite</li>\n<li>Measure and optimize the performance, scalability, and uptime of backend services</li>\n<li>Demonstrate and promote a culture of engineering excellence</li>\n<li>Conduct design and code reviews and push the bar for engineering rigor and standards</li>\n<li>Collaborate with product management, customer success, and customer support to deliver the best experience for our users</li>\n<li>Focus on consistent, cohesive REST APIs and domain driven service design to facilitate and orchestrate service contracts</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>Attention to detail and passion for doing great work</li>\n<li>5+ years of experience in building clean, well architected, distributed, and scalable software</li>\n<li>Strong computer science fundamentals, with deep knowledge of data structures, algorithms, and software design</li>\n<li>Strong command of Java and Java based microservices with Spring Boot</li>\n<li>Experience designing and supporting customer facing RESTful APIs.</li>\n<li>Design and implementation of relational database schemas running on PostgreSQL, MySQL, Oracle, or equivalent</li>\n<li>Fluent with unit / integration testing concepts and tools including JUnit / Mockito, or equivalent</li>\n<li>Experience with Docker, Kubernetes, git-flow, SonarQube for CICD a plus</li>\n<li>BS in Computer Science or equivalent program</li>\n</ul>\n<h2><strong>Compensation</strong></h2>\n<p>The base compensation range for this role is 160-170k.  The salary range displayed reflects an average base salary range for the position across all the US. The base salary offered to an applicant could be higher or lower based on each applicants specific skill set, depth of experience, relevant education or training, etc. The base salary range listed excludes commission/ bonus/ equity or benefits.</p>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Remote-first work culture (domestic USA)</li>\n<li>Branch-paid medical, dental, and vision insurance</li>\n<li>Equity</li>\n<li>401k</li>\n<li>Flexible time off</li>\n<li>Paid company holidays</li>\n<li>Paid parental leave (eligible after 6 months of employment)</li>\n</ul>\n<h2><strong>Working at Branch</strong></h2>\n<p>A remote-first company with employees located throughout the U.S., Branch emphasizes transparency, accountability, and trust to create a collaborative environment where our product, engineering, marketing, customer support, customer success, and sales teams can all thrive together.</p>\n<p>Our collaborative spirit has helped us become an award-winning fintech company, with Branch’s innovation and workplace recognized across industries. Branch has been honored by Inc., the Webby Awards, Benzinga Fintech Awards, Fintech Breakthrough Awards, Top Workplaces USA, Great Places to Work, and EY Entrepreneur of the Year, Heartland, among others.</p>",
        "url": "https://jobicy.com/jobs/111900-senior-software-engineer-platform-2",
        "source": "Jobicy",
        "posted_at": "2025-04-01 04:25:12",
        "salary": "USD 160,000 - 170,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/3b9dc47a09a30846e3c1355b50098b18.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. Software Engineer - Backend",
        "company": "Lyra Health",
        "location": "USA",
        "description": "Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With&amp;#8230;",
        "html_description": "<p>Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With our innovative digital care platform and global provider network, 17 million people can receive the best care and feel better, faster. Founded by David Ebersman, former CFO of Facebook and Genentech, Lyra has raised more than $900 million.</p>\n<h2><b>About the Role:</b></h2>\n<p>We’re looking for an exceptional Sr. Backend Software Engineer to join our team. We care deeply about making a difference in people’s lives and hope you do too!</p>\n<p>This role can be carried out from our Burlingame, CA headquarters, hybrid, or fully remote/virtually. Remote candidates must be physically located within the United States.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Create lasting impact by building and continuously improving our Python and Java-based APls</li>\n<li>Work within the engineering team on designing, developing and deploying APls that power core product functionality.</li>\n<li>Collaborate with key partners including product management, data science and behavioral health specialists.</li>\n<li>Ensure that best practices are adhered to during all phases of software development.</li>\n<li>Adhere to the highest quality and security standards.</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>BS in CS or related technical field</li>\n<li>6+ years of experience developing enterprise or consumer web applications ideally using Python or Java/Spring</li>\n<li>Experience in developing and deploying multi-tenant web applications</li>\n<li>Experience building scalable REST APls</li>\n<li>Must be highly proactive and a self-starter</li>\n</ul>\n<h2>Diversity &amp; Inclusion at Lyra:</h2>\n<ul>\n<li>Diversity, equity, inclusion, and belonging (DEIB) at Lyra is essential to the way we deliver culturally responsive care, build and manage our provider network, and support holistic efforts to strengthen DEIB in workplaces around the world—including our own.</li>\n<li>People come to Lyra with a range of needs, backgrounds, and abilities that influence their response to mental health support. Our diverse network of providers delivers comprehensive mental health treatment and support rooted in culturally responsive care, a multicultural approach that accounts for the impact of cultural backgrounds on each person’s care experience.</li>\n</ul>\n<p>As a full-time Sr. Software Engineer, you will be employed by Lyra Health, Inc. The anticipated annual base salary range for this full-time position is $142,000 &#8211; $196,000. The base range is determined by role and level, and placement within the range will depend on a number of job-related factors, including but not limited to your skills, qualifications, experience and location. This role may also be eligible for discretionary bonuses.</p>\n<p>Annual salary is only one part of an employee’s total compensation package at Lyra. We also offer generous benefits that include:</p>\n<ul>\n<li>Comprehensive healthcare coverage (including medical, dental, vision, FSA/HSA, life and disability insurances)</li>\n<li>Lyra for Lyrians; coaching and therapy services</li>\n<li>Equity in the company through discretionary restricted stock units</li>\n<li>Competitive time off with pay policies including vacation, sick days, and company holidays</li>\n<li>Paid parental leave</li>\n<li>401K retirement benefits</li>\n<li>Monthly tech allowance</li>\n<li>We like to spread joy throughout the year with well-being perks and activities, surprise swag, free food, regular community celebration…and more!</li>\n</ul>\n<p>&#8220;We are an Equal Opportunity Employer. We do not discriminate on the basis of race, color, religion, sex (including pregnancy), national origin, age, disability, genetic information or any other category protected by law.</p>\n<p>By applying for this position, you acknowledge that your personal information will be processed as per the Lyra Health Workforce Privacy Notice. Through this application, to the extent permitted by law, we will collect personal information from you including, but not limited to, your name, email address, gender identity, employment information, and phone number for the purposes of recruiting and assessing suitability, aptitude, skills, qualifications, and interests for employment with Lyra.  We may also collect information about your race, ethnicity, and sexual orientation, which is considered sensitive personal information under the California Privacy Rights Act (CPRA) and special category data under the UK and EU GDPR.  Providing this information is optional and completely voluntary, and if you provide it you consent to Lyra processing it for the purposes as described at the point of collection, for example for diversity and inclusion initiatives.  If you are a California resident and would like to limit how we use this information, please use the Limit the Use of My Sensitive Personal Information <a href=\"https://privacy-central.securiti.ai/#/dsr/be61bec1-10a5-47ac-94ab-3055974aefb1\">form</a>. This information will only be retained for as long as needed to fulfill the purposes for which it was collected, as described above. Please note that Lyra does not “sell” or “share” personal information as defined by the CPRA. Outside of the United States, for example in the EU, Switzerland and the UK, you may have the right to request access to, or a copy of, your personal information, including in a portable format; request that we delete your information from our systems; object to or restrict processing of your information; or correct inaccurate or outdated personal information in our systems. These rights may be subject to legal limitations.</p>",
        "url": "https://jobicy.com/jobs/114321-senior-software-engineer-backend-4",
        "source": "Jobicy",
        "posted_at": "2025-04-01 04:24:21",
        "salary": "USD 142,000 - 196,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/1594f6d9649b131ca2414928bd60caac.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Full-Stack Software Engineer - Front-End Focus",
        "company": "Amount",
        "location": "USA",
        "description": "As a Full-Stack Software Engineer with a Front-End Focus, you&amp;#8217;ll start your day syncing with a mission-driven Client Experience team, collaborating with designers, back-end engineers, and product managers to align on priorities. Your primary focus will be designing and implementing scalable, high-performance user interfaces, while also integrating with and optimizing back-end services. You&amp;#8217;ll work primarily&amp;#8230;",
        "html_description": "<p>As a Full-Stack Software Engineer with a Front-End Focus, you&#8217;ll start your day syncing with a mission-driven Client Experience team, collaborating with designers, back-end engineers, and product managers to align on priorities. Your primary focus will be designing and implementing scalable, high-performance user interfaces, while also integrating with and optimizing back-end services.</p>\n<p>You&#8217;ll work primarily in JavaScript, TypeScript, and React, leveraging modern frameworks to build seamless, responsive web applications. You&#8217;ll ensure UI/UX best practices are followed, optimize front-end performance for high-traffic fintech applications, and contribute to our back-end services using Java and Spring Boot.</p>\n<p>By the end of the day, you&#8217;ll review pull requests, refine sprint goals, and explore innovative ways to improve both the front-end experience and full-stack efficiency.</p>\n<p><strong>Team:</strong>  Will join a client experience mission-driven team.</p>\n<p><strong>Similar job titles: </strong>Software Engineer, Full-Stack Software Engineer, Software Developer, Front-End Software Engineer</p>\n<p><strong>Salary:</strong> $120,000 &#8211; $160,000</p>\n<h2><strong>WHAT WE’LL TRUST YOU TO DELIVER:</strong></h2>\n<ul>\n<li>Write clean, maintainable, and scalable front-end and full-stack code that meets performance and security standards</li>\n<li>Translate complex requirements into intuitive, high-performance user interfaces, while integrating them seamlessly with back-end services</li>\n<li>Work closely with product and design teams to implement user-friendly features aligned with business needs</li>\n<li><strong>I</strong>mprove load times, responsiveness, and scalability of front-end applications, leveraging best practices in caching and asset management</li>\n<li>Work with Java, Spring Boot, RESTful APIs, and microservices to connect front-end applications with scalable, high-performance back-end systems</li>\n<li>Review pull requests, mentor junior engineers, and contribute to a culture of continuous learning and improvement</li>\n<li>Stay ahead of emerging front-end technologies, ensuring the best tools and frameworks are leveraged for modern fintech applications</li>\n</ul>\n<h2><strong>WHAT YOU LIKELY BRING TO THE TABLE: </strong></h2>\n<ul>\n<li>8+ years in software development, with at least ​5+ years of front-end expertise in a SaaS or FinTech environment</li>\n<li>Proficiency in JavaScript/TypeScript, React, and experience with Angular or Vue.js is a plus</li>\n<li>Strong knowledge of Redux, React Query, or similar tools for managing application state</li>\n<li>Familiarity with Java, Spring Boot, RESTful APIs, and event-driven architectures (ActiveMQ, Temporal)</li>\n<li>Experience with PostgreSQL or Redis for front-end data management and caching</li>\n<li>Deep understanding of front-end optimization techniques, including lazy loading, asset minification, and efficient API calls</li>\n<li>Experience working in agile teams with Jira, Confluence, and Git-based workflows</li>\n<li>A passion for pixel-perfect implementation, accessibility, and modern design principles</li>\n</ul>\n<h2><strong>TOOLS YOU WILL OR MIGHT WORK WITH:</strong></h2>\n<p>ReactJs, Java, Springboot, Micronaut, Temporal, ActiveMQ, Postgres, Redis, Kubernetes, AWS, Jenkins, Git</p>\n<h2><strong>ABOUT AMOUNT (TL;DR)</strong></h2>\n<p><strong>Founded:</strong> 2020<br />\n<strong>Employees:</strong> 150+<br />\n<strong>Locations:</strong> Chicago (HQ) and US Remote<br />\n<strong>Funding:</strong> Amount has raised $281M in total equity capital since inception, including most recently at a valuation of $1B. Investors include WestCap, Hanaco Ventures, Goldman Sachs, Invus Opportunities, Mastercard, and PSCU<br />\n<strong>Key Customers:</strong> TD Bank, Velera, Guaranteed Rate, American Express, Citizens, Fifth Third Bank, Bank United, FIS, Associated Bank, Comerica<br />\n<strong>Tech Stack:</strong> Greenhouse, LinkedIn Recruiter, Lattice, G Suite, Atlassian, AWS, Python, Java, Ruby, GO, node.js, Temporal, Scala, Apache NiFi, Talend, Informatica, Hadoop, Hive, Spark, Pandas, Looker, Argo, Airflow Luigi, Kubernetes, C#, JavaScript (for advanced concepts), ASP.NET MVC, .NET Core, Microsoft SQL Server, Entity Framework (ORM for database interaction)</p>",
        "url": "https://jobicy.com/jobs/116639-full-stack-software-engineer-front-end-focus",
        "source": "Jobicy",
        "posted_at": "2025-04-01 04:04:31",
        "salary": "USD 120,000 - 160,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b2f40690858b404ed10e62bdf422c704.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Senior iOS Engineer",
        "company": "Help Scout",
        "location": "Canada,  Europe,  USA",
        "description": "As a Senior iOS Software Engineer at Help Scout, you will work alongside our experienced Product and Design teams to build world-class mobile applications for iOS. You&amp;#8217;ll be an integral part of the mobile team that provides our customers with helpful mobile solutions that complement and enhance their interactions with Help Scout. We aim to&amp;#8230;",
        "html_description": "<p>As a Senior iOS Software Engineer at Help Scout, you will work alongside our experienced Product and Design teams to build world-class mobile applications for iOS. You&#8217;ll be an integral part of the mobile team that provides our customers with helpful mobile solutions that complement and enhance their interactions with Help Scout.</p>\n<p>We aim to deliver a seamless and reliable experience on our mobile platforms, enabling agile interactions tailored to the mobile world. Our focus is on supporting our mobile users and addressing the most impactful use cases that enhance their experience.</p>\n<h2>Time Zone Note</h2>\n<p>We believe in strong work-life blend, and since we have remote team members living between EU through PT time zones, we require that your regular working hours overlap with<strong> 8am to 12 pm ET</strong> to ensure overlap with your team members.</p>\n<h2>About the Role</h2>\n<p>We’re giving our entire iOS app a fresh new look and feel. You will build new features that delight our users and have the opportunity to work with Kotlin Multiplatform as we enhance the application.</p>\n<p>As an iOS Software Engineer at Help Scout, you will:</p>\n<ul>\n<li>Have significant ownership in the development of our iOS application.</li>\n<li>Collaborate closely with our Android Engineers as a cohesive and collaborative Mobile Team.</li>\n<li>Work alongside Product and Design teams to provide input on the mobile application user experience and interface designs.</li>\n<li>Write clean, efficient, and maintainable code using Swift, some Objective-C (in a few pockets of our code base), and Kotlin Multiplatform.</li>\n<li>Ensure the high performance, quality, and responsiveness of our iOS application.</li>\n<li>Debug and resolve technical issues that arise in our iOS application.</li>\n<li>Work with customers and QA testers to ensure the mobile apps continue to be a resounding success for the business.</li>\n<li>Continuously work on adding new features, optimizing for other devices, and improving the product.</li>\n</ul>\n<h2>About You</h2>\n<ul>\n<li>As a Senior iOS Software Engineer at Help Scout, you have a deep understanding and extensive hands-on experience with Swift.</li>\n<li>You have a great understanding of how &#8220;always online&#8221; products like Help Scout communicate with web services in an unpredictable mobile reality. You can help us design everything to fail gracefully and leverage local storage to provide customers with as seamless an experience as possible.</li>\n<li>You delight not only in how an application works but in how it looks, and you have an excellent understanding of mobile interaction design. You love working on UI animations because they can help you execute the perfect user experience.</li>\n<li>You stay up-to-date with the latest advancements in mobile technology, specifically the iOS platform, and can provide insightful advice about leveraging native platform APIs.</li>\n<li>You value ownership. You love to see your work in the hands of users, and you’re never afraid to dive into an issue to find the quick fix or get to the real root of the issue.</li>\n<li>You are excited about remote work and believe that remote teams are the future of work. You can adjust your work/management style to be remote-friendly.</li>\n<li>You have interest in Kotlin Multiplatform Mobile development. Prior experience in this domain or with Kotlin is appreciated, but not required.</li>\n</ul>\n<h2>About the Process</h2>\n<ol>\n<li><strong>Value Add</strong> &#8211; you’ll meet with Alicia, Mobile Engineering Manager, to talk more about the role and your design work.</li>\n<li><strong>Logistics </strong>&#8211; you&#8217;ll meet with Erika on the Recruiting team to chat through compensation, benefits, timeline, and company culture.</li>\n<li><strong>Test Project </strong>&#8211; we’ll give you a take-home project that’s expected to take ~6 hours (we’ll pay for your time), then our team will review it and provide feedback.</li>\n<li><strong>Project Discussion</strong> &#8211; we&#8217;ll set up some additional time with the team to walk through your work and the decisions you made.</li>\n<li><strong>Final Chat </strong>&#8211; you’ll chat with another 3 people on the team, including our Eng leadership and your Product partner.</li>\n<li><strong>References </strong>&#8211; we’ll ask you for three references. Ideally, we’d like two of them to be managers, but we can be flexible.</li>\n</ol>\n<h2><strong>Compensation</strong></h2>\n<p>Each role at Help Scout has a pay range aligned to our salary formula and based on national market data. We take a competency-based approach and pay is based on the level and band of your role. We assess leveling during the hiring process for new teammates, during our bi-annual performance review cycles, and when a teammate’s role changes.</p>\n<p><strong>The salary range for this role is $162,000 &#8211; $175,000.</strong></p>\n<h2>Hiring Guidelines:</h2>\n<p>All of our roles are remote, however, some roles may carry specific location-based eligibility requirements. Additionally, because Help Scout is a fully remote company and we hire from many countries, we do not sponsor visas. Help Scout teammates need to be authorized to work from their home location.</p>\n<p>For our Sales roles, we are only able to hire in the <strong>United States</strong>.</p>\n<p>For other roles, we are only able to hire in the following countries: <strong>United States</strong>, <strong>Canada</strong>, <strong>Australia</strong>, <strong>Finland</strong>, <strong>Ireland</strong>, <strong>Netherlands</strong>, <strong>Poland</strong>, <strong>United Kingdom</strong>, <strong>Denmark</strong>, <strong>Germany</strong>, and <strong>Norway.</strong></p>\n<p>We’re working on expanding this list. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.</p>\n<p>We are an equal opportunity employer and are committed to building a company that embraces and celebrates diversity and inclusion. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status. We have read the studies and understand that diverse teams build better products, bring more perspective to the table, contribute to a company’s financial success, and help foster a more inclusive environment for all employees, but the bottom line is that it&#8217;s the right thing to do.</p>\n<p>To provide you with the best experience, we can support you with accommodations or adjustments at any stage of the recruitment process. Simply inform our recruitment team during your conversation with them.</p>\n<h2>A note on the use of AI in our interview process</h2>\n<p>While we understand that AI in an important tool in a modern skillset, we ask that you do not utilize AI assistants live on our interviews. Of course, use any tools you need to prepare! But we&#8217;d like for you to have a real human-to-human conversation with our team.</p>\n<p>On our end, we utilize a platform called Brighthire as a notetaker and review tool to ensure a fair and transparent hiring process.</p>",
        "url": "https://jobicy.com/jobs/116637-senior-ios-engineer-6",
        "source": "Jobicy",
        "posted_at": "2025-04-01 03:57:54",
        "salary": "USD 162,000 - 175,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210106163921-999274.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Growth Marketing Manager (Lead Lifecycle &amp;amp; Marketing Automation)",
        "company": "Boulevard",
        "location": "USA",
        "description": "As the Growth Marketing Manager for Lead Lifecycle &amp;amp; Marketing Automation, you will be responsible for designing, executing, and optimizing acquisition-focused marketing strategies using email/SMS marketing to engage and nurture leads through their entire journey—from initial awareness to conversion. You will leverage data-driven insights and marketing automation tools to craft personalized, impactful campaigns that drive&amp;#8230;",
        "html_description": "<p>As the Growth Marketing Manager for Lead Lifecycle &amp; Marketing Automation, you will be responsible for designing, executing, and optimizing acquisition-focused marketing strategies using email/SMS marketing to engage and nurture leads through their entire journey—from initial awareness to conversion. You will leverage data-driven insights and marketing automation tools to craft personalized, impactful campaigns that drive leads down the funnel and turn leads/contacts into sales-ready opportunities.</p>\n<p>This role requires a combination of creative thinking, analytical expertise, and technical proficiency to enhance the buyer’s journey through relevant and personalized communications. This role reports to the VP of Growth Marketing and gets to contribute directly to Boulevard’s growth through revenue-driven marketing initiatives.</p>\n<h2><strong>What You’ll Do Here</strong></h2>\n<ul>\n<li><strong>Buyer Journey Mapping: </strong>Work on mapping the ideal buyer’s journey and improving lead touchpoints to ensure an engaging and seamless experience from first touch to conversion.</li>\n<li><strong>Lead Funnel Strategy &amp; Execution: </strong>Develop and implement comprehensive lead lifecycle marketing strategies focused on moving prospects through the funnel, from awareness to consideration and conversion.</li>\n<li><strong>Campaign Development &amp; Optimization: </strong>Develop automated email/SMS campaigns that nurture leads at each stage of the funnel. Partner with the content team to curate high-value, relevant content that resonates with leads at different stages in the funnel (blog posts, guides, case studies, testimonials, etc.) to improve lead conversion rates and customer acquisition costs.</li>\n<li><strong>Continuous Improvement &amp; Testing: </strong>Conduct A/B testing, multivariate testing, and other optimization efforts to refine messaging, offers, and creative elements across campaigns to improve lead conversion.</li>\n<li><strong>Marketing Automation &amp; Tools Management: </strong>Utilize marketing automation platforms (e.g Marketo) to execute, track, and optimize campaigns, ensuring smooth workflows and integration across platforms.</li>\n<li><strong>Lead Scoring &amp; Segmentation: </strong>Partner closely with Rev Ops and Marketing Analytics teams to enhance lead-scoring models that prioritize high-value leads. Utilize segmentation strategies to deliver personalized content and offers to the right leads at the right time.</li>\n<li><strong>Funnel Analytics &amp; Reporting: </strong>Monitor campaign performance and analyze key metrics such as lead progression (lead to qualified to demo conversion). Stay on top of reports and insights to optimize marketing strategies and enhance funnel performance.</li>\n<li><strong>Collaboration Across Teams: </strong>Partner with content, product marketing, and sales teams to ensure marketing efforts are aligned with overall business objectives and deliver a seamless, consistent experience for leads as they move through the funnel</li>\n</ul>\n<h2><strong>What You’ll Need To Thrive</strong></h2>\n<ul>\n<li><strong>Education: </strong>Bachelor&#8217;s degree in Marketing, Business, or a related field (or equivalent experience)<strong><br />\n</strong></li>\n<li><strong>Experience: </strong>Ideal candidates will have 5+ years of experience in lead lifecycle marketing (acquisition-focused) and funnel management in growth marketing or demand generation.</li>\n<li><strong>Skills:</strong>\n<ul>\n<li>Proven track record of designing and executing lead nurturing programs that effectively move prospects through the funnel and drive measurable results</li>\n<li>Strong analytical skills with experience in data-driven decision-making, A/B testing, and campaign performance analysis</li>\n<li>Experience with marketing automation platforms (e.g., Marketo), CRM systems (Salesforce), email and SMS platforms, and best practices</li>\n<li>Exceptional communication skills, with the ability to collaborate effectively across teams and engage stakeholders</li>\n<li>Experience in segmentation, lead scoring, and customer journey optimization</li>\n<li>A creative, results-oriented mindset with a strong focus on continuous improvement</li>\n</ul>\n</li>\n</ul>\n<h2><strong>How We’ll Take Care Of You</strong></h2>\n<p><em>Your starting total cash compensation for this role is between </em>$102,000 &#8211; $145,000<em>, depending on your current skills, experience, training, and overall market demands. This salary range is subject to change, and there is always room for growth and advancement.</em></p>\n<p>In addition to the wonderful people you’ll get to work with and challenging projects that’ll push you &#8211; Boulevard is here to make sure you’re always at the top of your game emotionally, mentally, and physically.</p>\n<ul>\n<li>✨ We’ve got you covered with a 401(k) match plus dental, medical, vision, and life insurance.</li>\n<li> Take a break whenever you need with our flexible vacation day policy.</li>\n<li> Fully remote so you can choose where you want to work. You’ll receive a work from home stipend every month.</li>\n<li> Family planning resources and specialized support programs.</li>\n<li> Equity: get ahead on the ground floor and grow with Boulevard.</li>\n<li> Boulevard Bucks Learning and Development program allows employees to explore businesses in the market we serve.</li>\n</ul>\n<p><em>Boulevard Labs, Inc. is an Equal Opportunity Employer committed to hiring a diverse workforce and sustaining an inclusive culture. All employment decisions at Boulevard Labs, Inc. are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.</em></p>",
        "url": "https://jobicy.com/jobs/115245-campaign-manager",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:18:48",
        "salary": "USD 102,000 - 145,000",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/a45167e12b0ed51058a884cf9cd0c76f.png",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Senior Accountant",
        "company": "RenoFi",
        "location": "EMEA,  Europe,  USA",
        "description": "You’ve spent the past few years in audit and you’re ready for the transition to private. You’re a licensed CPA and you’ve spent some time dabbling in an ERP or two. You’re energized by solving puzzles — and can’t walk away from one until you’ve solved it. You’re a numbers guru at heart, but your&amp;#8230;",
        "html_description": "<p>You’ve spent the past few years in audit and you’re ready for the transition to private. You’re a licensed CPA and you’ve spent some time dabbling in an ERP or two. You’re energized by solving puzzles — and can’t walk away from one until you’ve solved it. You’re a numbers guru at heart, but your superpower is communication. You’re relentless about following up and following through. Most importantly, you care deeply about your team and our mission, and when your co-workers describe you, they always mention that you make your team better.</p>\n<h2><b>YOU WILL WORK ON THE FOLLOWING:</b></h2>\n<p><strong>REVENUE &amp; ACCOUNTS RECEIVABLE:</strong></p>\n<ul>\n<li>Assist with tracking of revenues and deferred revenues by customer and invoice preparation</li>\n</ul>\n<p><strong>CASH MANAGEMENT &amp; ANALYSIS:</strong></p>\n<ul>\n<li>Assist and maintain daily/weekly working capital analysis and cash forecasting</li>\n</ul>\n<p><strong>FINANCIAL CLOSE &amp; REPORTING:</strong></p>\n<ul>\n<li>Assist with preparation of monthly balance sheet reconciliations, month-end close process,   assembling month-end financial statements and monthly financial reporting packages</li>\n<li>Assist with month-end closing of general ledger and AR &amp; AP modules, maintaining fixed</li>\n<li> asset rollforward, prepaid/accrual amortization schedules, data entry and monthly report creation in NetSuite, reconciliation of financial statements</li>\n<li>Prepare monthly bank reconciliations</li>\n<li>Prepare variance explanations from forecast</li>\n<li>Consolidate financial statements including preparation of consolidating and eliminating entries</li>\n<li>Maintain an efficient closing/consolidation process</li>\n</ul>\n<p><strong>ACCOUNTS PAYABLE &amp; EXPENSE MANAGEMENT:</strong></p>\n<ul>\n<li>Process vendor invoices including accurate coding into NetSuite and maintain timely vendor payments</li>\n<li>Process weekly credit card transactions including coding into NetSuite and prepare monthly credit card reconciliations</li>\n</ul>\n<p><strong>DOCUMENTATION &amp; WORKFLOW:</strong></p>\n<ul>\n<li>Maintain documentation of procedures and workflow for assigned areas of responsibility</li>\n<li>Assist with maintenance and organization of accounting files</li>\n<li>Ad hoc tasks and projects as arise</li>\n</ul>\n<p>RenoFi is committed to building a diverse and inclusive team. We believe various backgrounds and experiences contribute to our mission of transforming the renovation lending industry. If your experience doesn’t perfectly match the requirements, we encourage you to apply anyway and tell us why you’d be a great fit for this role!</p>\n<h2><b>ABOUT US:</b></h2>\n<p>The demand for home renovations has never been stronger, yet, it&#8217;s surprisingly difficult for a new homeowner to renovate. It can take a decade to build up enough home equity and savings to pay for a major renovation. As a result, recent homeowners do a lot of financially-suboptimal things to compensate like borrow from their 401k, rack up credit card debt, and use high-interest personal loans. Or they just live unhappily for years in a home that doesn&#8217;t meet their family&#8217;s needs.</p>\n<p>But by completing a major renovation, homeowners are increasing the value of their home. Professional real estate investors leverage this After Renovation Value (ARV) to roll the increase in value into new properties all the time. But there hasn&#8217;t been a great way for homeowners to take advantage of this. If homeowners had an ability to borrow against the ARV, they could increase their borrowing power up to 10x.</p>\n<p>To meet this need, RenoFi created a platform that enables homeowners to borrow funds from RenoFi approved lenders in the form of the first home equity loan purpose-built for renovations! Unlike standard home equity loans, RenoFi Loans use the value of your home post-renovation which lets you borrow the most money at the best possible terms.  RenoFi is creating a full suite of renovation loan products to better suit the needs of today’s homeowners!</p>\n<p>For homeowners, RenoFi makes it possible to renovate years earlier than might be otherwise feasible. For contractors, we empower the financing of renovations at the point of sale, reducing instances of scope reduction, and ensuring prompt payment. Our lender partners, most often credit unions, rely on RenoFi&#8217;s platform to generate loans, create efficiencies, and grow membership. The lenders pay RenoFi for the new loans, which allows us to offer our services to homeowners for free. RenoFi is truly a win-win-win for everyone involved.</p>\n<p>RenoFi is backed by some of the best startup investors in the world, including First Round Capital, NYCA Ventures, CMFG Ventures, and Canaan Partners.</p>\n<h2><b>WE ARE A GLOBALLY DISTRIBUTED TEAM:</b></h2>\n<p>RenoFi has been built from the start as a fully distributed team with an intentional focus on growing a strong team and culture that spans timezones and nationalities.</p>\n<p>Please highlight any prior experience working remotely when applying. US or GMT-adjacent timezones will be prioritized.</p>\n<p>RenoFi offers competitive cash and equity compensation. Some benefit offerings will vary from country to country. In the United States, we offer competitive health and retirement plans. All staff across the globe enjoy a flexible vacation policy.</p>",
        "url": "https://jobicy.com/jobs/112875-senior-accountant-18",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:17:53",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/4d0931e9535b402bd83fe4f24e47fac0.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Customer Success Manager - SMB",
        "company": "Shopmonkey",
        "location": "Mexico",
        "description": "The Customer Success Manager (CSM) will play a pivotal role in supporting customer engagement and growth initiatives. You will work closely with customers, ensuring they feel empowered, supported, and successful while using our platform. This role focuses on building relationships with clients of varying sizes, driving adoption of key products and features, and identifying opportunities&amp;#8230;",
        "html_description": "<p>The Customer Success Manager (CSM) will play a pivotal role in supporting customer engagement and growth initiatives. You will work closely with customers, ensuring they feel empowered, supported, and successful while using our platform. This role focuses on building relationships with clients of varying sizes, driving adoption of key products and features, and identifying opportunities to enhance customer satisfaction and retention. The Associate CSM will collaborate with cross-functional teams, including sales, implementation, support, and product, to ensure customers are successful throughout their journey. <strong>Please note this remote position is for candidates based in Mexico. </strong></p>\n<h2><strong>You&#8217;ll have an opportunity to</strong></h2>\n<h4><strong>Customer Relationship Management</strong></h4>\n<ul>\n<li>Develop and maintain relationships with assigned customers, including corporate accounts, franchises, and individual users.</li>\n<li>Conduct regular check-ins to ensure customers maintain high Net Promoter Scores (NPS) and are fully engaged with the platform.</li>\n<li>Understand how customers&#8217; businesses operate, identify their unique needs, and make strategic recommendations to help them succeed.</li>\n<li>Become a trusted advisor to key stakeholders and executives, advocating for their success and business goals.</li>\n</ul>\n<h4><strong>Onboarding and Product Adoption</strong></h4>\n<ul>\n<li>Assist with customer education to ensure a seamless transition from onboarding to customer success.</li>\n<li>Conduct product walkthroughs to ensure customers effectively utilize key features and value-added products.</li>\n<li>Drive product adoption by proactively addressing customer challenges and recommending solutions.</li>\n</ul>\n<h4><strong>Customer Growth and Retention</strong></h4>\n<ul>\n<li>Manage accounts by driving upsells, cross-sells, and successful renewals.</li>\n<li>Partner with sales and commercial teams to identify and execute revenue growth opportunities.</li>\n</ul>\n<h4><strong>Issue Resolution and Advocacy</strong></h4>\n<ul>\n<li>Act as the primary point of contact for customer concerns, ensuring issues are addressed quickly and effectively.</li>\n<li>Remove roadblocks to adoption by identifying challenges and proposing solutions.</li>\n<li>Serve as the voice of the customer by representing customer feedback and use cases internally to improve the platform.</li>\n</ul>\n<h4><strong>Customer Insights and Reporting</strong></h4>\n<ul>\n<li>Track and report on key customer success metrics, including engagement levels, product adoption, NPS, and renewal rates.</li>\n<li>Provide regular updates on account health to internal stakeholders.</li>\n</ul>\n<h2><strong>We are looking for you if you have</strong></h2>\n<ul>\n<li>Fluency in English and Spanish</li>\n<li>1-3 years of experience in a customer success or client-facing role, ideally in SaaS.</li>\n<li>Strong interpersonal and communication skills (both written and verbal).</li>\n<li>Experience with customer success and CRM tools (e.g., Salesforce, Vitally, Gainsight).</li>\n<li>Automotive industry experience is a plus</li>\n<li>Customer-centric mindset with a passion for helping clients achieve their goals.</li>\n<li>High emotional intelligence (EQ) and empathy, with the ability to build strong relationships.</li>\n<li>Strong time management and organizational skills.</li>\n<li>Problem-solving mindset with a focus on delivering customer value.</li>\n<li>Ability to thrive in a dynamic, fast-paced startup environment.</li>\n<li>Self-directed, motivated, and continuously learning.</li>\n</ul>\n<h2><strong>Why Shopmonkey? </strong></h2>\n<p><strong>Shopmonkey has become an amazing environment where employees feel that they are valued as people, and not just worker bees. To ensure that our team thrives, we invest in the following perks (benefits below are mainly for U.S. based, full-time employees) Other benefits vary upon location outside the United States, and employment status):</strong></p>\n<h3><strong> Health &amp; Wellness </strong></h3>\n<ul>\n<li>Medical, dental, vision, and life insurance benefits available the 1st of the month following hire date</li>\n<li>Short term and long term disability</li>\n<li>Employee assistance program</li>\n<li>Reimbursement for a personal health and wellness membership</li>\n<li>Generous parental leave</li>\n<li>401(k) available upon hire</li>\n</ul>\n<h3><strong>✈️ Time Off </strong></h3>\n<ul>\n<li>11 paid holidays</li>\n<li>Flexible time off &#8211; take the time off you need!</li>\n</ul>\n<h3><strong> Giving Back </strong></h3>\n<ul>\n<li>Matching donations for approved charitable organizations</li>\n<li>Group volunteer efforts</li>\n</ul>\n<h2><strong>About Shopmonkey</strong></h2>\n<p>Shopmonkey is the leading auto-repair shop software company; it is a cloud-based solution that helps auto-repair shops consolidate tools, save time, and streamline their entire operation onto a simple, easy-to-use platform.</p>\n<p>Headquartered in Silicon Valley and trusted by more than 3,500+ auto shops across the U.S. and Canada, Shopmonkey aims to change the status quo of the car repair market, estimated to be worth more than $500B.</p>\n<p><em>Shopmonkey is committed to building a diverse and inclusive team. We are looking for team members from all backgrounds that are committed to the Shopmonkey mission. </em></p>\n<p><em>Shopmonkey provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. </em></p>\n<p><strong>Please note: </strong>Shopmonkey will never request sensitive information such as your social security number, bank account information, or other non-publicly available information during the application and interview process. If an applicant is extended an offer of employment, such sensitive information will be requested at that time. Shopmonkey will never ask you to receive and ship packages or goods as part of the interview. Other practices to be on alert for:</p>\n<ul>\n<li>Contact initiated via unsolicited text message or cold call. Shopmonkey does not follow up with candidates through instant messaging applications.</li>\n<li>Our Talent Acquisition team only corresponds from email addresses with the domain ‘@Shopmonkey.io’. If a generic email ID ending with Gmail/Yahoo or other domain is used while receiving a job offer or interview call, there is a likelihood of a scammer.</li>\n<li>While some of our jobs can be found on third party job sites, all of our current job opportunities and descriptions are posted on Shopmonkey’s Careers page, or our official LinkedIn Company Page</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115244-customer-support-representative-mexico-2",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:16:55",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/baf27bf7e7c0ff8017f9d4271ae886a6.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Account Executive",
        "company": "Simon Data",
        "location": "USA",
        "description": "Simon Data was founded in 2015 by a team of successful serial entrepreneurs with a passion for transforming data to drive real-world results. We are building a best-in-class enterprise Customer Data Platform that empowers marketers to create personalized data-driven experiences for the customers. We’re scrappy problem solvers who believe in tackling big challenges with disruptive&amp;#8230;",
        "html_description": "<p>Simon Data was founded in 2015 by a team of successful serial entrepreneurs with a passion for transforming data to drive real-world results. We are building a best-in-class enterprise Customer Data Platform that empowers marketers to create personalized data-driven experiences for the customers. We’re scrappy problem solvers who believe in tackling big challenges with disruptive thinking and giving our customers the support they need to deliver great next-generation experiences at scale.</p>\n<p>At Simon, we firmly believe that business success starts and ends with people. We all do our best work when we are surrounded by other friendly top performers who want to succeed together. This attitude is core to our values. When you trust your team, invest in their development, and give them ownership, great things happen.</p>\n<h2><strong>The Role</strong></h2>\n<p>Great sales organizations are built on focus, cohesion, drive, and &#8211; of course &#8211; a winning product. At Simon, we’ve built a first-of-it’s kind data and marketing application that benefits from the rapid growth of the cloud data ecosystem and enables businesses to deliver the next generation of customer experiences.</p>\n<p>We are seeking a highly motivated and results-oriented Account Executive to join our dynamic sales team. As an Account Executive at Simon Data, you will be responsible for driving revenue growth by working closely with potential clients, understanding their business needs, and positioning Simon Data as a solution to their challenges. You will play a crucial role in identifying and closing new business opportunities and you&#8217;ll be a key contributor to growing the top line in a category-shaping company</p>\n<p>This role requires a strong work ethic, excellent communication skills, teamwork, and the ability to build and maintain relationships with key stakeholders.</p>\n<h2><strong>What You’ll Do</strong></h2>\n<ul>\n<li>Manage the sales cycle from initial contact through negotiation, closing deals, and contract signing, ensuring customer satisfaction and achieving sales targets.</li>\n<li>Understand customers&#8217; business needs and pain points, articulate the value proposition of the Simon Data solution, and align them with clients&#8217; objectives to drive sales.</li>\n<li>Execute proofs of concept, requiring strong project and stakeholder management skills, as well as the ability to translate customer objectives to strategies and use cases</li>\n<li>Build relationships with the C-Suite and with top Marketing and Tech VPs at high-growth and leading mid-market and enterprise companies, helping them tackle mission-critical problems</li>\n<li>Collaborate with internal teams, including marketing, product development, and customer success, to drive customer acquisition, retention, and product enhancements.</li>\n<li>Develop a deep understanding of our products, features, and benefits to effectively demonstrate their value to prospective clients.</li>\n<li>Stay up-to-date with industry trends, competitor offerings, and market dynamics to identify opportunities and maintain a competitive edge.</li>\n<li>Support positioning within the product itself, working with product to drive content creation around feature releases</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<ul>\n<li>Proven experience in B2B SaaS sales, ideally in the cloud data warehouse, customer data platform, or marketing technology space, with a track record of meeting or exceeding sales targets</li>\n<li>Excellent verbal and written communication skills, with the ability to deliver compelling presentations and negotiate effectively with clients</li>\n<li>Proactive, self-starter with a strong work ethic and the ability to work independently in a fast-paced, target-driven environment</li>\n<li>Ability to build and maintain strong relationships with customers, prospects, and internal stakeholders</li>\n<li>Ability to support demand generation efforts and work collaboratively to build pipeline</li>\n<li>Collaborative style when working across teams</li>\n<li>Quick learner who can absorb and understand the dynamic MarTech landscape at pace</li>\n<li>Strong analytical and problem-solving skills to identify customer needs and propose tailored solutions</li>\n<li>Flexibility to travel for key meetings at your discretion</li>\n<li>Proficiency in the Google office suite (e.g. Gmail, Google Slides), Slack, and Salesforce CRM, Gong and Outreach</li>\n</ul>\n<h2><strong>What We Offer</strong></h2>\n<ul>\n<li>100% coverage of medical premiums for employee AND family</li>\n<li>Flexible PTO</li>\n<li>Generous Maternity and Paternity Leave</li>\n<li>Remote work, quarterly wellness, and client support stipends</li>\n<li>Professional Development stipend</li>\n</ul>\n<p><em>In compliance with the state and city salary transparency requirements, the potential salary for this position is from $100,000 to $130,000 which represents a range commensurate with experience.</em></p>\n<p><strong>Visa sponsorship for this role is currently not available.</strong></p>\n<p>We’re proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status.</p>\n<p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</p>",
        "url": "https://jobicy.com/jobs/91253-account-executive-36",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:13:55",
        "salary": "USD 100,000 - 130,000",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/112a03eea58b795f9e0cc7f32e50bc8f.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Technical Support Tier II, Integration",
        "company": "1Password",
        "location": "UK",
        "description": "As a Technical Support Tier II &amp;#8211; Integration, your role is to troubleshoot Tier 2 issues affecting our customers. These issues could include first-level escalations from within our team, more complex reliability issues, and sometimes novel issues from 1Password’s Extended Services, ranging from troubleshooting our CI/CD integrations to handling queries related to Extended Access Management&amp;#8230;.",
        "html_description": "<p>As a Technical Support Tier II &#8211; Integration, your role is to troubleshoot Tier 2 issues affecting our customers. These issues could include first-level escalations from within our team, more complex reliability issues, and sometimes novel issues from 1Password’s Extended Services, ranging from troubleshooting our CI/CD integrations to handling queries related to Extended Access Management. This role is within our Customer Experience Team, or as we like to call it at 1Password: &#8220;CX&#8221;!</p>\n<p>You are equipped with the competencies required to comfortably deal with these more complex issues in a few primary areas of support; alongside this, you have developed competencies to support Tier 1 issues for all of our Extended Services. You contribute in the Tier 2 and Tier 1 spaces respectively, and take on more of a supportive role for your junior colleagues when required.</p>\n<p>This is a remote opportunity within the UK. The starting hours for this role will be as early as 6am GMT/UTC and includes weekend shifts, i.e. Tuesday to Saturday, Sunday to Thursday.</p>\n<h2>What we&#8217;re looking for</h2>\n<ul>\n<li>2-3 years related work experience</li>\n<li>Working knowledge of cloud platforms, identity platform providers, and adjacent services (e.g AWS, Okta, Docker, Kubernetes, etc.)</li>\n<li>Advanced understanding of technologies that impact 1Password products and solutions including developer tools, SIEM platforms, network proxies, VPNs, etc.</li>\n<li>Advanced knowledge of Web Service integrations using REST API</li>\n<li>Familiar with virtualization and provisioning concepts</li>\n<li>Understands cloud infrastructure and has experience deploying containerized applications on cloud platforms</li>\n<li>Knowledge of networking concepts like DNS, TCP/IP ports, etc. Experience with troubleshooting tools like dig, IP address lookup, checking ports, etc.</li>\n<li>Basic scripting ability and has experience in a broad range of programming languages</li>\n<li>Hands on experience with UNIX/LINUX and Windows based platforms</li>\n<li>Preferred: previous experience with the 1Password product</li>\n<li>Preferred: experience working for an organization in the technology space</li>\n</ul>\n<h2>What you can expect</h2>\n<p><b>Deliverables &amp; KPIs:</b></p>\n<ul>\n<li><i>Customer Focus</i> &#8211; Interpret customer requests for technical assistance and address needs effectively and accurately, while maintaining an empathetic, positive, and professional attitude towards the customer at all times. Effectively communicate technical issues to customers, surfacing information readily available through support documentation both internally and externally.</li>\n<li><i>Problem Solving</i> &#8211; Reproduce, diagnose and resolve routine tier 2 queries across your primary areas of support for our Extended Services: 1Password CLI, Events API, Single Sign On (SSO), SSH Tools, Automated Provisioning, Secrets Automation, and Extended Access Management (XAM).</li>\n<li><i>Zoom Support </i>&#8211; Comfortable giving support calls for up to tier 2 issues when required to more quickly resolve customer questions/issues.</li>\n<li><i>System Capability</i> &#8211; Efficiently navigate and utilize internal CX tech stack and customer management systems, in the context of a Technical Rep. Organize and capture knowledge for collaboration and knowledge sharing with the Extended Services team.</li>\n<li><i>Ticket Queue Monitoring</i> &#8211; Triage incoming new tickets or escalations from CX Service and Technical &#8211; Core teams. Assess whether the escalation’s root cause is one of our integrations and liaise with the Core team as needed. Escalates Extended Services’ tickets to a higher tier as required.</li>\n<li><i>Productivity Expectations</i> &#8211; Follows established workflows and adheres to performance expectations for your level in the Extended Services team.</li>\n<li><i>Customer Advocacy</i> &#8211; Where appropriate, file new Gitlab issues for up to tier 2 tickets and feature requests, on behalf of customers for the attention of internal teams. Further, stay up to date with ongoing issues and provide customers with workarounds, where possible.</li>\n<li><i>Mentorship and Collaboration</i> &#8211; Is available to answer questions and support junior representatives via Slack, and is involved in CX’s cross-functional Slack channels. Works with senior representatives to create internal troubleshooting documentation for our team when required.</li>\n</ul>\n<p><b>Product Knowledge:</b></p>\n<ul>\n<li><i>CLI </i>&#8211; Can set-up 1Password CLI with SLS OPH integration, provide high level guidance on advanced CLI solutions such as parsing with jq and chaining multiple CLI commands, and knowledge with using CLI and service accounts, shell integration, op inject, op run, and common use cases.</li>\n<li><i>Events API</i> &#8211; Able to implement Events API integration with Splunk and DataDog following documentation and comfortable parsing/filtering API responses with jq.</li>\n<li><i>SSO</i> &#8211; Can set-up and configure SSO unlock for 1Password accounts using fully supported IdPs and troubleshoot SSO reliability issues using Kibana.</li>\n<li><i>SSH Tools</i> &#8211; Can set-up and configure standard SSH agent integration using OPH and OS specific configurations.</li>\n<li><i>SCIM</i> &#8211; Support standard SCIM configurations with our supported external Identity Providers (IdPs) using supported deployment methods in cloud environments.</li>\n<li><i>Secrets Automation</i> &#8211; Usability knowledge regarding supported SDKs for Connect SDK and can deploy Connect servers in supported cloud environments with all supported deployment methods.</li>\n</ul>\n<p>We believe in the power of remote work, but we also recognize that in-person connection is sometimes important to help us achieve our mission. While we are a remote-first company, occasional travel for in-person engagement will be a part of this role. Frequency will depend on role and responsibilities, and may include, but is not limited to, annual department-wide offsites, team meetings, and customer/industry events. These events will typically be held in varying locations across Canada and the US.</p>\n<h2><b>What we offer</b></h2>\n<p>We believe in working hard, and resting hard. We’re always looking for new ways to support our team members, but here’s a glance at what we currently offer:</p>\n<p><b>Health and wellbeing</b></p>\n<p>&gt;  Maternity and parental leave top-up programs</p>\n<p>&gt;  Wellness spending account</p>\n<p>&gt;  Generous PTO policy</p>\n<p>&gt;  Company-wide wellness days off scheduled throughout the year</p>\n<p>&gt;  Wellness Coach membership</p>\n<p>&gt;  Comprehensive health coverage</p>\n<p><b> Growth and future </b></p>\n<p>&gt;  Employee stock option program for all full-time employees</p>\n<p>&gt;  Retirement matching program</p>\n<p>&gt;  Training budget, 1Password University access, and learning sessions</p>\n<p>&gt;  Free 1Password account (and friends and family discount!)</p>\n<p><b>Flexibility and community</b></p>\n<p>&gt;  Paid volunteer days</p>\n<p>&gt;  Employee-led DEIB programs and ERGs and ECGs</p>\n<p>&gt;  Fully remote environment</p>\n<p>&gt;  Peer-to-peer recognition through Bonusly</p>\n<p><i>1Password is proud to be an equal opportunity employer. We are committed to fostering an inclusive, diverse and equitable workplace that is built on trust, support and respect. We welcome all individuals and do not discriminate on the basis of gender identity and expression, race, ethnicity, disability, sexual orientation, colour, religion, creed, gender, national origin, age, marital status, pregnancy, sex, citizenship, education, languages spoken or veteran status. Be yourself, find your people and share the things you love. </i></p>\n<p><i>Accommodation is available upon request at any point during our recruitment process. If you require an accommodation, please speak to your talent acquisition partner or email us at nextbit@agilebits.com and we’ll work to meet your needs. </i></p>\n<p><i>Remote work is a part of our DNA. Given that our company was founded remotely in 2005, we can safely say we&#8217;re experts at building remote culture. That said, remote work at 1Password does mean working from your home country. If you&#8217;ve got questions or concerns about this, your talent partner would be happy to address them with you.</i></p>\n<p><i>Successful applicants will be required to complete a background check that may consist of prior employment verification, reference checks, education confirmation, criminal background, publicly available social media, credit history, or other information, as permitted by local law.</i></p>",
        "url": "https://jobicy.com/jobs/114294-technical-support-tier-ii-integration",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:13:53",
        "salary": "",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200909195848-296323.png",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. Commercial Counsel",
        "company": "Life360",
        "location": "USA",
        "description": "We are seeking a Senior Commercial Counsel to join our expanding team. This is an exciting opportunity to work closely with teams across Life360 to support a high-growth phase for the Life360 family of mobile software applications and hardware devices, including Tile and Jiobit. In this position, you will be the primary attorney responsible for&amp;#8230;",
        "html_description": "<p>We are seeking a Senior Commercial Counsel to join our expanding team. This is an exciting opportunity to work closely with teams across Life360 to support a high-growth phase for the Life360 family of mobile software applications and hardware devices, including Tile and Jiobit.</p>\n<p>In this position, you will be the primary attorney responsible for commercial contracting for Life360’s growing data and advertising initiatives. You will negotiate and draft data agreements, advertising agreements, technology agreements, and partnership and collaboration agreements. The position also involves supporting business programs across the company and providing strategic legal advice to key stakeholders. In addition, you will support other commercial contracting needs, including helping with vendor agreements, consulting agreements, reseller and distribution agreements, DPAs, and NDAs as needed. You will report to the Deputy General Counsel and collaborate closely with cross-functional teams, including Finance, Product, Privacy, Engineering, and Devices.</p>\n<p>The US-based salary range for this position is $178,500 to $263,000. We take into consideration an individual&#8217;s background and experience in determining final salary- therefore, base pay offered may vary considerably depending on geographic location, job-related knowledge, skills, and experience. The compensation package includes a wide range of medical, dental, vision, financial, and other benefits, as well as equity.</p>\n<h2>What You’ll Do:</h2>\n<ul>\n<li>Be the primary in-house attorney responsible for negotiating and drafting a wide variety of data agreements, advertising agreements, technology agreements, and partnership and collaboration agreements.</li>\n<li>Build templates and playbooks, conduct training, and develop legal processes to support Life360’s growing data and advertising initiatives.</li>\n<li>Provide transaction assistance with general commercial contracts as needed, including vendor agreements, consulting agreements, reseller and distribution agreements, DPAs, and NDAs.</li>\n<li>Work with Privacy and Product attorneys to analyze and mitigate commercial risks related to data privacy, intellectual property, and regulatory compliance.</li>\n<li>Support contract lifecycle management processes, ensuring compliance with internal policies and applicable laws.</li>\n<li>Build relationships and collaborate with teams across the company to understand business needs and translate them into effective commercial agreements.</li>\n</ul>\n<h2>What We’re Looking For:</h2>\n<ul>\n<li>Must have significant hands-on experience negotiating and drafting data and advertising agreements for apps or websites, including familiarity with the ad-tech ecosystem, as well as data privacy regulations (e.g., GDPR, CCPA) and their application in commercial transactions.</li>\n<li>5-12 years of legal experience overall, including at least 3 years of in-house experience. Prefer a mix of law firm and in-house, plus experience counseling consumer technology clients.</li>\n<li>Excellent communication and collaboration skills, and ability to work effectively with cross-functional teams.</li>\n<li>Detail-oriented, and able to prioritize and manage competing demands in a fast-paced environment.</li>\n<li>Strong analytical and problem-solving skills, ability to exercise good judgment with information available, and a solutions-oriented, business-friendly mindset.</li>\n<li>J.D. from an accredited law school and membership in at least one state bar.</li>\n</ul>\n<h2>Our Benefits:</h2>\n<ul>\n<li>Competitive pay and benefits</li>\n<li>Medical, dental, vision, life and disability insurance plans (100% paid for employees)</li>\n<li>401(k) plan with company matching program</li>\n<li>Mental Wellness Program &amp; Employee Assistance Program (EAP) for mental well being</li>\n<li>Flexible PTO, 13 company wide days off throughout the year</li>\n<li>Winter and Summer Week-long Synchronized Company Shutdowns</li>\n<li>Learning &amp; Development programs</li>\n<li>Equipment, tools, and reimbursement support for a productive remote environment</li>\n<li>Free Life360 Platinum Membership for your preferred circle</li>\n<li>Free Tile Products</li>\n</ul>\n<h2>Life360 Values:</h2>\n<p>Our company’s mission driven culture is guided by our shared values to create a trusted work environment where you can bring your authentic self to work and make a positive difference</p>\n<ul>\n<li>Be a Good Person &#8211; We have a team of high integrity people you can trust.</li>\n<li>Be Direct With Respect &#8211; We communicate directly, even when it’s hard.</li>\n<li>Members Before Metrics &#8211; We focus on building an exceptional experience for families.</li>\n<li>High Intensity, High Impact &#8211; We do whatever it takes to get the job done.</li>\n</ul>\n<h2>Our Commitment to Diversity:</h2>\n<p>We believe that different ideas, perspectives and backgrounds create a stronger and more creative work environment that delivers better results. Together, we continue to build an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. It fuels our innovation and connects us closer to our customers and the communities we serve. We strive to create a workplace that reflects the communities we serve and where everyone feels empowered to bring their authentic best selves to work.</p>\n<p><em>We are an equal opportunity employer and value diversity at Life360. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status or any legally protected status.  </em></p>\n<p><em>We encourage people of all backgrounds to apply. We believe that a diversity of perspectives and experiences create a foundation for the best ideas. Come join us in building something meaningful.</em> <em>Even if you don’t meet 100% of the below qualifications, you should still seriously consider applying!</em></p>",
        "url": "https://jobicy.com/jobs/115935-senior-commercial-counsel",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:09:51",
        "salary": "USD 178,500 - 263,000",
        "job_type": "full-time",
        "category": "Legal &amp; Compliance",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/f269bad3-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "iOS Engineer - Poe",
        "company": "Quora",
        "location": "Canada,  Europe,  USA",
        "description": "We are seeking a talented iOS Engineer to join us in building Poe, an exciting new platform at the forefront of AI. You will work at the cutting edge of technology to design, develop, and maintain the Poe iOS app. This includes collaborating with our product team to build new AI-driven user features, crafting a&amp;#8230;",
        "html_description": "<p>We are seeking a talented iOS Engineer to join us in building Poe, an exciting new platform at the forefront of AI. You will work at the cutting edge of technology to design, develop, and maintain the Poe iOS app. This includes collaborating with our product team to build new AI-driven user features, crafting a scalable mobile architecture, and creating tools to speed up iteration. As a founding member, you&#8217;ll have a direct influence on the product roadmap and plenty of opportunities to shape the future of AI and mobile platforms.</p>\n<p>Poe has experienced awesome growth so far, and as an iOS Engineer for Poe, you can build the future of AI and technology while gaining invaluable experience with complex problems and systems. If you have a passion for AI, emerging technologies, and mobile development, this role offers an invaluable opportunity to spearhead progress.</p>\n<h2><strong>Responsibilities:</strong></h2>\n<ul>\n<li>Work within a small team of mobile engineers to design, build, and maintain the Poe iOS app</li>\n<li>Build new user-facing features and help drive the Poe product roadmap</li>\n<li>Create tools and infrastructure to enable rapid development of the Poe mobile experience</li>\n<li>Collaborate with the Poe product team and other engineers to enhance the overall user experience</li>\n<li>Own the entire software development process from timeline estimation to coding, testing and release</li>\n</ul>\n<h2><strong>Minimum Requirements:</strong></h2>\n<ul>\n<li><strong>Ability to be available for meetings and impromptu communication during Quora&#8217;s “</strong><strong>coordination hours</strong><strong>&#8221; (Mon-Fri: 9am-3pm Pacific Time)</strong></li>\n<li>2+ years of full-time experience in iOS development with Swift</li>\n<li>Strong knowledge of iOS frameworks, and mobile trends</li>\n<li>High attention to detail in all aspects of development from performance to UI</li>\n<li>A desire to work in a fast-paced, innovative environment and learn continuously</li>\n<li>Self-starter with a strong sense of responsibility; whether it be fixing bugs in a timely manner or proactively identifying issues in order to unblock yourself for a given project</li>\n</ul>\n<h2><strong>Preferred Requirements:</strong></h2>\n<ul>\n<li>Experience with SwiftUI or GraphQL</li>\n<li>Interest in working in the AI space</li>\n</ul>\n<p><strong>At Quora, we value diversity and inclusivity and welcome individuals from all backgrounds, including marginalized or underrepresented groups in tech, to apply for our job openings. We encourage all candidates who share a passion for growing the world’s knowledge, even those who may not strictly meet all the preferred requirements, to apply, as we know that a diverse range of perspectives can have a significant impact on our products and our culture.</strong></p>\n<h2><strong>Additional Information:</strong></h2>\n<p>We are accepting applications on an ongoing basis.</p>\n<p>Quora offers a wide range of benefits including medical/dental/vision coverage, equity refreshers, remote work reimbursement, paid time off, employee assistance programs, and more. Benefits are country-specific and may vary. For more information on benefits, visit this link: www.careers.quora.com/benefits</p>\n<p>There are many factors that will determine the starting pay, including but not limited to experience, location, education, and business needs.</p>\n<ul>\n<li>US candidates only: For US based applicants, the salary range is $128,193 &#8211; $225,160 USD + equity + benefits.</li>\n<li>Canada candidates only: For Canada based applicants, the salary range is $155,509 &#8211; $234,118 CAD + equity + benefits.</li>\n</ul>\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/116611-ios-engineer-poe",
        "source": "Jobicy",
        "posted_at": "2025-03-30 14:42:43",
        "salary": "CAD 155,509 - 234,118",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200916172339-629302.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Customer Support Phone Specialist",
        "company": "Givebutter",
        "location": "Philippines",
        "description": "Givebutter is looking for a Phone Support Specialist with a positive attitude, attention to detail, and the ability to anticipate the needs of our users. As a member of our Customer Support team, you will have the opportunity to support the fundraising efforts of a large and diverse group of NPOs, ranging from small nonprofits&amp;#8230;",
        "html_description": "<p>Givebutter is looking for a Phone Support Specialist with a positive attitude, attention to detail, and the ability to anticipate the needs of our users. As a member of our Customer Support team, you will have the opportunity to support the fundraising efforts of a large and diverse group of NPOs, ranging from small nonprofits to large educational institutions to Fortune 500 companies. The primary responsibility of this role will be responding to inquiries from current users via phone. You will need to be comfortable speaking with users, guiding them through their questions, and providing clear, friendly, and helpful support over the phone. If you enjoy problem-solving on the spot, building relationships with callers, and making an impact with every call, this role is for you. If the thought of waking up every day and getting to “help people help people” excites you, we look forward to hearing from you. </p>\n<p>This is a direct-hire, permanent position. You will be an employee of Givebutter via an EoR called Deel.</p>\n<p>Tentative Start date: 4/21/25<br />\nPay rate: PHP 550/hour<br />\nPaid training schedule: Monday &#8211; Friday 9 PM &#8211; 6AM PH time for 3 months (40 hours)<br />\nPermanent schedule: Monday &#8211; Friday 9 PM &#8211; 6AM PH time (40 hours)</p>\n<h2><strong>Responsibilities </strong></h2>\n<ul>\n<li>Respond promptly and accurately to inbound user inquiries via phone.</li>\n<li>Use a screenshare tool as needed while supporting users.</li>\n<li>Proactively identify user needs and guide them through specific features and workflows.</li>\n<li>Troubleshoot issues by testing different scenarios, impersonating users, analyzing potential product malfunctions, and submitting escalations as needed.</li>\n<li>Collect and document user feedback, feature requests, and workarounds, and share insights to help improve the product.</li>\n<li>Adhere to company and department Standard Operating Procedures (SOPs).</li>\n<li>Take on special projects and tasks as assigned by Support Leadership.</li>\n</ul>\n<h2><strong>Requirements </strong></h2>\n<ul>\n<li>3+ years of experience as a Phone Support Agent (preferably in the tech industry)</li>\n<li>2+ years of remote experience</li>\n<li>Talented at making customers feel comfortable and valued by using a warm, friendly tone and encouraging casual, natural conversation.</li>\n<li>Ability to establish trust with users by speaking confidently, showcasing expertise, and demonstrating the ability and willingness to resolve their concerns.</li>\n<li>Empathetic and able to show understanding of the user’s issue and convey compassion, especially when dealing with frustrated or upset users.</li>\n<li>Excellent written and verbal communication skills in English.</li>\n<li>High adaptability and positive attitude in a dynamic environment</li>\n<li>Experience using help desk software and remote tools (i.e. Intercom, Slack, Notion)</li>\n<li>Excellent written and verbal communication skills in English</li>\n<li>Agents must provide their own computer (at least 8GB RAM)</li>\n<li>A second monitor is recommended but not required.</li>\n<li>Agents must provide their own stable internet (preferably wired and at least 50mbps)</li>\n<li>Noise-canceling headphones with a dedicated microphone</li>\n</ul>\n<h2><strong><u>Benefits &#8211; specific to Philippines agents only</u></strong></h2>\n<ul>\n<li><strong>Remote Work: </strong>Work from anywhere. Must be a citizen of the Philippines for this role.</li>\n<li><strong>Job Security: </strong>Employed full-time by Givebutter via an EOR called Deel.</li>\n<li><strong>Health Insurance: </strong>We offer HMO medical insurance covered 100% for employees.</li>\n<li><strong>Holiday Pay: </strong> Givebutter Support is open 24/7. We honor all PH labor laws regarding holiday pay, overtime, and shift differentials.</li>\n<li><strong>Performance Bonuses: </strong>for meeting KPIs, eligible after 3 months of employment</li>\n<li><strong>PTO</strong>: 15 days PTO annually</li>\n<li><strong>Additional annual leaves: </strong> Bereavement: 5 days, Maternity: 105 days, Paternity: 30 days, Adoption: 60 days, Domestic Violence: 10 days</li>\n<li><strong>Charitable Giving: </strong>Employees are provided a monthly allowance of up to $50 USD/month to any verified nonprofit they wish to support on Givebutter.</li>\n<li><strong>Love What You Do:</strong> We are a mission-driven company serving the charitable sector. Feel good about the work you&#8217;re doing and the company you work for.<em>Please note that the benefits listed below are specific to US Employees. </em></li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li><strong>Remote Work:</strong> Work from anywhere in the United States.</li>\n<li><strong>Health Insurance: </strong>We offer Medical, Dental, and Vision insurance covered 100% for employees as well as HSA and FSA accounts.</li>\n<li><strong>Mental Health: </strong>Givebutter health insurance plans come with access to a TalkSpace membership.</li>\n<li><strong>401k:</strong> We offer access to a retirement planning account for all employees, with a match coming in April 2025.</li>\n<li><strong>Vacation and Holiday: </strong>Givebutter offers a Flexible PTO policy with uncapped Vacation days. Givebutter is closed for a whole week in the summer for an employee Wellness Week.</li>\n<li><strong>Parental Leave: </strong>We offer 12 weeks of paid parental leave for both primary and secondary caregivers.</li>\n<li><strong>Home Office Stipend:</strong> Upgrade your home office with company-sponsored expenses, including high-quality laptops, monitors, and modern technology.</li>\n<li><strong>Charitable Giving: </strong>Employees are encouraged to donate up to $50/month to any verified nonprofit they wish to support on Givebutter.</li>\n<li><strong>Professional Development: </strong>We offer learning and development reimbursement opportunities.</li>\n<li><strong>Love What You Do:</strong> We are a mission-driven company serving the charitable sector. Feel good about the work you&#8217;re doing and the company you work for.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/116607-customer-support-phone-specialist",
        "source": "Jobicy",
        "posted_at": "2025-03-30 10:15:01",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/05/51ca261310065df6b11ed6c81972be72.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Senior Product Manager, Growth",
        "company": "Givebutter",
        "location": "USA",
        "description": "Givebutter is the most-loved nonprofit fundraising and CRM platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Use of the Givebutter platform&amp;#8230;",
        "html_description": "<p>Givebutter is the most-loved nonprofit fundraising and CRM platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Use of the Givebutter platform is completely free with a 100% transparent tip-or-fee model.</p>\n<p>Givebutter has been certified as a Great Place to Work® in 2021, 2022, 2023, and 2024, and is the #1 rated nonprofit software company on G2 across multiple categories.</p>\n<p>Our mission is to empower the changemaker in all of us. We believe giving should be fun, so you’ll want to do it again, and we also believe that work should be fun, so that you’ll have the greatest impact. We are excited to hear from talented people who want to work with other talented people in making the world a butter place—and have fun along the way.</p>\n<h2>We want to hear from people who…</h2>\n<ul>\n<li>Have a passion for growing software businesses and staying up to date with industry leaders like Elena Verna, Kyle Poyar, Lenny Rachitsky, and Brian Balfour.</li>\n<li>Love doing Growth work and strive to be among the best in the field.</li>\n<li>Enjoy running A/B tests and experiments to optimize performance.</li>\n<li>Are highly analytical and can translate strategic insights into measurable business impact.</li>\n<li>Find scouring data for insights deeply satisfying.</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Own the product roadmap for acquiring and onboarding new accounts into Givebutter.</li>\n<li>Partner with the VP of Growth to define the product strategy for the Growth pod.</li>\n<li>Collaborate with Design, Engineering, and Marketing to build onboarding experiences that drive activation and increase new account acquisition.</li>\n<li>Analyze data and customer research to develop product experiences and experiments that improve activation and acquisition.</li>\n<li>Lead experiments and new features from ideation to deployment, ensuring they deliver meaningful business impact.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>5+ years of product management experience, ideally in a high-scale B2B SaaS or data-driven B2C environment with 100K+ MAUs.</li>\n<li>Deep understanding of SaaS unit economics, including cohort analysis, CAC, conversion rates, retention, and customer lifetime value.</li>\n<li>Data fluency—comfortable with SQL and spreadsheets; Python is a plus.</li>\n<li>Strong analytical and strategic thinking—able to connect product, marketing, and business objectives through data-driven decision-making.</li>\n<li>Experimentation mindset—experience running A/B tests, pricing tests, and interpreting results.</li>\n<li>Bonus: Background in Statistics, Finance, Economics, or Performance Marketing.</li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li><strong>Remote Work:</strong> Work from anywhere in the United States.</li>\n<li><strong>Health Insurance: </strong>We offer Medical, Dental, and Vision insurance covered 100% for employees as well as HSA and FSA accounts.</li>\n<li><strong>Mental Health: </strong>Givebutter health insurance plans come with access to a TalkSpace membership.</li>\n<li><strong>401k:</strong> We offer access to a retirement planning account for all employees, with a match coming in April 2025.</li>\n<li><strong>Vacation and Holiday: </strong>Givebutter offers a Flexible PTO policy with uncapped Vacation days. Givebutter is closed for a whole week in the summer for an employee Wellness Week.</li>\n<li><strong>Parental Leave: </strong>We offer 12 weeks of paid parental leave for both primary and secondary caregivers.</li>\n<li><strong>Home Office Stipend:</strong> Upgrade your home office with company-sponsored expenses, including high-quality laptops, monitors, and modern technology.</li>\n<li><strong>Charitable Giving: </strong>Employees are encouraged to donate up to $50/month to any verified nonprofit they wish to support on Givebutter.</li>\n<li><strong>Professional Development: </strong>We offer learning and development reimbursement opportunities.</li>\n<li><strong>Love What You Do:</strong> We are a mission-driven company serving the charitable sector. Feel good about the work you&#8217;re doing and the company you work for.</li>\n</ul>\n<h2>Compensation</h2>\n<ul>\n<li>Total Cash Compensation Range $145K – $170K • Offers Equity • Offers Bonus</li>\n</ul>",
        "url": "https://jobicy.com/jobs/116606-senior-product-manager-growth",
        "source": "Jobicy",
        "posted_at": "2025-03-30 10:12:38",
        "salary": "USD 145,000 - 170,000",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/05/51ca261310065df6b11ed6c81972be72.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Customer Support Specialist",
        "company": "V7",
        "location": "Europe",
        "description": "As a Customer Support Specialist, you will be responsible for managing V7&amp;#8217;s customer communication through email, chat and the occasional calls, responding to support queries from customers and leads. Expect to have &amp;lt; 20 and high impact customer conversations a day. You will coordinate with multiple internal teams: with Product and Engineering for bug resolution&amp;#8230;",
        "html_description": "<p>As a Customer Support Specialist, you will be responsible for managing V7&#8217;s customer communication through email, chat and the occasional calls, responding to support queries from customers and leads. Expect to have &lt; 20 and high impact customer conversations a day.</p>\n<p>You will coordinate with multiple internal teams: with Product and Engineering for bug resolution and product feedback, and with Sales, Customer Success, and Account Management to ensure that every V7 customer is set up for success.</p>\n<p>Nothing is more important to a young company like ours than the excellence of our employees &#8211; in their performance, psychological wellbeing, and culture. We work hard to create a collaborative, high-trust environment for outstanding people to do outstanding work together, and we actively encourage vision and ownership in your role.</p>\n<h2><strong>What will I be doing:</strong></h2>\n<ul>\n<li>This role is to cover our UTC time zone shift, so you’d be working the standard 9am-5pm UTC</li>\n<li>Responding to V7’s customers over email, chat, and calls.</li>\n<li>Troubleshooting and investigating customer-reported bugs.</li>\n<li>Reporting bugs to our Engineering Team and providing customer updates.</li>\n<li>Collecting and sharing user feedback with our Product Team.</li>\n<li>Collaborating with other customer-facing functions like Customer Success and Sales to create an industry-leading customer experience.</li>\n<li>Contributing to V7’s ~95% CSAT and G2 top-rated support experience.</li>\n</ul>\n<h2><strong>What are we looking for:</strong></h2>\n<ul>\n<li>Experience working in customer-facing support role in a B2B SaaS environment.</li>\n<li>Logical, problem-solving thinking, ability to work unassisted, without a script.</li>\n<li>Fluency in English with excellent soft-skills.</li>\n<li>Experience in a high/hyper-growth environment preferred, with a proactive attitude.</li>\n<li>Thrived as a another fast-paced SaaS startup or scale-up during a high-growth phase.</li>\n<li>Flexibility &#8211; this role may require some shifts outside of typical working hours.</li>\n<li><em>Preferred to have</em>: Experience with Python and cloud integrations.</li>\n<li><em>Preferred to have</em>: You have demonstrable experience at the frontier of AI, including the applications of Large Language Models and GenAI.</li>\n</ul>\n<h2><strong>What’s in it for you:</strong></h2>\n<ul>\n<li>Remote role, open to UK and EU countries.</li>\n<li>V7 were named as Linkedin’s No2 top startup in the UK in 2023 and 1st on Sifted’s top B2B rising stars for 2024.</li>\n<li>Top 15% quartile stock options through a EMI scheme.</li>\n<li>Private Healthcare via Vitality.</li>\n<li>Learning and Development wallet of £800 per year.</li>\n<li>Monthly well being and mental health budget.</li>\n<li>Personalised benefits platform via Thanks Ben.</li>\n<li>Enhanced parental leave.</li>\n<li>4-day company wide retreats in stunning locations.</li>\n<li>Soho London HQ office with a barista, fresh fruit, and other amenities.</li>\n<li>Paid tickets, accommodation, and travel to relevant conferences, nationally or internationally (NeurIPS, ICCV, CVPR, &#8230;) to expand your network &amp; knowledge during normal times.</li>\n</ul>\n<p><em><strong>What&#8217;s the interview process</strong></em><strong>:</strong> 1st Hiring Manager screen, 2nd Written exercise, 3rd Interview with Head of Product and 4th stage panel interview and task (2 hours).</p>",
        "url": "https://jobicy.com/jobs/116604-customer-support-specialist-8",
        "source": "Jobicy",
        "posted_at": "2025-03-30 09:52:17",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/08/eeeefc81-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sales Development Representative",
        "company": "Boulevard",
        "location": "USA",
        "description": "Our sales team is continuously thriving and expanding. We&amp;#8217;re always in search of talented professionals who share our passion for the self-care industry to join our sales force. If you&amp;#8217;re an enthusiastic salesperson looking for opportunities to grow with us, we encourage you to apply. Come be a part of our evolving success story! What&amp;#8230;",
        "html_description": "<p>Our sales team is continuously thriving and expanding. We&#8217;re always in search of talented professionals who share our passion for the self-care industry to join our sales force.</p>\n<p>If you&#8217;re an enthusiastic salesperson looking for opportunities to grow with us, we encourage you to apply. Come be a part of our evolving success story!</p>\n<h2><strong>What you&#8217;ll do here:</strong></h2>\n<p>Our Sales Development Representative actively turns interested clients into long-lasting partners. The SDR drives revenue for the business by understanding client needs and offering recommended actions. They serve as trusted advisors and partners to our clients, maintaining a highly consultative approach</p>\n<ul>\n<li>Outbound prospecting to potential customers that fit in our Ideal Customer Personas and be the first point of contact between potential customers and Boulevard</li>\n<li>Utilize social media vehicles to access specific individuals in a prospect/customer’s buying process and qualify outbound leads via cold call</li>\n<li>Qualify prospects using a defined Sales Process.</li>\n<li>Outreach to new prospects to initiate the sales process and build the excitement around the product and the brand</li>\n<li>Assess prospect’s needs and identify pain points</li>\n<li>Set up meetings between (prospective) customers and sales executives</li>\n<li>Utilize Salesforce and Outreach to manage day-to-day activities and update management of such activity through system generated activity reports.</li>\n<li>Demonstrate a working knowledge of all of Boulevard’s service and internal systems necessary to service customers.</li>\n<li>Meet or exceed management defined activity and revenue goals</li>\n<li>Demonstrate focused daily activity around calls and email metrics</li>\n<li>Demonstrate an understanding of and remain current with the POS market in general and business management SaaS solutions specifically.</li>\n</ul>\n<h2><strong>What you&#8217;ll need to thrive:</strong></h2>\n<ul>\n<li><strong>Experience: </strong>3+ months of sales development experience, with a preference for candidates who have successfully sold within the beauty, aesthetics, or self-care market</li>\n<li><strong>Expert Communicator: </strong>You love cold prospecting and speaking with new people over the phone</li>\n<li><strong>Organized:</strong> Organizational and time-management skills</li>\n<li><strong>Action Oriented:</strong> A strong sense of urgency that moves clients from analysis to action</li>\n<li><strong>High Energy:</strong> Enthusiasm for working in a high-growth entrepreneurial environment</li>\n<li><strong>Ambitious: </strong>You have a competitive spirit</li>\n</ul>\n<p>In addition to the wonderful people you’ll get to work with and challenging projects that’ll push you &#8211; Boulevard is here to make sure you’re always at the top of your game emotionally, mentally, and physically.</p>\n<ul>\n<li>✨ We’ve got you covered with a 401(k) match plus dental, medical, vision, and life insurance.</li>\n<li> Take a break whenever you need with our flexible vacation day policy.</li>\n<li> Fully remote so you can choose where you want to work. You’ll receive a work from home stipend every month.</li>\n<li> Family planning resources and specialized support programs.</li>\n<li> Equity: get ahead on the ground floor and grow with Boulevard.</li>\n<li> Boulevard Bucks Learning and Development program allows employees to explore businesses in the market we serve.</li>\n</ul>\n<p><em>Boulevard Labs, Inc. is an Equal Opportunity Employer committed to hiring a diverse workforce and sustaining an inclusive culture. All employment decisions at Boulevard Labs, Inc. are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.</em></p>",
        "url": "https://jobicy.com/jobs/110997-sales-development-representative-9",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:25:15",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/a45167e12b0ed51058a884cf9cd0c76f.png",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Director - Product Marketing B2B (Viator)",
        "company": "Tripadvisor",
        "location": "UK",
        "description": "We are seeking an experienced and results-driven Director of Product Marketing to lead our B2B product marketing team. The ideal candidate will be a “player coach” who is a stronger writer and presenter, possesses a deep understanding of B2B marketing strategies, along with a robust background in product marketing management (PMM). With a proven track&amp;#8230;",
        "html_description": "<p>We are seeking an experienced and results-driven Director of Product Marketing to lead our B2B product marketing team. The ideal candidate will be a “player coach” who is a stronger writer and presenter, possesses a deep understanding of B2B marketing strategies, along with a robust background in product marketing management (PMM). With a proven track record in team development and measurable success, this leader will drive our product marketing efforts through a period of significant investment and growth.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<p>Strategic Leadership:</p>\n<ul>\n<li>Lead and develop a high-performing product marketing team, fostering a culture of innovation and excellence.</li>\n<li>Define and implement product marketing plans that align with business objectives and drive growth.</li>\n<li>As part of a small group of leaders, establish and execute the company’s long term B2B investment and growth plans</li>\n</ul>\n<p>Market Analysis and Positioning:</p>\n<ul>\n<li>In collaboration with research, conduct thorough user and market research to understand customer needs that informs product strategy, segmentation and go-to-market strategies</li>\n<li>Develop clear product positioning and messaging that differentiates our offerings in the market.</li>\n</ul>\n<p>Product Launch and Go-to-Market Strategy:</p>\n<ul>\n<li>Oversee successful product launches, ensuring strategies are executed efficiently and effectively.</li>\n<li>Collaborate with cross-functional teams, including sales, product management, and customer success, to ensure alignment and optimal market entry.</li>\n</ul>\n<p>Performance Measurement and Optimization:</p>\n<ul>\n<li>Establish metrics for product marketing success and measure outcomes against goals.</li>\n<li>Use data-driven insights to optimize marketing strategies and achieve measurable improvements in performance.</li>\n</ul>\n<p>Team Development:</p>\n<ul>\n<li>Mentor and coach team members, fostering career growth and skill development.</li>\n<li>Build a culture that encourages creativity, accountability, and continuous improvement.</li>\n</ul>\n<p>Hands-On Execution:</p>\n<ul>\n<li>Be willing to &#8220;roll up your sleeves&#8221; and contribute directly to projects when necessary, demonstrating a scrappy, can-do attitude.</li>\n</ul>\n<p>Stakeholder Collaboration:</p>\n<ul>\n<li>Lock arms with Product Management to ensure close and productive team relationships in PMM:PM pairs, leading by example.</li>\n<li>Work closely with other key stakeholders to ensure alignment and communication of marketing initiatives and results.</li>\n<li>Serve as a thought leader and advocate for product marketing and B2B partners within the organization.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>8+ years of experience in product marketing management, along with a proven track record in core B2B marketing skill sets such as writing, business case building, and campaign development.</li>\n<li>5+ years of leadership experience, successfully managing and developing large, high-performing product marketing teams.</li>\n<li>Demonstrated ability to measure and optimize marketing outcomes, using data to drive decisions.</li>\n<li>Strong leadership skills with the ability to motivate and inspire teams.</li>\n<li>Exceptional strategic thinking, with a hands-on approach and willingness to dive into details.</li>\n<li>Excellent communication, interpersonal, and collaboration skills.</li>\n<li>Bachelor’s degree in marketing, business, or a related field; MBA preferred.</li>\n</ul>\n<h2><strong>Perks of Working at Viator</strong></h2>\n<ul>\n<li>Competitive compensation packages (routinely benchmarked against the latest industry data), including base salary, annual bonus, and equity.</li>\n<li>“Work your way” with flexibility to suit your lifestyle. Viator takes a remote-friendly approach to collaboration across a worldwide team, with the option to join on-site as often as you’d like.</li>\n<li>Flexible schedule. Work-life balance is ingrained in our culture by design. Trust and accountability make it work.</li>\n<li>Donation matching. Give back? Give more! We match qualifying charitable donations annually.</li>\n<li>Tuition assistance. Want to level up your career? We love to hear it! Receive annual support for qualified programs.</li>\n<li>Lifestyle benefit. An annual benefit to spend on yourself. Use it on travel, wellness, or whatever suits you.</li>\n<li>Travel perks. We believe that travel is employee development, so we provide discounts and more.</li>\n<li>Employee assistance program. We’re here for you with resources and programs to help you through life’s challenges.</li>\n<li>Health benefits. We offer great coverage and competitive premiums.</li>\n</ul>\n<h2><strong>Our Values</strong></h2>\n<ul>\n<li>We aspire to lead. Tap into your talent, ambition, and knowledge to bring us – and you – to new heights.</li>\n<li>We’re relentlessly curious. We push beyond the usual, the known, the “that’s just how it’s done.”</li>\n<li>We’re better together. We learn from, accept, respect, support, and value one another– and are creating something remarkable in the process.</li>\n<li>We serve our customers, always. We listen, question, respond, and strive for wow moments.</li>\n<li>We strive for better, not perfect. We won’t get it right the first time – or every time. We’ll provide a safe environment in which to make mistakes, iterate, improve, and grow.</li>\n<li>Our workplace is for everyone, as is our people powered platform. At Tripadvisor, we want you to bring your unique identities, abilities, and experiences, so we can collectively revolutionize travel and together find the good out there.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/114262-senior-product-marketing-manager-supply-api-viator",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:24:37",
        "salary": "",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210129125206-036216.jpg",
        "job_level": "Director",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. UX Researcher",
        "company": "Tripadvisor",
        "location": "UK",
        "description": "Viator, a Tripadvisor company, is the leading marketplace for travel experiences. We believe that making memories is what travel is all about. And with 300,000+ travel experiences to explore—everything from simple tours to extreme adventures (and all the niche, interesting stuff in between)—making memories that will last a lifetime has never been easier. With industry- leading flexibility and last-minute&amp;#8230;",
        "html_description": "<p>Viator, a Tripadvisor company, is the leading marketplace for travel experiences. We believe that making memories is what travel is all about. And with 300,000+ travel experiences to explore—everything from simple tours to extreme adventures (and all the niche, interesting stuff in between)—making memories that will last a lifetime has never been easier. With industry- leading flexibility and last-minute availability, it&#8217;s never too late to make any day extraordinary. Viator. One app, 300,000+ travel experiences you’ll remember.</p>\n<p>The Viator research team are looking for an experienced and motivated Senior UX researcher to lead high-impact research projects that drive key business metrics and product strategy. In this highly collaborative role, you will utilise qualitative and quantitative research methodologies to scope and deliver research that answers challenging business questions. You will be passionate about understanding our customers and translating their behaviour into actionable insight to inform design and product decisions. As a senior team member you will be a strong advocate for the user and will play a key role in collaborating with stakeholders to shape product roadmaps that align with data, customer insights, and business goals.</p>\n<p>The right candidate will have 6+ years of applied qualitative and quantitative research experience in a professional setting; will be passionate about research and travel, comfortable in a fast moving organisation and excited to collaborate with a diverse set of skilled cross-functional partners.</p>\n<p>If you’re passionate about UX research and like seeing your efforts translated into real world impact, we want you on our team.</p>\n<h2><strong>Specific responsibilities include:</strong></h2>\n<ul>\n<li>Scoping and leading UX research, from large-scale generative research studies that inform product strategy to rapid, tactical studies that de-risk development.</li>\n<li>Leveraging your creativity and expertise in qualitative and quantitative research to select the most suitable methodology to answer the teams’ highest priority questions.</li>\n<li>Synthesising a variety of data inputs (UXR, analytics and VoC) so as to be able to help product teams define and understand the real problem we’re trying to solve/learn through research.</li>\n<li>Balancing efficiency and rigour across multiple projects while keeping research aligned with product timelines.</li>\n<li>Crafting and delivering clear, succinct and actionable insight deliverables for stakeholders at all levels. You will communicate, advocate for and socialise insights in a compelling way. Recommendations will be insight-led and aligned to business goals.</li>\n<li>Partnering cross-functionally with product, design, analytics, VoC and eng. both when delivering research and on broader pod roadmap items and initiatives.</li>\n<li>Collaborating with stakeholders to shape product roadmaps that align with data, customer insights, and business goals.</li>\n<li>Contributing to how we develop our research practice, including growing the capabilities of the research team, expanding our toolkit and creating best practice research processes.</li>\n</ul>\n<h2><strong>Hiring requirements:</strong></h2>\n<ul>\n<li>Minimum BA/BSc degree in psychology, HCI, design, communication, statistics or other related field.</li>\n<li>6+ years of professional applied research experience.</li>\n<li>Extensive experience with qualitative research methods (Multi-device generative and evaluative depth interviews, unmoderated testing, usability testing, card sorting, tree-testing, focus groups, diary studies, contextual inquiry, concept testing etc.).</li>\n<li>Experience with quantitative research methods (e.g. surveying) and statistical analysis.</li>\n<li>Experience leveraging research tools like UserTesting, dscout, etc. and adaptability to learn and utilise new tools as needed.</li>\n<li>Detail-oriented and able to manage multiple projects simultaneously.</li>\n<li>Ability to ask, and answer, meaningful and impactful questions.</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Excellent stakeholder management skills.</li>\n<li>A flexible, confident and tenacious attitude with strong influencing skills.</li>\n</ul>\n<h2><strong>Perks of Working at Viator:</strong></h2>\n<ul>\n<li>Competitive compensation packages (routinely benchmarked against the latest industry data), including base salary, annual bonus, and equity.</li>\n<li>“Work your way” with flexibility to suit your lifestyle. Viator takes a remote-friendly approach to collaboration across a worldwide team, with the option to join on-site as often as you’d like.</li>\n<li>Flexible schedule. Work-life balance is ingrained in our culture by design. Trust and accountability make it work.</li>\n<li>Donation matching. Give back? Give more! We match qualifying charitable donations annually.</li>\n<li>Tuition assistance. Want to level up your career? We love to hear it! Receive annual support for qualified programs.</li>\n<li>Lifestyle benefit. An annual benefit to spend on yourself. Use it on travel, wellness, or whatever suits you.</li>\n<li>Travel perks. We believe that travel is employee development, so we provide discounts and more.</li>\n<li>Employee assistance program. We’re here for you with resources and programs to help you through life’s challenges.</li>\n<li>Health benefits. We offer great coverage and competitive premiums.</li>\n</ul>\n<h2><strong>Our Values:</strong></h2>\n<ul>\n<li>We aspire to lead. Tap into your talent, ambition, and knowledge to bring us – and you – to new heights.</li>\n<li>We’re relentlessly curious. We push beyond the usual, the known, the “that’s just how it’s done.”</li>\n<li>We’re better together. We learn from, accept, respect, support, and value one another– and are creating something remarkable in the process.</li>\n<li>We serve our customers, always. We listen, question, respond, and strive for wow moments.</li>\n<li>We strive for better, not perfect. We won’t get it right the first time – or every time. We’ll provide a safe environment in which to make mistakes, iterate, improve, and grow.</li>\n<li>Our workplace is for everyone, as is our people powered platform. At Tripadvisor, we want you to bring your unique identities, abilities, and experiences, so we can collectively revolutionize travel and together find the good out there.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/109977-senior-ux-researcher-bokun",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:24:23",
        "salary": "",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210129125206-036216.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Strategic Account Executive (Germany)",
        "company": "GitLab",
        "location": "Germany",
        "description": "GitLab is an open core software company that develops the most comprehensive AI-powered DevSecOps Platform, used by more than 100,000 organizations. Our mission is to enable everyone to contribute to and co-create the software that powers our world. When everyone can contribute, consumers become contributors, significantly accelerating the rate of human progress. This mission is integral to our&amp;#8230;",
        "html_description": "<p>GitLab is an open core software company that develops the most comprehensive AI-powered DevSecOps Platform, used by more than 100,000 organizations. Our mission is to enable everyone to contribute to and co-create the software that powers our world. When everyone can contribute, consumers become contributors, significantly accelerating the rate of human progress. This mission is integral to our culture, influencing how we hire, build products, and lead our industry. We make this possible at GitLab by running our operations on our product and staying aligned with our values.</p>\n<p>The Strategic Account Executive role extends the Associate Strategic Account Executive role outlined above. A Strategic Account Executive reports to an Area Sales Manager or Regional Director.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Supports GitLab’s strategic large prospects and customers.</li>\n<li>Provide account leadership and direction in the pre- and post-sales process</li>\n<li>Conduct sales activities including prospecting and developing opportunities in large/strategic accounts</li>\n<li>Ensure the successful rollout and adoption of GitLab products through strong account management activities and coordination with pre-and-post sales and support resources</li>\n<li>Be the voice of the customer by contributing product ideas to our public issue tracker</li>\n<li>Generate qualified leads and develop new customers in conjunction with our strategic channel partners .</li>\n<li>Expand knowledge of industry as well as the competitive posture of the company</li>\n<li>Prepare activity and forecast reports</li>\n<li>Contribute to root cause analysis on wins/losses.</li>\n<li>Communicate lessons learned to the team, including account managers, the marketing team, and the technical team</li>\n<li>Assist sales management in conveying customer needs to product managers, and technical support staff</li>\n<li>Utilize a consultative approach, discuss business issues with prospect and develop a formal quote, a written sales proposal or a formal sales presentation addressing their business needs.</li>\n<li>Develop an account plan to sell to customers based on their business needs.</li>\n<li>Collaborate with Marketing on marketing strategies.</li>\n</ul>\n<h2>Requirements:</h2>\n<ul>\n<li>A true desire to see customers benefit from the investment they make with you</li>\n<li>Able to provide high degree of account management and control</li>\n<li>Work under minimal supervision on complex projects</li>\n<li>Experience selling into large organizations</li>\n<li>Ability to leverage established relationships and proven sales techniques for success</li>\n<li>Excellent negotiation, presentation and closing skills</li>\n<li>Preferred experience with Git, Software Development Tools, Application Lifecycle Management</li>\n<li>You share our values, and work in accordance with those values.</li>\n<li>Ability to use GitLab</li>\n<li>Ability to travel if needed and comply with the company’s travel policy</li>\n</ul>\n<h2>Hiring Process:</h2>\n<ul>\n<li>\n<h4>1. Initial Screen &#8211; Recruiter</h4>\n<ul>\n<li>Candidates are invited to schedule an interview with the Recruiter.</li>\n<li>Areas of focus (as defined in GitLab Handbook):\n<ul>\n<li>Results</li>\n<li>Collaboration</li>\n</ul>\n</li>\n</ul>\n<h4>2. Initial Interview &#8211; Hiring Manager</h4>\n<ul>\n<li>Candidates are invited to schedule an interview with the Hiring Manager.</li>\n<li>Areas of focus (as defined in GitLab Handbook):\n<ul>\n<li>Results</li>\n<li>Operational Excellence &#8211; Account Planning &amp; Management</li>\n<li>Customer Focus &#8211; Effective Communication</li>\n<li>Operational Excellence &#8211; Growth Mindset</li>\n<li>Operational Excellence &#8211; Process Discipline</li>\n<li>Iteration</li>\n</ul>\n</li>\n</ul>\n<h4>3. Mock Presentation &#8211; Panel</h4>\n<ul>\n<li>Candidates are invited to schedule a presentation with 3 interviewers from the team.</li>\n<li>Areas of focus (as defined in GitLab Handbook):\n<ul>\n<li>Solutions Focus &#8211; Consultative approach</li>\n<li>Solutions Focus &#8211; DevOps &amp; Technical Leadership</li>\n<li>Solutions Focus &#8211; Building Trust</li>\n<li>Customer Focus &#8211; Facilitating</li>\n<li>Customer Focus &#8211; Understanding Customer’s Needs</li>\n<li>Efficiency</li>\n</ul>\n</li>\n</ul>\n<h4>4. Final Interview &#8211; Senior Leadership</h4>\n<ul>\n<li>Candidates are invited to schedule an interview with senior leadership.</li>\n<li>Areas of focus (as defined in GitLab Handbook):\n<ul>\n<li>Operational Excellence &#8211; Resource Orchestration</li>\n<li>Collaboration</li>\n<li>Operational Excellence &#8211; Growth Mindset</li>\n<li>Customer Focus &#8211; Customer Business Acumen</li>\n<li>Solutions Focus &#8211; Leading with Vision</li>\n<li>Transparency</li>\n<li>Diversity inclusion and belonging</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p><strong>Country Hiring Guidelines: </strong>GitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.</p>",
        "url": "https://jobicy.com/jobs/106897-account-executive-mid-market-dach",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:21:23",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success, Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201207055737-109952.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. Technical Success Engineer",
        "company": "Splunk",
        "location": "USA",
        "description": "The Senior Technical Success Engineer plays a vital role at Splunk and is responsible for ensuring the technical health of our customers. This position requires extensive knowledge of Splunk products to provide guidance on best practices for Splunk Cloud and Enterprise deployments. The Senior Technical Success Engineer also assists customers in their adoption journey by&amp;#8230;",
        "html_description": "<p>The Senior Technical Success Engineer plays a vital role at Splunk and is responsible for ensuring the technical health of our customers. This position requires extensive knowledge of Splunk products to provide guidance on best practices for Splunk Cloud and Enterprise deployments. The Senior Technical Success Engineer also assists customers in their adoption journey by offering product support, advisory services, and handling critical issues. By fulfilling these responsibilities, this role helps customers improve the value of their Splunk investment while ensuring that their platform is operating efficiently.</p>\n<h2>What you&#8217;ll get to do:</h2>\n<ul>\n<li>Act as a point of contact for technical health issues and partner concern management for enterprise customers.</li>\n<li>Provide mentorship, planning, and recommendations for a customer’s overall technical health.</li>\n<li>Supervise the overall health of customer environments, which include cases, urgent issues, outages, ongoing projects, possible bugs, and performance of diagnostic health checks as needed.</li>\n<li>Advocate internally for customers to facilitate the resolution of issues through coordination of Splunk’s internal organizations (technical support, services, sales, product development/management, and executive leadership)</li>\n<li>Work with relevant teams to proactively handle customers&#8217; critical issues, recommend environment upgrades or add-ons, upgrade readiness, new feature awareness, and maintenance windows.</li>\n<li>Be able to detail, communicate, and understand customer needs, so they can be clearly relayed to fellow account team members and Splunk Leadership.</li>\n<li>Keep the customer advised of key information that may be essential to their success (e.g. product roadmaps, new product releases, special customer events, or organizational changes)</li>\n<li>Proactively analyze customer issues, interactions, and product usage to recommend education and additional services needed then engage with internal teams for delivery.</li>\n<li>Assess cloud overages and leverage appropriate services for workload optimization.</li>\n<li>Participate in QBRs with customers (onsite and virtually) to review service levels, usage metrics and customer environment performance.</li>\n<li>Deliver customer onboarding mentorship, enablement planning, administration, and management workshops.</li>\n</ul>\n<h2>Must-have Qualifications:</h2>\n<ul>\n<li>5+ years’ experience in technical support, professional services, systems administration/engineering or related experience</li>\n<li>5+ years experience building customer relationships and handling enterprise accounts.</li>\n<li>Experienced with customer issues, account/project management, IT Operations, and technical infrastructure.</li>\n<li>Familiarity with all Splunk-related products</li>\n<li>Strong verbal and written communication skills with the ability to communicate technical concepts to non-technical audiences ranging from individual contributors to senior leaders.</li>\n<li>Work independently and as part of a team</li>\n<li>Travel up to 30% may be required.</li>\n<li>Splunk Architect Certification achieved within 6 months of start</li>\n<li>Proficient in English</li>\n</ul>\n<h2>Nice-to-have Qualifications:</h2>\n<p>We’ve taken special care to separate the must-have qualifications from the nice-to-haves. “Nice-to-have” means just that: Nice. To. Have. So, don’t worry if you can’t check off every box. We’re not hiring a list of bullet points–we’re interested in the whole you.</p>\n<ul>\n<li>BA/BS technical degree</li>\n<li>Knowledge of software development process and technical environments</li>\n<li>Solid understanding of Splunk Core Platform</li>\n<li>Other industry certifications from AWS, Google, and Azure</li>\n</ul>\n<p><b>Splunk is an Equal Opportunity Employer</b></p>\n<p>At Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing. We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.</p>\n<h2><b>Base Pay Range:</b></h2>\n<p>SF Bay Area, Seattle Metro, and New York City Metro Area<br />\nBase Pay Range: $132,000.00 &#8211; 181,500.00 per year</p>\n<p>California (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and Massachusetts<br />\nBase Pay Range: $118,800.00 &#8211; 163,350.00 per year</p>\n<p>All other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.<br />\nBase Pay Range: $105,600.00 &#8211; 145,200.00 per year</p>\n<p>Splunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate. <b>In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards.</b></p>",
        "url": "https://jobicy.com/jobs/114266-senior-technical-success-engineer-us-central-or-east-coast",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:20:23",
        "salary": "USD 105,600 - 181,500",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/2f9304fe9b427489507405bef9a0bb9f.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Customer Success Manager, Greater China",
        "company": "Deel",
        "location": "APAC",
        "description": "We offer global teams all the tools they need to hire, onboard, manage, pay, and scale at full speed. We aim to foster a diverse global economy by building a generational platform that seamlessly connects companies with talent worldwide. After our successful Series D in 2021, we raised another $50M in 2023, doubling our valuation&amp;#8230;",
        "html_description": "<p>We offer global teams all the tools they need to hire, onboard, manage, pay, and scale at full speed. We aim to foster a diverse global economy by building a generational platform that seamlessly connects companies with talent worldwide.</p>\n<p>After our successful Series D in 2021, we raised another $50M in 2023, doubling our valuation to $12B. There’s never been a more exciting time to join Deel — the international payroll and compliance market leader.</p>\n<h2><strong>Duties</strong></h2>\n<ul>\n<li>Develop a vision and strategy for clients by assessing their strategy as a business to assist them in using Deel’s tools to achieve their goals</li>\n<li>Build deep and trusting long-term relationships with clients by identifying partner pain points, providing solutions, and recognizing opportunities for growth and revenue generation</li>\n<li>Creating data driven recommendations by accessing, analyzing, and synthesizing large data sets</li>\n<li>Problem solving and solution implementation across Deel internally on behalf of your clients</li>\n<li>Working with the product and operations teams to drive high impact improvements</li>\n</ul>\n<h2><strong>Requirements</strong></h2>\n<p><strong>You have minimum of 2+ years of relevant work experience, including client facing experience</strong></p>\n<ul>\n<li>Have excellent written and verbal communication in English AND Mandarin Chinese</li>\n<li>Have previous experience in at least one of the following: fast growth startup, top-tier management consulting, investment banking, or private equity</li>\n<li>Solid Payroll experience</li>\n<li>Relationship builder who remains calm and collected when facing crisis or criticism and celebrates partners’ successes with them</li>\n<li>Quantitatively-inclined and data savvy; you may not be a SQL expert, but you enjoy drawing quick, insightful conclusions from complex data sets, asking critical questions, and synthesizing raw numbers into simple, actionable recommendations</li>\n<li>A reliable, motivated self-starter with a passionate growth mentality. You enjoy fast-paced environments, aren’t deterred by setbacks or pivots, and thrive in roles requiring a very high degree of responsibility</li>\n<li>Have a solid track record of achievement &#8211; e.g. had success in a top tier company, delivered quantifiable business impact, quickly assumed responsibilities or won competitive awards</li>\n<li>Have a strong analytical foundation with ability to manipulate and synthesize data</li>\n<li>Are curious by nature and interested in making an impact</li>\n</ul>\n<h2><strong>Bonus Points:</strong></h2>\n<ul>\n<li>You&#8217;re passionate about the future of work</li>\n<li>You have experience building consumer/business facing products where you have to think about customer experience and growth</li>\n<li>You have worked in multiple countries, cultures, and places</li>\n<li>You like getting bonus points </li>\n</ul>\n<h2><strong>Total Rewards</strong></h2>\n<p>Our workforce deserves fair and competitive pay that meets them where they are. With scalable benefits, rewards, and perks, our total rewards programs reflect our commitment to inclusivity and access for all.</p>\n<h2><strong>Some things you’ll enjoy</strong></h2>\n<ul>\n<li>Provided computer equipment tailored to your role</li>\n<li>Stock grant opportunities dependent on your role, employment status and location</li>\n<li>Additional perks and benefits based on your employment status and country</li>\n<li>The flexibility of remote work, including WeWork access where available</li>\n</ul>\n<p><strong>DISCLOSURE </strong></p>\n<p>We use Covey as part of our hiring and/or promotional processes. As part of the evaluation process, we provide Covey with job requirements and candidate-submitted applications.Certain features of the platform may qualify it as an Automated Employment Decision Tool (AEDT) under applicable regulations. For positions in New York City, our use of Covey complies with NYC Local Law 144.</p>\n<p>At Deel, we’re an equal-opportunity employer that values diversity and positively encourage applications from suitably qualified and eligible candidates regardless of  race, religion, sex, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, pregnancy or maternity or other applicable legally protected characteristics.</p>\n<p><em>Deel is an equal-opportunity employer and is committed to cultivating a diverse and inclusive workplace that reflects different abilities, backgrounds, beliefs, experiences, identities and perspectives.</em></p>\n<p>Deel will provide accommodation on request throughout the recruitment, selection and assessment process for applicants with disabilities. If you require accommodation, please inform our Talent Acquisition Team at recruiting[at]deel.com of the nature of the accommodation that you may require, to ensure your equal participation</p>",
        "url": "https://jobicy.com/jobs/116600-customer-success-manager-greater-china",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:19:12",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/282df8b52b60f8a324714ffa21cb4ed5.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Senior Technical Support Engineer",
        "company": "DocuSign",
        "location": "Japan",
        "description": "The Sr. Technical Support Engineer is a strategic customer advisor and the internal voice for our customer base within a highly technical area of Docusign’s Intelligent Agreement Management platform (IAM). The Sr. Technical Support Engineer will both have the accountability and responsibility to deliver on our customers’ needs. This role is the technical domain expert&amp;#8230;",
        "html_description": "<p>The Sr. Technical Support Engineer is a strategic customer advisor and the internal voice for our customer base within a highly technical area of Docusign’s Intelligent Agreement Management platform (IAM). The Sr. Technical Support Engineer will both have the accountability and responsibility to deliver on our customers’ needs. This role is the technical domain expert between customers and all functions within DocuSign to resolve technical support inquiries. Working with resources across Docusign, this role expedites the resolution of complex technical issues to empower customers to achieve the highest value and adoption of our software.</p>\n<p>This position is an individual contributor role reporting to Technical Support Manager.</p>\n<h2><strong>Responsibility</strong></h2>\n<ul>\n<li>Provide outstanding technical support for the Docusign Agreement Cloud (DAC) and associated services</li>\n<li>Handle escalated cases of incoming support channels to troubleshoot issues customers face when using DocuSign products, including but not limited to API integrations, embedded systems issues, network and security-related impediments, 3rd party integrations, and multi-product workflows, in accordance with team-specific scope</li>\n<li>Own customer issues to engineering interface to resolve technical bugs and influence development roadmap</li>\n<li>Use broad technical product expertise within DAC areas to help customers increase adoption</li>\n<li>Use support tools and resources vital to get the job done, including Salesforce, Jira, Docusign proprietary logging systems, SharePoint, browser developer tools, internal admin console, SQL, and text analysis tooling</li>\n<li>Identify improvements to the product, identify bugs and otherwise determine high-impact opportunities to improve the customer experience</li>\n<li>Promote Docusign products and services to customers and prospective customers via consultative discussion and evaluation of their service and support needs</li>\n<li>Partner with non-delivery teams to identify needs and develop product training</li>\n<li>Collaborate and communicate with cross-functional teams including Product, Engineering, and Account Management to ensure alignment on plans</li>\n<li>Meet and exceed DocuSign Customer Support service level goals for areas of DAC expertise</li>\n<li>Serve as an escalation point for eSign Technical Support Team Engineers and Non-eSign aligned TCSMs as needed</li>\n<li>Act as an On-Call escalation contact in a rotation during evening and weekend hours</li>\n</ul>\n<h2>Job Designation</h2>\n<p><strong>Remote: </strong>Employee is not required to be in or near an office frequentlyand works from a designated remote work location for the majority of thetime.</p>\n<p>Positions at Docusign are assigned a job designation of either In Office, Hybrid or Remote and are specific to the role/job. Preferred job designations are not guaranteed when changing positions within Docusign. Docusign reserves the right to change a position&#8217;s job designation depending on business needs and as permitted by local law.</p>\n<h2>What you bring</h2>\n<p><strong>Basic</strong></p>\n<ul>\n<li>Bachelor of Science degree in a Computer Science, Engineering, or related technical discipline</li>\n<li>5 + years of SaaS network troubleshooting experience in a Technical Support and/or Network Operations Center (NOC) capacity</li>\n<li>Prociency with modern markup and programming languages such as XML, C#, Python, PHP, JavaScript / jQuery, or similar</li>\n<li>Experience troubleshooting in a web-based environment including HTTP, JSON, IIS, HTML, and CSS</li>\n<li>Knowledge of web services, SDK’s, REST and SOAP API’s</li>\n<li>Log analysis experience using network tools such as Wireshark, Fiddler, Charles Proxy, browser developer tools or similar</li>\n<li>Windows PowerShell scripting work experience</li>\n<li>Docusign organization administration work experience</li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li>Subject Matter Expert for multiple disciplines across Docusign technologies</li>\n<li>Mentorship experience with ability to coach to every level of technical experience</li>\n<li>Familiarity with Docusign Contract Lifecycle Management workflows and architecture</li>\n<li>Experience with troubleshooting embedded signing and sending</li>\n<li>1+ years’ experience as a Support Expert specializing in Docusign technologies</li>\n<li>Familiarity with Cloud Services</li>\n<li>Master of Science degree in a Computer Science, Engineering, or related technical discipline</li>\n<li>Expertise with reporting using Salesforce, Excel, and PowerPoint to an executive audience</li>\n<li>Mastery troubleshooting regular expressions, debugging code and/or complex data validation rules</li>\n<li>Domain expertise with web-based applications, web service APIs, monitoring tools (e.g. Dynatrace), and authentication technologies such as SAML and oAuth</li>\n<li>Expertise analyzing and troubleshooting Docusign internal logging tools</li>\n<li>Excellent independent work and problem-solving attitude in a constantly changing and frequently ambiguous environment</li>\n<li>Multi-lingual in Docusign supported languages</li>\n<li>Fluent in Japanese and English (Japanese Fluency at JLPT N1 Level)</li>\n<li>Professional experience within relevant industries for which Docusign provides solutions</li>\n<li>Self-motivated, goal-oriented, excellent organizational skills and superior time management skills</li>\n<li>Effective communication skills which are a key component of this role, with audiences that include customers, peers, and occasional executive presence<br />\nAbility to maintain composure in critical situations and communicate clearly with both internal and external customers</li>\n<li>Strong technical writing skills</li>\n</ul>\n<h2>Life at Docusign</h2>\n<p>Docusign is committed to building trust and making the world more agreeable for our employees, customers and the communities in which we live and work. You can count on us to listen, be honest, and try our best to do what’s right, every day. At Docusign, everything is equal.</p>\n<p>We each have a responsibility to ensure every team member has an equal opportunity to succeed, to be heard, to exchange ideas openly, to build lasting relationships, and to do the work of their life. Best of all, you will be able to feel deep pride in the work you do, because your contribution helps us make the world better than we found it. And for that, you’ll be loved by us, our customers, and the world in which we live.</p>",
        "url": "https://jobicy.com/jobs/115214-senior-technical-support-engineer-3",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:16:36",
        "salary": "",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/983c701912e42bba3cdb33a6c5893414.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. / Staff Site Reliability Engineer",
        "company": "Scroll.io",
        "location": "Anywhere",
        "description": "We are looking for a Senior or Staff Site Reliability Engineer to lead the design, implementation, and management of our infrastructure and development operations to ensure the best reliability, security, and scalability. You will work closely with our development team to build and maintain automated deployment pipelines, monitor and analyze system performance, and identify and&amp;#8230;",
        "html_description": "<p>We are looking for a Senior or Staff Site Reliability Engineer to lead the design, implementation, and management of our infrastructure and development operations to ensure the best reliability, security, and scalability. You will work closely with our development team to build and maintain automated deployment pipelines, monitor and analyze system performance, and identify and resolve issues before they impact our users. You are expected to become SRE team lead after 3 month probation period.</p>\n<p>This is a dynamic role in a fast-paced blockchain environment, ideal for someone embracing ownership and autonomy to grow with us.</p>\n<h2><strong>Responsibilities:</strong></h2>\n<ul>\n<li><strong>Platform Engineering &amp; Developer Enablement</strong>\n<ul>\n<li>Design, build, and maintain internal developer tools to improve developer lifecycle, including building, testing, and deploying.</li>\n<li>Create tools that streamline developer workflows, including monitoring, logging, and debugging utilities.</li>\n</ul>\n</li>\n<li><strong>Infrastructure &amp; System Architecture</strong>\n<ul>\n<li>Design, provision, and maintain cloud environments focused on scalability, reliability, and security.</li>\n<li>Automate deployment and maintenance processes ensuring seamless integration and rapid iteration.</li>\n</ul>\n</li>\n<li><strong>Reliability, Monitoring &amp; Security</strong>\n<ul>\n<li>Implement observability solutions to gain actionable insights, enhance performance, and ensure high availability of blockchain services.</li>\n<li>Work closely with the security team to harden infrastructure and mitigate potential threats.</li>\n<li>Operate and maintain a fleet of hundreds of GPU-based zk provers. Track prover health, detect failures, and optimize performance in real time.</li>\n</ul>\n</li>\n</ul>\n<h2><strong>Requirements:</strong></h2>\n<ul>\n<li>5+ years of experience as a DevOps, Infrastructure, Site Reliability or Cloud Engineer</li>\n<li>3+ years of experience as Backend Developer</li>\n<li>Familiarity with hybrid cloud environments (AWS, Azure, GCP, etc.) and the ability to design, provision, and maintain them securely and efficiently.</li>\n<li>Good at any modern programming language (Go, Rust, Python). You need to be a good programmer for custom tooling.</li>\n<li>Linux administration experience, from hardware optimizations to advanced OS-level configurations.</li>\n<li>Experience working with configuration management tools like Terraform and Ansible</li>\n<li>Experience working with containers and using them in production systems</li>\n<li>Self-motivated individual with enthusiasm for learning and building things</li>\n<li>Collaborative, communicative, and confident in their abilities to work well with all team members at all seniority and skill levels</li>\n</ul>\n<h2><strong>Preferred Qualifications:</strong></h2>\n<ul>\n<li>Understand system architecture and business</li>\n<li>Previous experience as a platform engineer</li>\n<li>Previous experience as a tech lead</li>\n<li>Previous experience with Kubernetes, microservices, and GitOps tooling</li>\n<li>Previous experience in a blockchain company</li>\n<li>Previous experience in optimizing blockchain specific infrastructure</li>\n</ul>\n<h2><strong>What We Offer:</strong></h2>\n<ul>\n<li>Mission-Driven, Collaborative, and Innovative Environment: Join a team united by a shared vision, working with like-minded individuals and cutting-edge technology to advance Ethereum and blockchain innovation.</li>\n<li>Comprehensive Compensation and Remote Flexibility: Benefit from a competitive salary package and generous discretionary benefits, while enjoying the remote work from anywhere with flexible hours. Additionally, receive support for your workspace with a home office setup allowance and monthly co-working membership stipend.</li>\n<li>Remote Hiring: Team members outside the US, UK, Canada, and Hong Kong will be engaged as independent contractors, with the flexibility to receive payment in fiat, USDC, or other agreed-upon options.</li>\n<li>Private Healthcare Benefits: Private healthcare benefits through the Employer of Record (EoR) are only available in the US, UK, Canada, and Hong Kong.</li>\n</ul>\n<p><em>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#8217;ll do our best to accommodate.</em></p>",
        "url": "https://jobicy.com/jobs/115914-senior-staff-site-reliability-engineer",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:14:24",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/105078d294d30c978ca2badf7f376934.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    },
    {
        "title": "Sr. Account Executive",
        "company": "Innovaccer",
        "location": "USA",
        "description": "We are searching for a driven, relationship-oriented Senior Enterprise Account Executive to establish strong relationships with executives and leaders at prospective health systems, healthcare services firms, digital health, and payer organizations. They should have experience performing knowledge based sales of complex solutions within a complex industry. Further, they should be equally comfortable managing the full&amp;#8230;",
        "html_description": "<p>We are searching for a driven, relationship-oriented Senior Enterprise Account Executive to establish strong relationships with executives and leaders at prospective health systems, healthcare services firms, digital health, and payer organizations. They should have experience performing knowledge based sales of complex solutions within a complex industry. Further, they should be equally comfortable managing the full sales cycle, from identifying net new opportunities through contract close.</p>\n<p>Our ideal candidate should excel at artfully identifying and advancing high value sales, with a steadfast dedication to serving our customers by aligning our solutions with their goals and needs (not the other way around). They will be primarily accountable for new business growth.</p>\n<p>As we grow and expand our offerings and customer base, it will be imperative the Senior Account Executive builds strong relationships internally across our Marketing, PDE (Product, Design, &amp; Engineering), and Customer Delivery and Success teams, who they will work closely with to refine and deliver Cured by Innovaccer’s solutions. Familiarity with the use of a CRM and use of a data-driven approach to efficiently document and communicate is expected. Additionally, they should excel at verbal and written presentation creation and delivery &#8211; both in in-person and remote settings.</p>\n<h2><strong>A Day in the Life:</strong></h2>\n<ul>\n<li>You have the desire to be an integral part of a rapidly growing healthcare technology company and want to contribute to developing and delivering market-leading solutions</li>\n<li>You stand out as a thoughtful, responsive communicator to all levels of the organization, internally and externally.</li>\n<li>You are adept at dealing with a changing environment, being a team player, and moving quickly to help align internal resources when and as needed.</li>\n<li>You are committed to building a healthy and supportive work environment for yourself and your colleagues.</li>\n<li>You excel at prioritizing execution and deal conversion to help Cured establish critical customer mass and business development velocity</li>\n<li>You value and demonstrate humility in the way you think, act, and lead customer sales</li>\n</ul>\n<h2><strong> </strong><strong>What You Need:</strong></h2>\n<ul>\n<li>8+ years of B2B SaaS sales and/or business development experience</li>\n<li>6+ years of experience directly leading and managing enterprise sales from initial conversation through close.</li>\n<li>Experience selling healthcare technology to provider organizations strongly preferred.</li>\n<li>Passion to improve the ability for healthcare organizations to meaningfully connect individuals and their families with the right care.</li>\n<li>Excellent track record of consistently exceeding expectations, goals, and quotas.</li>\n<li>Strong interpersonal, analytical, and quantitative problem-solving skills.</li>\n<li>Ability to work collaboratively in a team environment.</li>\n<li>Ability to leverage GSuite and common business applications.</li>\n<li>Ability to communicate complex ideas effectively, both verbally and in writing, to C-Suite buyers</li>\n<li>Willingness to travel.</li>\n</ul>\n<p>We offer competitive benefits to set you up for success in and outside of work.</p>\n<h2><strong>Here’s What We Offer:</strong></h2>\n<ul>\n<li><strong>Generous PTO Benefits: </strong>Enjoy PTO benefit accrual of 22 days per year.</li>\n<li><strong>Parental Leave:</strong> Experience one of the industry&#8217;s best parental leave policies to spend time with your new addition.</li>\n<li><strong>Rewards &amp; Recognition:</strong> Unlock your potential and be rewarded generously with both monetary incentives and widespread recognition for your dedication and outstanding performance. Unlock your potential and be rewarded generously with both monetary incentives and widespread recognition for your dedication and outstanding performance.</li>\n<li><strong>Insurance Benefits:</strong> We offer medical, dental, and vision benefits along with 100% company-sponsored short and long-term disability and basic life insurance. Legal aid and pet insurance options are available at a discounted rate.</li>\n</ul>\n<p>Innovaccer is an equal-opportunity employer. We celebrate diversity, and we are committed to fostering an inclusive and diverse workplace where all employees, regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, marital status, or veteran status, feel valued and empowered.</p>\n<p><strong>Disclaimer:</strong> Innovaccer does not charge fees or require payment from individuals or agencies for securing employment with us. We do not guarantee job spots or engage in any financial transactions related to employment. If you encounter any posts or requests asking for payment or personal information, we strongly advise you to report them immediately to our HR department at px[at]innovaccer.com. Additionally, please exercise caution and verify the authenticity of any requests before disclosing personal and confidential information, including bank account details.</p>",
        "url": "https://jobicy.com/jobs/115916-senior-account-executive-8",
        "source": "Jobicy",
        "posted_at": "2025-03-30 03:13:53",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/0b9459ca04b9978e8eda6928e9973248.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-02"
    }
]