[
    {
        "title": "Sales Recruiter (Fixed Term)",
        "company": "Figma",
        "location": "USA",
        "description": "We are looking to hire an experienced full-life cycle Sales Recruiter to support the organization through its growth. You&amp;#8217;ll be a driving force in building and executing the talent strategy, partnering with key stakeholders, and hiring top talent. This role will allow you to build positive relationships, exude our values, and contribute to our org-wide&amp;#8230;",
        "html_description": "<p>We are looking to hire an experienced full-life cycle Sales Recruiter to support the organization through its growth. You&#8217;ll be a driving force in building and executing the talent strategy, partnering with key stakeholders, and hiring top talent. This role will allow you to build positive relationships, exude our values, and contribute to our org-wide recruiting best practices and processes.</p>\n<p><strong>This is a temporary role available for a fixed term of 12 months, based in the United States. </strong></p>\n<h2>What you’ll do at Figma:</h2>\n<ul>\n<li>Manage full-cycle recruiting processes for our business organizations</li>\n<li>Partner with leaders to develop top of funnel strategies for key roles</li>\n<li>Source and build healthy, representative pipelines to engage passive talent including: cold outreach, events, and content production while also effectively handling inbound applications and referrals</li>\n<li>Leverage data to inform your hiring strategy and articulate these insights to executives in order to influence and drive positive change</li>\n<li>Identify, conceptualize and drive business improvement initiatives</li>\n<li>Champion and spearhead various initiatives relating to belonging, equity and impact (BEI)</li>\n</ul>\n<h2>We&#8217;d love to hear from you if you have:</h2>\n<ul>\n<li>4+ years of full-cycle in house recruiting experience in a high growth business</li>\n<li>Experience partnering with stakeholders on niche searches across business organizations</li>\n<li>Expert knowledge of the SaaS/ scaling tech landscape and who our competitors in this space may be</li>\n<li>Advanced sourcing and passive engagement skills</li>\n<li>Ability to build a talent strategy alongside your hiring managers, while delivering an exceptional candidate experience</li>\n<li>Excellent communication, in all formats and ability to adapt communication style based upon audience</li>\n</ul>\n<h2>While not required, it’s an added plus if you also have:</h2>\n<ul>\n<li>In-house experience recruiting for a SaaS company</li>\n</ul>\n<p>At Figma, one of our values is Grow as you go. We believe in hiring smart, curious people who are excited to learn and develop their skills. If you’re excited about this role but your past experience doesn’t align perfectly with the points outlined in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.</p>\n<h2><strong>Pay Transparency Disclosure</strong></h2>\n<p>If based in Figma’s San Francisco or New York hub offices, this role has the annual base salary range stated below.</p>\n<p>Job level and actual compensation will be decided based on factors including, but not limited to, individual qualifications objectively assessed during the interview process (including skills and prior relevant experience, potential impact, and scope of role), market demands, and specific work location. The listed range is a guideline, and the range for this role may be modified. For roles that are available to be filled remotely, the pay range is localized according to employee work location by a factor of between 80% and 100% of range. Please discuss your specific work location with your recruiter for more information.</p>\n<p>Annual Base Salary Range (SF/NY Hub): $136,000<!-- --> &#8211; <!-- -->$210,000<!-- --> <!-- -->USD</p>\n<p>At Figma we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our product and our community to flourish. Figma is an equal opportunity workplace &#8211; we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity/expression, veteran status<strong>, </strong>or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.</p>\n<p>We will work to ensure individuals with disabilities are provided reasonable accommodation to apply for a role, participate in the interview process, perform essential job functions, and receive other benefits and privileges of employment. If you require accommodation, please reach out to accommodations-ext(at)figma.com. These modifications enable an individual with a disability to have an equal opportunity not only to get a job, but successfully perform their job tasks to the same extent as people without disabilities.</p>\n<p>Examples of accommodations include but are not limited to:</p>\n<ul>\n<li>Holding interviews in an accessible location</li>\n<li>Enabling closed captioning on video conferencing</li>\n<li>Ensuring all written communication be compatible with screen readers</li>\n<li>Changing the mode or format of interviews</li>\n</ul>",
        "url": "https://jobicy.com/jobs/116686-sales-recruiter-fixed-term",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:54:43",
        "salary": "USD 136,000 - 210,000",
        "job_type": "contract",
        "category": "HR &amp; Recruiting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201016160957-035844.png",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Social Media Manager",
        "company": "Designit",
        "location": "USA",
        "description": "We are looking for a Social Media Manager to join our enterprise tech client&amp;#8217;s team. This role is a blend of strategy and execution and focuses on engaging, building, and proactively managing a positive social media community across organic and paid experiences. You’re someone who understands the trends of the moment, and you have a strong&amp;#8230;",
        "html_description": "<p>We are looking for a <strong>Social Media Manager </strong>to join our enterprise tech client&#8217;s team. This role is a blend of strategy and execution and focuses on engaging, building, and proactively managing a positive social media community across organic and paid experiences. You’re someone who understands the trends of the moment, and you have a strong point of view on how we should show up and build community.</p>\n<h2><strong>Would you like to:</strong></h2>\n<ul>\n<li>Create and drive campaign strategies to increase social engagement and sentiment with a global audience of business decision makers and creators.</li>\n<li>Demonstrate exceptional collaboration and communication skills as you partner with Product Marketing, Brand, Integrated Marketing and other functions.</li>\n<li>Manage the cadence of digital communications across multiple social media channels with a focused approach using data and insights to inform your efforts.</li>\n<li>Develop a social media calendar across social media and blog.</li>\n<li>Engage and respond on social media, partnering internally to develop content as needed with Customer Support and Product teams.</li>\n<li>Partner with the paid media team to execute campaigns as needed and in a timely fashion; working with the design team to develop creative, traffic assets, and measure results</li>\n<li>Manage several agency partners to develop bespoke creative aligned to brands, draft briefs for paid media campaigns, and provide on-going feedback.</li>\n<li>Stay up to date on latest social trends and tools and implement them for social campaigns delivery.</li>\n<li>Analyze, track, and measure performance against KPI’s and report on monthly social campaigns.</li>\n</ul>\n<h2><strong>We would like you to have:</strong></h2>\n<ul>\n<li>A minimum of 5-7+ years experience in an enterprise social media environment.</li>\n<li>A track record of successful social media campaigns.</li>\n<li>Excellence in producing engaging and creative social media content, planning, strategy and collaboration.</li>\n<li>Expert knowledge of best practices and cultural trends for Instagram, TikTok, YouTube, Facebook, X (Twitter), etc.</li>\n<li>Experience using Sprinklr.</li>\n<li>Strong knowledge of social media analytics and reporting to demonstrate results.</li>\n<li>The ability to bring together multiple groups of stakeholders and focus on shared outcomes using data and insights to help broker any challenges.</li>\n</ul>\n<p><strong>Compensation Range: </strong>$45 &#8211; $55/hr.</p>\n<p>This compensation range is indicative of the role. Compensation offered is on the basis of evaluation during interview process, the candidates range and depth of experience, business and market financials and internal pay parity.</p>\n<h2><strong>Would you like to work for an organization that:</strong></h2>\n<ul>\n<li>Embraces work-life balance – our employees’ well-being remains a top priority for us</li>\n<li>Promotes a culture of learning and advocacy across the globe &#8211; diversity will enable us to strengthen our impact</li>\n<li>Offers a comprehensive benefits package effective Day 1. Options include health, vision, &amp; dental insurance, FSAs, discounts on pet insurance, PTO, paid holidays, and more</li>\n<li>Encourages innovation and experimentation</li>\n<li>Emphasizes and rewards collaboration</li>\n<li>Works remotely. We continue to safeguard the health of our employees so our interviewing and on-boarding process will remain virtual until further notice</li>\n</ul>\n<p><em>Designit is committed to ensuring that all candidates have an equal opportunity to be considered for employment. Please let us know if you need any reasonable accommodation to participate in the job application or interview process.</em></p>",
        "url": "https://jobicy.com/jobs/105724-senior-social-media-manager",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:51:26",
        "salary": "",
        "job_type": "full-time",
        "category": "Social Media Marketing",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/0802726040e35f2f86749890d2cbb6ba.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Senior JavaScript Engineer",
        "company": "10up",
        "location": "Anywhere",
        "description": "At 10up, we call developers like you engineers because you aren’t just a “coder”: you’re an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges. As a Senior JavaScript Developer at 10up, you are an integral part in building custom-crafted UIs utilized by millions of people daily. 10uppers have been&amp;#8230;",
        "html_description": "<p>At 10up, we call developers like you <em>engineers</em> because you aren’t just a “coder”: you’re an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges. As a Senior JavaScript Developer at 10up, you are an integral part in building custom-crafted UIs utilized by millions of people daily. 10uppers have been pushing the boundaries of WordPress for over 12 years—become an engineer that innovates the internet by building state-of-the-art web fronts alongside a top-in-the-field team.</p>\n<p>You’ll work on a combination of unique builds and ongoing support engagements that help season your skills. As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.</p>\n<p>As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</p>\n<h2>What you will do</h2>\n<ul>\n<li>Lead, architect, and build React projects with modern JavaScript.</li>\n<li>Estimate JavaScript work and modularize goals into clearly defined, executable tasks.</li>\n<li>Coach and mentor teammates to boost the team&#8217;s JavaScript and engineering abilities.</li>\n<li>Skillfully connect engineering deliverables to client business objectives.</li>\n<li>Ultimately you will make the web better by finely crafting apps, and tools that reach millions of online visitors every day.</li>\n</ul>\n<h2>About you</h2>\n<ul>\n<li>You love building scalable web-based JavaScript applications with ES6+, React, and Node.</li>\n<li>You are well-versed with the architectural concepts behind React &#8211; state and data management, JSX, creating a componentized system, and JavaScript tooling.</li>\n<li>You are knowledgeable of WordPress as a platform, including custom post types, taxonomies, and use of WordPress beyond typical “blog” use cases.</li>\n<li>You have a code portfolio of real-world samples. Link us to your best custom work on GitHub and you’ll never have to do any live coding or whiteboard testing!</li>\n<li>You prefer to work fully remote and are effectively engaging in a distributed team from the location of your choosing.</li>\n</ul>\n<h2>Benefits of interest</h2>\n<ul>\n<li>Multiple paid time off programs, including accrued PTO, parental leave, bereavement leave, and company holidays – including an all-company break from Christmas Eve to New Years Day.</li>\n<li>Health, dental, and life insurance programs (available for United States team members).</li>\n<li>Retirement contribution programs (currently available in the U.S. and U.K.).</li>\n<li>Flexible and alternate schedule programs &#8211; including options for 4-day work week (Monday-Thursday) configurations.</li>\n<li>$3,000 USD accrued annually in professional development budget for you to spend on conferences, training, or to buy back time for programs like independent study.</li>\n<li>Global Company summits – opportunities to meet, socialize and learn with fellow 10uppers in person at remarkable destinations.</li>\n<li>An end-of-year all-hands bonus program, along with smaller opportunities for recognition throughout the year.</li>\n<li>A Director of Engineering that supports your career growth and development.</li>\n</ul>\n<p>The expected annual salary range for this position is between <strong>$70,000 and $130,000 USD</strong>. Compensation is determined based on a variety of factors including relevant experience, other job related qualifications/skills, geographic location, and business needs.</p>\n<h2><strong>Join our team</strong></h2>\n<p>If you are passionate about 10up&#8217;s mission and think you have what it takes to be successful in this role even if you don&#8217;t check all the boxes, please apply. We&#8217;d appreciate the opportunity to personally review your application. Everyone gets a response.</p>",
        "url": "https://jobicy.com/jobs/102153-senior-javascript-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:48:53",
        "salary": "USD 70,000 - 130,000",
        "job_type": "full-time",
        "category": "Programming",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210129124926-822280.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Software Developer - AI Team",
        "company": "Celtra",
        "location": "Europe",
        "description": "We are seeking a Software Developer who will work on developing and enhancing our AI agent, designed to optimize creative processes and simplify the use of the Celtra platform for our clients. With some prior knowledge of agent building, this role will involve fine-tuning existing models, introducing and integrating new and existing Celtra functionalities, and improving the overall AI&amp;#8230;",
        "html_description": "<p>We are seeking a <strong>Software</strong> <strong>Developer</strong> who will work on developing and enhancing our <strong>AI agent</strong>, designed to optimize creative processes and simplify the use of the Celtra platform for our clients. With some prior knowledge of agent building, this role will involve fine-tuning existing models, introducing and integrating new and existing Celtra functionalities, and improving the overall AI technology that powers our platform. Your contributions will help automate workflows and improve the efficiency of creative production for some of the world&#8217;s largest brands.</p>\n<h2><strong>What kind of tech stack do we use?</strong></h2>\n<p>We use various tools to craft our products. On the backend, you can find Scala, NodeJS, PHP, MySQL, Apache Spark, Snowflake, and also Go, MongoDB, Kinesis. On the frontend, we use Vue.js and Vanilla JS when needed. Everything runs on the AWS/ECS cloud. We also love CI/CD, IaC and do daily deployments to ensure your contributions see the light of day as soon as the tests are green and the QA team is happy.</p>\n<h2><strong>Your responsibilities:</strong></h2>\n<ul>\n<li>AI Agent Development: Build and enhance the AI agent that helps clients optimize creative workflows, automate tasks, and streamline the use of Celtra’s platform.</li>\n<li>Feature Integration: Add new functionalities from existing Celtra tools and actions to the AI agent, enabling users to automate even more tasks and customize their workflows.</li>\n<li>AI Optimization: Continuously optimize AI tools to ensure the best performance, speed, and scalability for clients running global campaigns.</li>\n<li>Collaborate with Cross-Functional Teams: Work closely with data scientists, engineers, and product managers to integrate generative AI capabilities into our products and services.</li>\n<li>Research and Innovation: Stay up-to-date with the latest advancements in generative AI and machine learning. Evaluate new technologies and methodologies to continuously improve our models and solutions.</li>\n<li>Code Quality and Documentation: Write clean, maintainable, and well-documented code. Participate in code reviews and contribute to best practices in software development.</li>\n</ul>\n<h2><strong>You will thrive in this position if you have:</strong></h2>\n<ul>\n<li>A passion for exploring new AI technologies and finding solutions to enhance automation and user experience.</li>\n<li>Analytical and problem-solving skills with a track record of tackling complex technical challenges.</li>\n<li>Proactive, a good communicator and a team player.</li>\n<li>Dedicated to continuous learning and growing.</li>\n<li>Strong written and spoken English.</li>\n</ul>\n<h2><strong>What brings extra points?</strong></h2>\n<ul>\n<li>Demonstrated experience of end-to-end integration of agentic frameworks like LangChain, Llamaindex or Transformers Agents in a production environment.</li>\n<li>Experience with advanced functionalities of Foundation model services, such as OpenAI, AWS Titan or Anthropic Claude.</li>\n<li>Experience harnessing vector databases, such as Pinecone, Chroma and Snowflake for retrieval augmented generation.</li>\n</ul>\n<h2><strong>What we offer?</strong></h2>\n<ul>\n<li>Remote working. You can choose to work from home or join us in our Ljubljana office.</li>\n<li>Flexible schedule. You’re trusted to create the right conditions for your best productivity.</li>\n<li>Continuous education. Up to 1000 EUR per year for conferences, books, and courses of your choice.</li>\n<li>Equipment of your choice.</li>\n<li>Knowledge shares.</li>\n<li>Additional pension and health insurance.</li>\n<li>WFH budget. An additional budget of 500 EUR to set up your home space.</li>\n<li>Employee well-being. Dedicated budget for any kind of wellness activities such as fitness, yoga, etc.</li>\n</ul>\n<h2><strong>About Celtra:</strong></h2>\n<p>Celtra helps enterprise advertisers, media, and agencies design, approve, and deliver digital creative across the ever-growing number of campaigns, markets, designs, and variants. Celtra’s Creative Automation &amp; Enablement Software for helps brands move faster than ever while dramatically scaling content production. Companies like adidas, TripAdvisor, Spotify, Unilever, NBCU, Lululemon, YETI, Vice, and hundreds more partner with Celtra to cut production costs while increasing efficiencies and output in the cloud.</p>\n<h2><strong>Empowering Creativity through Diversity &amp; Inclusion:</strong></h2>\n<p>Our mission is to empower creativity &#8211; and we cannot fulfill our mission without different perspectives. Diversity drives innovation, and Celtra is committed to diversity, equity, inclusion, and belonging.</p>\n<p>Every employee is empowered at Celtra &#8211; no matter your race, age, religion, gender identity, sexual orientation, physical or mental ability, or ethnicity.  We hire the best, and develop our teams through continuous education and mentorship, in a community where everyone can bring their whole selves to work.</p>",
        "url": "https://jobicy.com/jobs/112942-software-developer-f-m-d",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:47:36",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/4d4dcabf23834ba5f3571494d0e4c80d.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Content Writer, AI Researcher",
        "company": "Blavity",
        "location": "Anywhere",
        "description": "Blavity Inc. seeks a tech-savvy Content Writer (AI Researcher) to join our editorial team in an impactful role harnessing the power of AI to enhance and expedite writing. The Content Writer (AI Researcher) will focus on integrating the latest Artificial Intelligence tools into our research, drafting, and publishing processes to reduce production time frames while&amp;#8230;",
        "html_description": "<p>Blavity Inc. seeks a tech-savvy Content Writer (AI Researcher) to join our editorial team in an impactful role harnessing the power of AI to enhance and expedite writing. The Content Writer (AI Researcher) will focus on integrating the latest Artificial Intelligence tools into our research, drafting, and publishing processes to reduce production time frames while expanding creative boundaries.</p>\n<p>This position is a (1099) contractor. This role will report directly to the SEO Editor and the Associate Director of SEO.</p>\n<p>Contractors will be responsible for providing their own equipment, including but not limited to laptop computers, cell phones, or any other electronic equipment required to perform their role.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Employ AI assistants for rapid information discovery and context-building on assigned topics</li>\n<li>Leverage AI drafting capabilities for foundational content structure and voice</li>\n<li>Validate AI-generated outputs for factual reliability, ethical standards, and brand alignment</li>\n<li>Ensure that content is structured and well optimized for performance and adheres to SEO best practices</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Education: Bachelor&#8217;s Degree</li>\n<li>Required Experience:\n<ul>\n<li>1+ years experience using WordPress (or other Content Management Systems) to author, publish, and edit content</li>\n<li>Knowledge of the latest AP Style guidelines and best practices for writing online</li>\n<li>Basic understanding of core SEO concepts</li>\n<li>Exemplary writing and content creation skills as demonstrated by an online portfolio</li>\n<li>Command balancing automation efficiencies with human creativity and oversight</li>\n<li>Diligence vetting usage against misinformation and plagiarism risks</li>\n</ul>\n</li>\n<li>Preferred Experience:\n<ul>\n<li>2+ years of writing</li>\n<li>Prior experience updating content or working with a digital publisher</li>\n</ul>\n</li>\n<li>Technologies: Fluent in Google Suite, Asana and WordPress CMS or comparable Content Management System</li>\n<li>Additional Qualifications:\n<ul>\n<li>Excellent organization and time management skills, with the ability to manage multiple projects simultaneously</li>\n<li>Ability to work both independently and collaboratively with a positive, can-do approach</li>\n<li>Comfort performing research to ensure our information is accurate and highly useful to readers</li>\n<li>Entrepreneurial self-starter who is comfortable taking on a high level of responsibility</li>\n<li>Motivated to work hard in a fast-paced environment</li>\n<li>Excellent communication and analytical skills; willing to wear multiple hats</li>\n<li>A healthy appreciation of GIFs and Black culture</li>\n</ul>\n</li>\n</ul>\n<h2>Details</h2>\n<ul>\n<li>This is a fully remote role, occasional travel may be required.</li>\n<li>Candidates must be available to work at least 80% in alignment with the Eastern Time Zone.</li>\n<li>The hourly rate for this role is $15 &#8211; $16.</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115973-content-writer-ai-researcher-2",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:46:41",
        "salary": "",
        "job_type": "contract",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c4139b3e6879448bfada1ac3306695ba.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Content Editor",
        "company": "Blavity",
        "location": "USA",
        "description": "Blavity Inc. is seeking a highly motivated and experienced Content Editor to join our team. This Content Editor position is a (W2) Contractor role, pivotal in ensuring the quality and effectiveness of our content across multiple brands. The ideal candidate will have strong leadership skills, an eye for detail, and a passion for guiding SEO&amp;#8230;",
        "html_description": "<p>Blavity Inc. is seeking a highly motivated and experienced Content Editor to join our team. This Content Editor position is a (W2) Contractor role, pivotal in ensuring the quality and effectiveness of our content across multiple brands. The ideal candidate will have strong leadership skills, an eye for detail, and a passion for guiding SEO writers to produce their best work across multiple brands. This role requires close collaboration with writers and the Associate Director of SEO to execute our SEO strategy effectively.</p>\n<p>This role will report directly to the Associate Director of SEO.</p>\n<p>Contractors will be responsible for providing their own equipment, including but not limited to laptop computers, cell phones, or any other electronic equipment required to perform their role.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Edit and publish 8-10 articles and 5-10 web stories daily</li>\n<li>Write 2-3 articles per week</li>\n<li>Support the pitch process as needed</li>\n<li>Manage and mentor a team of writers, providing constructive feedback to help them improve their skills and produce high-quality content</li>\n<li>Plan ahead proactively to ensure content aligns with special events and holidays</li>\n<li>Ensure all content meets our high standards for accuracy, readability, and engagement</li>\n<li>Work closely with the Associate Director of SEO to ensure content aligns with our SEO strategy</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Education: N/A</li>\n<li>Required Experience:\n<ul>\n<li>Proven experience as an Editor or similar role, preferably in digital publishing</li>\n<li>Strong understanding of SEO principles and how to apply them to content</li>\n<li>Exceptional writing and editing skills with a keen eye for detail</li>\n</ul>\n</li>\n<li>Preferred Experience:\n<ul>\n<li>Experience as a people manager</li>\n</ul>\n</li>\n<li>Technologies: Fluent in Microsoft Office, Google Suite, Asana, and WordPress CMS</li>\n<li>Additional Qualifications:\n<ul>\n<li>Excellent leadership and people management skills</li>\n<li>Ability to provide constructive feedback and foster a positive, collaborative team environment</li>\n<li>Strong organizational skills and the ability to manage multiple projects simultaneously</li>\n<li>Independent, entrepreneurial self-starter who is comfortable taking on a high level of responsibility</li>\n<li>Motivated to work hard in a fast-paced environment</li>\n<li>Excellent communication and analytical skills</li>\n<li>A healthy appreciation of GIFs and Black culture</li>\n</ul>\n</li>\n</ul>\n<h2>Details</h2>\n<ul>\n<li>This is a fully remote, U.S.- based role. Occasional travel may be required.</li>\n<li>Candidates must be authorized to work in the U.S.</li>\n<li>Candidates must be available to work in alignment with the Eastern Time Zone.</li>\n<li>The hourly rate for this role is $25/hour, 25 &#8211; 29 hours per week.</li>\n</ul>\n<p>Blavity is committed to creating a diverse environment free of discrimination and harassment, and building a team that represents a variety of backgrounds, perspectives, and skills.</p>\n<p>Blavity is proud to be an equal opportunity employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, HIV Status, veteran status, or any other status protected by the laws or regulations in the locations where we operate.</p>",
        "url": "https://jobicy.com/jobs/114362-content-editor",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:46:29",
        "salary": "",
        "job_type": "contract",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c4139b3e6879448bfada1ac3306695ba.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Brand Designer",
        "company": "UpKeep",
        "location": "LATAM",
        "description": "UpKeep is the leading cloud-based Asset Operations Management software developed to revolutionize the way teams manage facilities and maintenance work. We provide mobile-first SaaS solutions, Industrial IoT sensors, data analytics tools, advanced enterprise integrations, and top-notch professional services. Our innovative technology is modernizing workflows and maximizing operational efficiency for over 3,000 customers including Shell, Yamaha, Unilever, McDonalds, Subway,&amp;#8230;",
        "html_description": "<p>UpKeep is the leading cloud-based Asset Operations Management software developed to revolutionize the way teams manage facilities and maintenance work. We provide <strong>mobile-first SaaS solutions</strong>, Industrial IoT sensors, data analytics tools, advanced enterprise integrations, and top-notch professional services. Our innovative technology is modernizing workflows and maximizing operational efficiency for over 3,000 customers including Shell, Yamaha, Unilever, McDonalds, Subway, Pepsi, and Marriott!</p>\n<p>We&#8217;re a <strong>Series B tech startup</strong> with 100+ team members across the US. We&#8217;ve been recognized as a<strong> &#8220;Best Place to Work&#8221;</strong> multiple years in a row by fostering an inclusive and mission-driven culture. In addition to stock options and great benefits, our people have the flexibility to <strong>work remote</strong>. UpKeep is ranked the #1 Facility Management software on Gartner, #1 Maintenance Management software on G2 Crowd, FrontRunners on Software Advice, and CMMS Leader on IDC MarketScape.</p>\n<h2><strong>POSITION SUMMARY:</strong></h2>\n<p>The Senior Brand Designer will lead the development and execution of branding and design initiatives, ensuring a cohesive and compelling brand identity across all touchpoints. You will collaborate with cross-functional teams and play a critical role in shaping and managing UpKeep’s visual identity.</p>\n<p><strong>LatAm based candidates.</strong></p>\n<h2><strong>ESSENTIAL FUNCTIONS AND RESPONSIBILITIES:</strong></h2>\n<ul>\n<li>Brand Strategy &amp; Identity Design:\n<ul>\n<li>Develop and refine visual brand guidelines, ensuring consistency across all platforms and mediums.</li>\n<li>Design illustrations, images, color palettes, and other brand assets that align with the company&#8217;s guidelines.</li>\n<li>Translate brand strategy into innovative and engaging visual concepts.</li>\n</ul>\n</li>\n<li>Creative Direction:\n<ul>\n<li>Lead and oversee creative projects, from concept to execution, ensuring high-quality design standards.</li>\n<li>Collaborate with marketing, product, and content teams to create collateral, presentations, and web assets that enhance brand awareness and engagement.</li>\n<li>Present ideas, concepts, and designs to stakeholders, incorporating feedback effectively.</li>\n</ul>\n</li>\n<li>Cross-Functional Collaboration:\n<ul>\n<li>Partner with product design teams to ensure branding is seamlessly integrated into digital products and systems.</li>\n<li>Work closely with all teams to develop brand-aligned materials, including advertising, social media, and promotional campaigns</li>\n</ul>\n</li>\n</ul>\n<h2><strong>EXPERIENCE:</strong></h2>\n<ul>\n<li>5+ years of experience in brand design, with at least 2 years in a senior or leadership role.</li>\n<li>Proven track record of developing and implementing successful branding initiatives.</li>\n</ul>\n<h2><strong>KNOWLEDGE:</strong></h2>\n<ul>\n<li>Expert proficiency in design tools such as Adobe Creative Suite (Illustrator, Photoshop, InDesign), Figma, or equivalent software.</li>\n<li>Strong understanding of typography, color theory, and layout principles.</li>\n<li>Excellent communication and presentation skills.</li>\n<li>Ability to manage multiple projects and prioritize deadlines in a fast-paced environment.</li>\n</ul>\n<h2><strong>DESIRED BEHAVIORS:</strong></h2>\n<ul>\n<li>Strategic thinker with a passion for storytelling and brand building.</li>\n<li>Detail-oriented with a strong commitment to design excellence.</li>\n<li>Collaborative mindset and ability to inspire and lead teams.</li>\n</ul>\n<p>This role will receive a competitive annual rate. A variety of factors are considered when determining someone’s compensation–including a candidate’s professional background, experience, and location.</p>\n<p><strong>Company History &amp; Product:</strong></p>\n<p>UpKeep was founded in 2014 by our CEO, Ryan Chan, based on an idea he had while using outdated desktop software as a Process Engineer in a manufacturing plant. He believed a mobile-first solution could significantly improve the productivity of the technicians he was working with. He was determined to build on this vision— so he quit his job, learned to write code, and created the first version of UpKeep from his family&#8217;s garage!</p>\n<p>Today, our cloud-based Software-as-a-Service (SaaS) and cutting edge Industrial IoT sensors solve problems for thousands of businesses around the world. Our <strong>Asset Operations Management </strong>solutions, coupled with powerful cloud ecosystems, empower maintenance and facilities teams to achieve their digital transformation goals. We are providing meaningful value to an underserved, blue-collar workforce by streamlining workflows, improving collaboration, and making it easy to manage work orders and projects from anywhere, anytime!</p>\n<p>At UpKeep, we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our products, and our community to flourish. UpKeep is honored to be an equal opportunity workplace. We are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national orientation, age, citizenship, marital status, disability, gender identity, sexual orientation or Veteran status.</p>",
        "url": "https://jobicy.com/jobs/115994-brand-designer-4",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:45:16",
        "salary": "",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200923070746-132751.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Sales Leader",
        "company": "Webflow",
        "location": "UK",
        "description": "We’re looking for our first Sales Leader in Europe to help us build and scale a high-performing sales team of talented Sales Managers and Account Executives. Webflow is growing fast, and our expansion into Europe will play a pivotal role in guiding and accelerating this trajectory – building a world-class and diverse team, amping up&amp;#8230;",
        "html_description": "<p>We’re looking for our first Sales Leader in Europe to help us build and scale a high-performing sales team of talented Sales Managers and Account Executives. Webflow is growing fast, and our expansion into Europe will play a pivotal role in guiding and accelerating this trajectory – building a world-class and diverse team, amping up the pipeline generation machine, becoming a thought leader in the web design and development space working closely with product and marketing, and closing revenue for Webflow.</p>\n<h2><strong>About the role </strong></h2>\n<ul>\n<li>Location: Remote-first (UK)</li>\n<li>Full-time</li>\n<li>Permanent</li>\n</ul>\n<p>Our cash compensation amount for this role ranges depending on the cost of labor of the geographic area. The ranges shared below may change if you are hired in another geographic location.</p>\n<ul>\n<li>United Kingdom  (figures cited below are in GBP and pertain to workers in the UK)\n<ul>\n<li>£176,300 &#8211; £295,000</li>\n</ul>\n</li>\n</ul>\n<p>For sales roles, the ranges provided are the role’s On Target Earnings (“OTE”) ranges, meaning that the ranges include both the sales commissions target and annual base salary for the role. This salary range may be inclusive of several career levels at Webflow and will be narrowed during the interview process based on a number of factors, including the candidate’s market location, job related experience, knowledge, qualifications, and skills. Benefits/additional compensation for this role may include: equity, company bonus or sales commissions/bonuses; pension scheme; health benefits; and wellness stipends.</p>\n<ul>\n<li>Reporting to the Vice President, Sales (USA)</li>\n</ul>\n<h2>As Sales Leader, Europe you will…</h2>\n<ul>\n<li><strong>Bring Webflow Sales to Europe:</strong> lead the charge in launching Webflow on the ground in Europe, building on momentum currently run by the North America-based team. Implement strategies to convert existing pipeline and create the foundation for future growth.</li>\n<li><strong>Build and lead a world-class, diverse team:</strong> recruit, interview, hire, coach, and mentor the sales organization in the UK.</li>\n<li><strong>Partner development: </strong>build on the strong network of services partners and resellers to accelerate Webflow’s growth across the region.</li>\n<li><strong>Own your results:</strong> attain quota, forecast accurately, and drive linearity in sales performance. Align to the North America operating rhythm of weekly forecasts, monthly business reviews, quarterly kickoffs, and tracking results.</li>\n<li><strong>Grow your business:</strong> position the team to grow successfully beyond the immediate targets, creating the engine for increased revenue year on year.Guide the team to qualify deals across Webflow’s lead sources (inbound, self serve signup and upgrade, outbound, partners, expansions), command the sales process, and drive operational rigor.</li>\n<li><strong>Be customer obsessed:</strong> guide the team to embody our core behavior of “Obsess over the Customer Experience” and deliver a strong sales experience and post-sales collaboration to bring business results to fruition.</li>\n<li><strong>Collaborate cross-functionally:</strong> work closely across the Sales, Marketing, and Product departments to implement and carry out a sales go-to-market plan and strategy.</li>\n</ul>\n<h2><strong>About you </strong></h2>\n<p>You’ll thrive as Sales Leader, Europe if you bring:</p>\n<ul>\n<li>Experience: 10+ years of Sales experience, 6+ years of Sales Leadership experience, and ideally Second-Line experience building in Europe</li>\n<li>Sales Motions: experience with both Product-Led Sales (PLS) and Enterprise Sales to effectively blend these approaches, optimizing Webflow’s market reach and customer engagement</li>\n<li>Analytical Skills: a solid quantitative foundation to track performance metrics and drive decisions with data</li>\n<li>Partnership Skills: experience accelerating the partnerships motion in collaboration with partner team leadership</li>\n<li>Communication Skills: experience driving clarity and strong communications during immense change and evolution</li>\n<li>Collaboration: work well cross-functionally with teams across product, engineering, and marketing – and game to be a voice for the Europe team and Webflow given what you see in the market</li>\n<li>Language Skills: multi-lingual abilities are a plus</li>\n</ul>\n<p>Even if you don’t meet 100% of the above qualifications, you should still seriously consider applying. Research shows that you may still be considered for a role if you meet just half of the requirements.</p>\n<h2><strong>Our Core Behaviors:</strong><strong><br />\n</strong></h2>\n<ul>\n<li><strong>Obsess over customer experience.</strong> We deeply understand <em>what</em> we’re building and <em>who</em> we’re building for and serving. We define the leading edge of what’s possible in our industry and deliver the future for our customers</li>\n<li><strong>Move with heartfelt urgency.</strong> We have a healthy relationship with impatience, channeling it thoughtfully to show up better and faster for our customers and for each other. Time is the most limited thing we have, and we make the most of every moment</li>\n<li><strong>Say the hard thing with care.</strong> Our best work often comes from intelligent debate, critique, and even difficult conversations. We speak our minds and don’t sugarcoat things — and we do so with respect, maturity, and care</li>\n<li><strong>Make your mark.</strong> We seek out new and unique ways to create meaningful impact, and we champion the same from our colleagues. We work as a <em>team</em> to get the job done, and we go out of our way to celebrate and reward those going above and beyond for our customers and our teammates</li>\n</ul>\n<h2><strong>Benefits &amp; wellness</strong></h2>\n<ul>\n<li>Equity ownership (RSUs) in a growing, privately-owned company</li>\n<li>Employer-paid healthcare, vision, and dental insurance coverage for employees and dependents (full-time employees working 30+ hours per week), accidental &amp; income protection</li>\n<li>12 weeks of paid parental leave for both birthing and non-birthing caregivers, as well as an additional 6-8 weeks of pregnancy disability for birthing parents to be used before child bonding leave (where local requirements are more generous employees receive the greater benefit); Employees also have access to family planning care and reimbursement</li>\n<li>All team members are encouraged to take a minimum of 15 flex vacation days off in a calendar year, or their country-specific statutory minimum if this is more favorable.</li>\n<li>Access to mental wellness and professional coaching, &amp; therapy</li>\n<li>Monthly stipends to support health and wellness, smart work, and professional growth</li>\n<li>Internal learning &amp; development programs</li>\n<li>Pension schemes (in countries where statutorily required) &amp; financial wellness benefits</li>\n</ul>\n<p><em>Temporary employees may be eligible for paid holiday and time off, statutory leaves of absence, and company-sponsored medical benefits depending on their Fixed Term Contract and their country/state of employment.</em></p>\n<h2><strong>Remote, together</strong></h2>\n<p>At Webflow, equality is a core tenet of our culture. We are an Equal Opportunity (EEO)/Veterans/Disabled Employer and are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law. Pursuant to the San Francisco Fair Chance Ordinance, Webflow will consider for employment qualified applicants with arrest and conviction records.</p>\n<h2><strong>Please note:</strong></h2>\n<p><em>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Upon interview scheduling, instructions for confidential accommodation requests will be administered.</em></p>\n<p><em>To join Webflow, you&#8217;ll need a valid right to work authorization depending on the country of employment.</em></p>\n<p><em>If you are extended an offer, that offer may be contingent upon your successful completion of a background check, which will be conducted in accordance with applicable laws. We may obtain one or more background screening reports about you, solely for employment purposes.</em></p>",
        "url": "https://jobicy.com/jobs/116685-sales-leader-europe",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:37:14",
        "salary": "GBP 176,300 - 295,000",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b75fa7e9-221.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Consultant, Design Technologist",
        "company": "Life360",
        "location": "USA",
        "description": "Life360 is a Remote First company, which means a remote work environment will be the primary experience for all employees. All positions, unless otherwise specified, can be performed remotely (within the US) regardless of any specified location above. Life360 is embarking on significant website redesign work that will involve combining our two brands (Life360 and&amp;#8230;",
        "html_description": "<p>Life360 is a Remote First company, which means a remote work environment will be the primary experience for all employees. All positions, unless otherwise specified, can be performed remotely (within the US) regardless of any specified location above.</p>\n<p>Life360 is embarking on significant website redesign work that will involve combining our two brands (Life360 and Tile) into a single website (Life360.com) that will be the destination for all of our offerings. We are looking for a Consultant &#8211; Design Technologist to play an active role in the design development and front-end execution of this new web experience.</p>\n<p>As a Design Technologist on this project, you will work closely with our internal team of designers, developers, and stakeholders to make this project a success. <strong>This is a 3-month contractor position, with the possibility of extension.</strong></p>\n<h2><strong>What You’ll Do</strong></h2>\n<ul>\n<li>Be a core contributor to a redesign that will involve combining the life360.com and tile.com websites into a single, unified web experience</li>\n<li>Collaborate with our designers, developers, and stakeholders throughout the design, development, and launch process</li>\n<li>Bridge the gap between Figma designs and production-ready web pages, actively contributing to both</li>\n<li>Develop responsive layouts that scale across desktop, tablet, and mobile</li>\n<li>Prototype flows, concepts, and interactions</li>\n<li>Write front-end code that is clean and functionally sound</li>\n<li>Be flexible and willing to jump in wherever needed throughout the design and development process to ensure the project is successfully executed</li>\n</ul>\n<h2><strong>What We&#8217;re Looking For</strong></h2>\n<ul>\n<li>What excites you most is making web experiences that really come to life through delightful animation, interactions, and flows</li>\n<li>Experience designing modern, responsive web experiences that include ecommerce / purchase flows</li>\n<li>A strong design portfolio of relevant work</li>\n<li>A deep understanding of systems thinking; you see how all the parts fit together and how small changes cascade throughout the system</li>\n<li>Strong knowledge of web best practices across both Design and Engineering</li>\n<li>You love collaborating and you are able to take ownership when needed</li>\n<li>You thrive in a highly iterative process that involves listening, adapting, moving fast, and incorporating feedback along the way</li>\n</ul>\n<p><strong>Mastery of HTML &amp; CSS and thorough knowledge of a JS framework, like React—as well as CSS frameworks like Tailwind, and libraries like Framer Motion</strong></p>\n<ul>\n<li>A passion for creating delightful details (such as micro-animations and interactions) and an understanding of how to implement them appropriately</li>\n<li>Proficiency in common design tools such as Figma</li>\n</ul>\n<h2>Life360 Values</h2>\n<p>Our company’s mission driven culture is guided by our shared values to create a trusted work environment where you can bring your authentic self to work and make a positive difference</p>\n<ul>\n<li>Be a Good Person &#8211; We have a team of high integrity people you can trust.</li>\n<li>Be Direct With Respect &#8211; We communicate directly, even when it’s hard.</li>\n<li>Members Before Metrics &#8211; We focus on building an exceptional experience for families.</li>\n<li>High Intensity High Impact &#8211; We do whatever it takes to get the job done.</li>\n</ul>\n<h2>Our Commitment to Diversity</h2>\n<p>We believe that different ideas, perspectives and backgrounds create a stronger and more creative work environment that delivers better results. Together, we continue to build an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. It fuels our innovation and connects us closer to our customers and the communities we serve. We strive to create a workplace that reflects the communities we serve and where everyone feels empowered to bring their authentic best selves to work.</p>\n<p><em>We are an equal opportunity employer and value diversity at Life360. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status or any legally protected status.  </em></p>\n<p><em>We encourage people of all backgrounds to apply. We believe that a diversity of perspectives and experiences create a foundation for the best ideas. Come join us in building something meaningful.</em> <em>Even if you don’t meet 100% of the below qualifications, you should still seriously consider applying!</em></p>",
        "url": "https://jobicy.com/jobs/116682-consultant-design-technologist",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:31:34",
        "salary": "",
        "job_type": "contract",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/f269bad3-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Infrastructure Engineer II",
        "company": "GitHub",
        "location": "UK",
        "description": "GitHub is hiring an Infrastructure Engineer II to join the Service Mesh team within our Developer Experience organisation. You will focus on the systems and tools that enable our engineers to operate and scale the world&amp;#8217;s largest code hosting platform. You will deploy, maintain, and enhance our Istio based service mesh with a focus on&amp;#8230;",
        "html_description": "<p>GitHub is hiring an Infrastructure Engineer II to join the Service Mesh team within our Developer Experience organisation. You will focus on the systems and tools that enable our engineers to operate and scale the world&#8217;s largest code hosting platform. You will deploy, maintain, and enhance our Istio based service mesh with a focus on making the Developer Experience the best it can be for our engineering and infrastructure teams.</p>\n<p>The Developer Experience team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You&#8217;re expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe.</p>\n<p>As an engineer at GitHub you&#8217;ll always be challenged to solve interesting and novel problems that have real impact on how the world builds software.</p>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Build and improve the frameworks and tools we use to test and configure our Istio based service mesh in our infrastructure.</li>\n<li>Ensure a reliable service mesh platform across bare-metal, virtual machines, and cloud environments.</li>\n<li>Develop and support our service mesh initiative across data center and cloud environments.</li>\n<li>Work closely with other engineering and infrastructure teams to design solutions and support workloads.</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<p><strong>Required Qualifications:</strong></p>\n<ul>\n<li>Minimum of 3 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field)\n<ul>\n<li>OR Bachelor&#8217;s Degree in Computer Science, Information Technology, or related field AND 1+ years technical experience in software engineering, network engineering, systems administration, or related field</li>\n<li>OR equivalent experience</li>\n</ul>\n</li>\n<li>Minimum of 3 years experience operating Kubernetes in a high scale, production environment</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Minimum of 1 years experience of  service mesh platforms, such as Istio or Linkerd</li>\n<li>Minimum 1 years  experience in one or more scripting languages (e.g., Bash, Python, or a similar language).</li>\n<li>Minimum of 1 years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language).</li>\n<li>Minimum of 2 years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts.</li>\n</ul>\n<h2><strong>GitHub values</strong></h2>\n<ul>\n<li>Customer-obsessed</li>\n<li>Ship to learn</li>\n<li>Growth mindset</li>\n<li>Own the outcome</li>\n<li>Better together</li>\n<li>Diverse and inclusive</li>\n</ul>\n<h2><strong>Manager fundamentals</strong></h2>\n<ul>\n<li>Model</li>\n<li>Coach</li>\n<li>Care</li>\n</ul>\n<h2><strong>Leadership principles</strong></h2>\n<ul>\n<li>Create clarity</li>\n<li>Generate energy</li>\n<li>Deliver success</li>\n</ul>\n<h2><strong>Who We Are</strong></h2>\n<p>GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub.</p>\n<p>Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms.<br />\nJoin us, and let’s change the world, together.</p>\n<h2><strong>Equal Employment Opportunity</strong></h2>\n<p>GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don&#8217;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there&#8217;s any way we can make the interview process better for you; we&#8217;re happy to accommodate!</p>",
        "url": "https://jobicy.com/jobs/116680-infrastructure-engineer-ii",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:28:58",
        "salary": "",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910204029-397949.png",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Content and Editorial Coordinator",
        "company": "Designit",
        "location": "LATAM,  Canada,  USA",
        "description": "We believe in teamwork, fun, complex projects, diverse perspectives, and simple solutions. How about you? We’re looking for a Blog Coordinator with the passion and experience to design what matters – one project at a time. This Designit team supports Microsoft Cloud Marketing Blog and Social, a world class social team that operates 100+ social&amp;#8230;",
        "html_description": "<p>We believe in teamwork, fun, complex projects, diverse perspectives, and simple solutions. How about you? We’re looking for a <strong>Blog Coordinator</strong> with the passion and experience to design what matters – one project at a time.</p>\n<p>This Designit team supports Microsoft Cloud Marketing Blog and Social, a world class social team that operates 100+ social media channels and 20+ marketing blogs designed for developers, IT decision makers, IT implementers, and business decision makers. Each month, we publish over 50 blog posts to help, inform, entertain, and engage customers across the globe. Azure, Power BI, Dynamics 365, and Microsoft 36 are just a few examples of the 170 innovative products and services that comprise the Cloud Marketing Blog and Social ecosystem.</p>\n<p>We are currently looking for a Blog Coordinator to support the Azure <u>AI </u>Blog workstream which executes the publication of Azure announcements, thought leadership, and product updates. In this role, you will primarily support key stakeholders by executing editorial blog reviews, staging, and scheduling, while providing project management support for the team. The ideal candidate has impeccable attention to detail, excellent collaboration and communication skills, and the desire to accomplish daily tasks in a timely manner with strong focus and follow-through.</p>\n<p><strong>This is a part time position (20 hours per week). East coast preferred location.</strong></p>\n<p><strong>*Contract position for 3 months</strong></p>\n<h2><strong>Would you like to&#8230;</strong></h2>\n<ul>\n<li>Review posts from key contributors and edit to ensure proper brand voice, grammar, format, styling, and alignment with established blogging best practices, and the Microsoft Writing Style Guide</li>\n<li>Stage, schedule, and monitor content for publishing in WordPress</li>\n<li>Partner closely with the Microsoft Product Marketing teams to track and manage their blog content, provide guidance on publishing schedule, and keep the editorial calendar updated in real-time</li>\n<li>Partner closely with the Cloud Marketing social team and programming team to ensure blog posts are amplified across appropriate social channels</li>\n<li>Partner closely with the Cloud Marketing YouTube team to closely align on the videos that will be embedded in blog posts</li>\n<li>Ensure quality of content from end to end and perform thorough quality checks on all blog content before it is published</li>\n</ul>\n<h2><strong>We would like you to have..</strong></h2>\n<ul>\n<li>2+ years of experience in digital marketing</li>\n<li>Copy-editing experience</li>\n<li>Technical writing or content experience</li>\n<li>Experience managing and maintaining editing blog content in WordPress using the Gutenberg editor, overseeing formatting, SEO optimization, and applying blogging best practices,</li>\n<li>Experiencing managing tasks and projects with limited oversight and guidance</li>\n<li>Flexibility with working hours preferred</li>\n<li>Customer service experience preferred</li>\n<li>Enterprise client contact experience preferred</li>\n<li>Familiarity with Microsoft SharePoint, PowerPoint, Excel, Teams, and Outlook</li>\n<li>Strong skills in multitasking, organization, and time management</li>\n</ul>\n<h2><strong>Would you like to join a global organization that&#8230;</strong></h2>\n<ul>\n<li>Embraces work-life balance – our employees’ well-being remains a top priority for us</li>\n<li>Promotes a culture of learning and advocacy across the globe &#8211; diversity will enable us to strengthen our impact</li>\n<li>Encourages innovation and experimentation</li>\n<li>Understands that changes will occur and adaptability is crucial to assist when it does</li>\n<li>Emphasizes and rewards collaboration</li>\n<li>Works remotely. We continue to safeguard the health of our employees so our interviewing and on-boarding process will remain virtual until further notice</li>\n</ul>\n<p><strong>Compensation Range: $34-$35 per hour</strong></p>\n<p>This compensation range is indicative of the role. Compensation offered is on the basis of evaluation during interview process, the candidates range and depth of experience, business and market financials and internal pay parity.</p>\n<p>Please note that all official communications regarding this job opportunity will be sent from email addresses ending with @designit.com. Be cautious of any correspondence originating from other email domains and refrain from sharing personal information in such cases.</p>\n<p><em>Designit is committed to ensuring that all candidates have an equal opportunity to be considered for employment. Please let us know if you need any reasonable accommodation to participate in the job application or interview process.</em></p>",
        "url": "https://jobicy.com/jobs/116678-content-and-editorial-coordinator",
        "source": "Jobicy",
        "posted_at": "2025-04-03 03:25:16",
        "salary": "",
        "job_type": "contract, part-time",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/0802726040e35f2f86749890d2cbb6ba.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Customer Experience Associate, Account Security",
        "company": "Discord",
        "location": "Netherlands",
        "description": "As a team member, you’ll be on the frontlines of supporting our communities, listening to their feedback, and sharing these insights with other stakeholders to help make the Discord experience the best it can be! If you’re looking for an amazing support team, join us! What You&amp;#8217;ll Be Doing Working the Morning Shift on Tuesday&amp;#8230;",
        "html_description": "<p>As a team member, you’ll be on the frontlines of supporting our communities, listening to their feedback, and sharing these insights with other stakeholders to help make the Discord experience the best it can be! If you’re looking for an amazing support team, join us!</p>\n<h2><strong>What You&#8217;ll Be Doing</strong></h2>\n<ul>\n<li>Working the Morning Shift on Tuesday to Saturday (9 AM to 6 PM CEST)\n<ul>\n<li>We work remotely but expect you to occasionally be present in our Amsterdam office to connect with the team.</li>\n<li>Candidates must be local.</li>\n</ul>\n</li>\n<li>Delivering timely, accurate, and thoughtful responses to our users’ questions and requests through our support channels.</li>\n<li>Investigating user account requests, providing timely, accurate, and educational responses to our users.</li>\n<li>Monitoring Discord user security trends, identify opportunities for improved operational efficiency, and provide actionable feedback to partners.</li>\n<li>Ensuring the security and integrity of user accounts by implementing and enforcing security protocols and best practices.</li>\n<li>Investigating and resolving suspicious or unauthorized account activities, including identifying potential security breaches.</li>\n<li>Collaborating with cross-functional teams to address user account issues and implement solutions that enhance user experience and security.</li>\n<li>Educating users on account security measures and promote awareness of potential risks and vulnerabilities.</li>\n<li>Maintaining accurate records of user interactions and resolutions, and contribute to developing support documentation and knowledge base resources.</li>\n</ul>\n<h2><strong>What you should have</strong></h2>\n<ul>\n<li>Proficiency in troubleshooting account-related issues.</li>\n<li>Excellent communication skills, both written and verbal, with the ability to explain technical concepts clearly to non-technical users.</li>\n<li>Only English is necessary, but any of the following languages are a plus: Brazilian Portuguese, Russian, French, German, and Turkish with both written and speaking fluency.</li>\n<li>Ability to work collaboratively in a fast-paced environment and prioritize tasks effectively.</li>\n<li>Technical skills with knowledge of desktop and mobile operating systems.</li>\n<li>Experience with customer service solutions platforms.</li>\n<li>A passion for building communities and belief in our mission at Discord.</li>\n<li>A commitment to diversity and inclusion.</li>\n<li>Experience with customer support or technical support roles is required, as well as a passion for supporting our users with unwavering patience and empathy.</li>\n</ul>\n<h2><strong>Why Discord? </strong></h2>\n<p>Discord plays a uniquely important role in the future of gaming. We&#8217;re a multiplatform, multigenerational and multiplayer platform that helps people deepen their friendships around games and shared interests. We believe games give us a way to have fun with our favorite people, whether listening to music together or grinding in competitive matches for diamond rank. <strong>Join us in our mission! Your future is just a click away!</strong></p>",
        "url": "https://jobicy.com/jobs/116669-customer-experience-associate-account-security",
        "source": "Jobicy",
        "posted_at": "2025-04-02 18:21:39",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/02/WRILS-210216185819-522054.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Sports Graphic Designer",
        "company": "Storyteller",
        "location": "Europe",
        "description": "Storyteller is a platform that allows brands to integrate Stories functionality into their apps and websites. The platform is in use by multiple global brands serving millions of users. We are looking for a Graphic Designer with a solid grasp of typography, typesetting, and design tools, primarily Figma and Adobe Photoshop. You&amp;#8217;ll be working with&amp;#8230;",
        "html_description": "<p>Storyteller is a platform that allows brands to integrate Stories functionality into their apps and websites. The platform is in use by multiple global brands serving millions of users.</p>\n<p>We are looking for a Graphic Designer with a solid grasp of typography, typesetting, and design tools, primarily Figma and Adobe Photoshop.</p>\n<p>You&#8217;ll be working with a friendly, talented team and have the opportunity to grow and lead both technically and in managing others. If the idea of a fast-paced, dynamic role with tonnes of opportunity for change, responsibility and innovation sounds exciting to you, then read on!</p>\n<p><strong>** PLEASE ENSURE YOUR CV AND PORTFOLIO ARE IN ENGLISH WHEN SUBMITTING YOUR APPLICATION **</strong></p>\n<p><strong>Up to 25k EUR </strong>per year (or currency equivalent) full time contractor contract</p>\n<p> Fully remote working within Europe!<br />\n✨ Exciting high growth product, relied on by leading global sports brands<br />\n Working with the latest hardware, tech stack and tools</p>\n<p><strong>The working hours for this role are 9am &#8211; 5pm UK time.</strong></p>\n<h2><strong>ABOUT US:</strong></h2>\n<p>Storyteller is a high growth B2B SaaS platform, which allows companies to integrate Stories into their owned and operated platforms. Popularised by Instagram and Snapchat, Stories are perfectly suited for boosting user engagement, audience retention, and driving advertising revenue. For customers, building their own stories experience can take years and a lot of investment however Storyteller has solved this by allowing companies to integrate in days, not years all for one monthly cost.</p>\n<p>Our end‑to‑end platform gives companies a best‑in‑class Stories experience in days with native iOS, Android, and Web SDKs, publishing tools, analytics, and ad support.</p>\n<p>We work with globally-recognised clients in US TV and Sports industries. Every day we produce work that is innovative, challenging, and enjoyed by millions of people!</p>\n<h2><strong>RESPONSIBILITIES:</strong></h2>\n<p><strong>Key areas of focus include: </strong></p>\n<ul>\n<li><strong>Software Proficiency:</strong> Figma, Adobe Photoshop, Adobe Illustrator</li>\n<li><strong>Design Principles:</strong> Grid systems, hierarchy, balance, layout, typography, typesetting, colour theory.</li>\n<li><strong>Attention to Detail:</strong> Meticulous, intelligence in layer naming and file organization.</li>\n<li><strong>Organisation:</strong> Strong organisational skills and able to manage multiple projects in a fast-paced environment.</li>\n<li><strong>Traits:</strong> Creative and conceptualisation skills, versatile and tech-savvy.</li>\n</ul>\n<p><strong>What can you expect?</strong></p>\n<ul>\n<li>Use Figma to produce high-quality content for high-profile sporting clients.</li>\n<li>Design and produce promotional materials, advertisements, and digital assets.</li>\n<li>Create visually compelling posters and digital assets</li>\n<li>Produce assets that convey a clear and effective message with impact and creative flair.</li>\n<li>Follow client accounts and competitors on digital and traditional media to research and propose ideas for engaging and innovative content.</li>\n<li>Manage time effectively to produce multiple assets per day and communicate with managers on progress.</li>\n<li>Learn and utilize collaborative tools to drive assets through internal processes.</li>\n<li>Develop your skills by learning from other team members and through independent research.</li>\n<li>Extended hours as required.</li>\n</ul>\n<h2><strong>QUALIFICATIONS:</strong></h2>\n<p><strong>What&#8217;s important to us:  </strong></p>\n<ul>\n<li>Degree/Diploma in Graphic Design, Visual Arts, or equivalent experience.</li>\n<li>Proven experience as a Graphic Designer, with a strong portfolio showcasing a range of design work.</li>\n<li>Excellent eye for detail, particularly regarding typography, layout and color.</li>\n<li>Advanced understanding of Figma.</li>\n<li>Experience with workplace collaboration tools such as Slack, Airtable.</li>\n<li>Excellent communication and collaboration skills.</li>\n<li>Ability to take creative direction and work independently with minimal supervision.</li>\n<li>Ability to manage multiple projects at a time and meet strict deadlines in a fast-paced environment.</li>\n<li>Proactive individual with a high sense of urgency.</li>\n<li>Ability to adjust well to feedback and changing priorities.</li>\n<li>High work ethic, self-motivation, dependable and reliable.</li>\n<li>Fluent in English, both written and spoken. (min. C1 English)</li>\n<li>Experience with social media platforms and digital marketing.</li>\n</ul>\n<p><strong>What’s nice to have:  </strong></p>\n<ul>\n<li>Experience with design system, building one from scratch</li>\n<li>UI Design</li>\n<li>Illustrations</li>\n</ul>\n<h2><strong>RECRUITMENT PROCESS: </strong></h2>\n<p>Firstly, you will be asked to complete a design task that aims to test your skills (which you will be compensated for completing).</p>\n<p>If successful after task review, you will be invited for a 60 minute interview via MS Teams with Elia, our Design Director.</p>",
        "url": "https://jobicy.com/jobs/115278-graphic-designer-4",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:55:27",
        "salary": "EUR 25,000+",
        "job_type": "full-time",
        "category": "Creative &amp; Design",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2024/08/82e26b40-221.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Experience Partner",
        "company": "Granicus",
        "location": "USA",
        "description": "Our Experience Partners have strong experience in customer-facing environments. They are CX practitioners and delivery experts across the portfolio of Granicus services, technology, and data solutions, responsible for developing and articulating comprehensive experience proposals. Ideal candidates have experience as a human-centered design practitioner, data-driven analyst, digital content creator, technology strategist, program manager, business development manager,&amp;#8230;",
        "html_description": "<p>Our Experience Partners have strong experience in customer-facing environments. They are CX practitioners and delivery experts across the portfolio of Granicus services, technology, and data solutions, responsible for developing and articulating comprehensive experience proposals. Ideal candidates have experience as a human-centered design practitioner, data-driven analyst, digital content creator, technology strategist, program manager, business development manager, account manager and/or customer relationship manager.</p>\n<p>Our Experience Partners are involved during pre-sales and lead post-sales activities. They will maintain the executive relationships with their customers and act as a main contact for the programs they own, ensuring tight alignment, offering proactive and prescriptive advice, and ultimately resulting in outstanding Customer Success. This may include the following:</p>\n<ul>\n<li>Pre-sales alignment and experience definition.</li>\n<li>Project kickoff.</li>\n<li>Bringing industry expertise and perspective.</li>\n<li>Drive better outcomes through extensive experience, services, data, and technical expertise.</li>\n<li>Deep understanding of Granicus solutions.</li>\n<li>Alignment to and support of customer objectives.</li>\n<li>Regular customer check-ins.</li>\n<li>Ensure project operational compliance.</li>\n<li>Executive Relationship building.</li>\n<li>Owning their book of business, constituted by programs across an assigned set of customers.</li>\n<li>Being customer&#8217;s primary Point of Contact for owned programs.</li>\n<li>Protect existing program revenues and prevent/mitigate program and customer churn.</li>\n<li>Grow revenues through direct upsells within the programs and generating cross-selling leads.</li>\n</ul>\n<h2>What Your Impact Will Look Like Here</h2>\n<ul>\n<li>Develop, grow, and manage strategic customer relationships.</li>\n<li>Create and deliver effective presentations and proposals to address the specific needs of a customer or prospect.</li>\n<li>Work with customers to identify and align programs, agency, or mission objectives to improve CX outcomes.</li>\n<li>Design &amp; deliver strategic program reviews to infuse CX subject matter expertise and develop relationships with agency’s executive stakeholders.</li>\n<li>Identify and develop customer engagement and recognition opportunities.</li>\n<li>Drive organic growth by leveraging our current book of business and relationships.</li>\n<li>Work with customer to create demand for Granicus services and solutions.</li>\n<li>Collaborate with Granicus leadership to shape development of new services based on customer demand and insight.</li>\n<li>Serve as the voice of the customer, bringing their needs and concerns back into the company to inform our solutions and processes.</li>\n<li>Represent Granicus in speaking roles, panel participation, and internal or external engagements.</li>\n</ul>\n<h2>You will love this job if you have</h2>\n<ul>\n<li>2-3 years of experience in digital services, managing a portfolio of projects, including delivery, quality assurance, and growth of programs, preferably with an understanding of human-centered design best practices and approaches.</li>\n<li>Ability to serve as a trusted, strategic adviser to top professionals.</li>\n<li>Demonstrated commercial acumen and successful track record of customer or project P&amp;L management.</li>\n<li>Passion for public service, citizen engagement, service transformation and communication.</li>\n<li>Exceptional interpersonal skills for internal and external relationship building at all levels of the organization, including cross-departmental colleagues and customers.</li>\n<li>Self-motivated, flexible problem solver, who can keep the trains running (managing the routine) but can also adapt quickly and find alternative ways to get the work done.</li>\n<li>Exceptional interpersonal skills for internal and external relationship-building.</li>\n<li>Ability to thrive in a lean, self-propelling, proactive environment.</li>\n<li>Commitment to diversity of thought and consideration of different ideas.</li>\n<li>Prior to the shutdown for the Covid-19 pandemic, CXS staff were expected to be available for on-site customer meetings. This included travel in some instances. As our customers&#8217; expectations and responses to the pandemic continue to evolve, CXS team members may once again be expected to be available for in-person customer meetings.</li>\n</ul>\n<p>Potential base salary. Does not include bonus OR commission and benefits.</p>\n<p>COMPENSATION RANGE: $80,000-$90,000 USD</p>\n<p>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above, but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit!</p>\n<h2><b>Security and Privacy Requirements</b></h2>\n<ul>\n<li>Responsible for Granicus information security by appropriately preserving the Confidentiality, Integrity, and Availability (CIA) of Granicus information assets in accordance with the company&#8217;s information security program.</li>\n<li>Responsible for ensuring the data privacy of our employees and customers, their data, as well as taking all required privacy training in a timely manner, in accordance with company policies.</li>\n</ul>\n<p>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit!</p>\n<h2><b>The Team</b></h2>\n<p>We are a remote-first company with a globally distributed workforce across the United States, Canada, United Kingdom, India, Armenia, Australia, and New Zealand.</p>\n<h2><b>The Culture</b></h2>\n<ul>\n<li>At Granicus, we are building a transparent, inclusive, and safe space for everyone who wants to be</li>\n<li>a part of our journey.</li>\n<li>A few culture highlights include – Employee Resource Groups to encourage diverse voices</li>\n<li>Coffee with Mark sessions – Our employees get to interact with our CEO on very important and</li>\n<li>sometimes difficult issues ranging from mental health to work-life balance and current affairs.</li>\n<li>Microsoft Teams communities focused on wellness, art, furbabies, family, parenting, and more.-=- &#8211; We bring in special guests from time to time to discuss issues that impact our employee</li>\n<li>population</li>\n</ul>\n<h2><b>The Benefits</b></h2>\n<p>At Granicus, we offer a competitive benefits package that allows employees to tailor benefits to their needs. Benefits listed below are for employees based in the U.S.</p>\n<ul>\n<li>&#8211; Flexible Time Off</li>\n<li>&#8211; Medical (includes an option that is paid 100% by Granicus!), Dental &amp; Vision Insurance</li>\n<li>&#8211; 401(k) plan with matching contribution</li>\n<li>&#8211; Paid Parental Leave</li>\n<li>&#8211; Employer-paid Short and Long Term Disability Insurance, Group Term Life Insurance and AD&amp;D Insurance</li>\n<li>&#8211; Group legal coverage</li>\n<li>&#8211; And more!</li>\n</ul>\n<p><i>Granicus is committed to providing equal employment opportunities. All qualified applicants and employees will be considered for employment and advancement without regard to race, color, religion, creed, national origin, ancestry, sex, gender, gender identity, gender expression, physical or mental disability, age, genetic information, sexual or affectional orientation, marital status, status with regard to public assistance, familial status, military or veteran status or any other status protected by applicable law.</i></p>",
        "url": "https://jobicy.com/jobs/116657-experience-partner",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:52:44",
        "salary": "USD 80,000 - 90,000",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c3b43ee4862a75f6e3a7bd3f4f08630d.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Full Stack Engineer",
        "company": "Bixal",
        "location": "USA",
        "description": "Bixal is a consulting company based in Fairfax, VA, working alongside governments and organizations to help them deliver better services and experiences to the communities they serve. Using evidence-based knowledge and technology, Bixal empowers clients to deliver on their missions more effectively by fostering a culture of learning and continuous improvement. Location This role can&amp;#8230;",
        "html_description": "<p>Bixal is a consulting company based in Fairfax, VA, working alongside governments and organizations to help them deliver better services and experiences to the communities they serve. Using evidence-based knowledge and technology, Bixal empowers clients to deliver on their missions more effectively by fostering a culture of learning and continuous improvement.</p>\n<h2><b>Location</b></h2>\n<p>This role can work remotely from anywhere in the USA. You must be legally authorized to work in the US. Bixal does not provide visa sponsorship.</p>\n<h2><b>What will you do?</b></h2>\n<p>We are looking for a <b>Full Stack Engineer</b> to develop and maintain front-end components and back-end services that power the <b>VA.gov platform and VA Health &amp; Benefits mobile app</b>. This role is perfect for someone passionate about <b>accessible, scalable, and secure government digital services</b>.</p>\n<h2><b>Important Note</b></h2>\n<p>This is a full-time position contingent on contract award by our client, with a defined performance period of up to one year. This role offers you a unique opportunity to make a meaningful impact on a project that aligns with Bixal’s mission of delivering innovative, human-centered solutions. While the role has a fixed duration, we are committed to transparency and collaboration, keeping you informed about contract updates and new opportunities.</p>\n<h2>Responsiblities</h2>\n<ul>\n<li>Develop and maintain full-stack applications that support the VA Design System and Forms Library, ensuring a seamless user experience for Veterans and their families.</li>\n<li>Build and optimize React-based front-end components that align with the U.S. Web Design System (USWDS) and VA Design System (VADS) standards.</li>\n<li>Implement RESTful APIs and microservices to support scalable and reusable back-end functionality.</li>\n<li>Ensure performance, security, and accessibility compliance (Section 508, WCAG 2.2 AA, Mobile Content Accessibility Guidelines &#8211; MCAG) across web and mobile platforms.</li>\n<li>Work with React, React Native, Node.js, TypeScript, Express.js, and PostgreSQL (or similar technologies) to develop scalable solutions.</li>\n<li>Maintain and optimize infrastructure on AWS or other cloud environments, ensuring reliability and security.</li>\n<li>Collaborate with designers, UX researchers, and other engineers in an agile development environment to continuously improve the VA’s digital platforms.</li>\n<li>Participate in code reviews, technical discussions, and knowledge sharing to support a culture of engineering excellence.</li>\n<li>Other relevant duties as assigned</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor’s degree, plus at least three years of relevant experience, or an equivalent combination of education and/or experience.</li>\n<li>Experience in full-stack software development.</li>\n<li>Strong proficiency in JavaScript/TypeScript, React, and Node.js.</li>\n<li>Experience with server-side frameworks like Express.js, NestJS, or similar.</li>\n<li>Understanding of database management (PostgreSQL, MySQL, or MongoDB) and writing efficient queries.</li>\n<li>Familiarity with API development (REST, GraphQL) and authentication (OAuth, JWT, SAML).</li>\n<li>Knowledge of cloud services (AWS, Azure, or GCP), CI/CD pipelines, and containerization (Docker, Kubernetes).</li>\n<li>Commitment to writing clean, maintainable, and well-documented code.</li>\n<li>Experience working with federal web accessibility standards (Section 508, WCAG 2.2 AA, ARIA roles, screen readers like JAWS &amp; NVDA, etc.).</li>\n<li>User-Centered Mindset – Passion for building accessible and user-friendly solutions for Veterans, service members, and their families.</li>\n<li>Problem-Solving – Ability to troubleshoot complex issues and optimize system performance.</li>\n<li>Collaboration &amp; Communication – Strong ability to work in an agile, remote team environment and explain technical concepts to non-technical stakeholders.</li>\n<li>Adaptability &amp; Growth – Eagerness to learn new technologies, contribute to open-source projects, and iterate on solutions based on feedback.</li>\n<li>Attention to Detail – Commitment to maintaining high standards for security, scalability, and performance.</li>\n<li>Must be able to obtain and maintain a Public Trust clearance.</li>\n</ul>\n<h2>Nice to haves</h2>\n<ul>\n<li>Experience with React Native for mobile app development.</li>\n<li>Familiarity with Figma and collaborating with design teams.</li>\n<li>Experience working in federal contracting, civic tech, or government digital services.</li>\n<li>Background in DevOps, infrastructure automation, and monitoring tools (Terraform, Datadog, Prometheus).</li>\n</ul>\n<p>$120,000 &#8211; $130,000 a year</p>\n<h2><b>Perks &amp; Benefits</b></h2>\n<ul>\n<li>Flex hours</li>\n<li>401K with matching incentive</li>\n<li>Parental Leave</li>\n<li>Medical/dental/vision benefits</li>\n<li>Flex Spending Account</li>\n<li>Company provided short-term disability and life insurance</li>\n<li>Commuter benefits</li>\n<li>Generous PTO</li>\n<li>11 Paid holidays</li>\n<li>Professional development opportunities</li>\n</ul>\n<p><b>Please note that candidates selected may undergo a background investigation and, if applicable, meet eligibility requirements for suitability.</b></p>\n<p>Our company is committed to providing equal employment opportunities for all individuals and complies with all applicable federal, state, and local anti-discrimination laws. Employment decisions are based on merit, qualifications, and business needs.</p>",
        "url": "https://jobicy.com/jobs/116656-full-stack-engineer",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:47:54",
        "salary": "USD 120,000 - 130,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/b9bfe9bea27184872c3356b52540e09f.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Senior Sales Specialist",
        "company": "Twilio",
        "location": "UK",
        "description": "Twilio is looking for a Senior Sales Specialist to join our Wholesale Trading team and have Revenue responsibility for a selected number of strategic accounts. You will be responsible for defining the strategy and executing upon the growth strategy of your partners. You will own both supply and demand with the ultimate goal to maximize&amp;#8230;",
        "html_description": "<p>Twilio is looking for a Senior Sales Specialist to join our Wholesale Trading team and have Revenue responsibility for a selected number of strategic accounts. You will be responsible for defining the strategy and executing upon the growth strategy of your partners. You will own both supply and demand with the ultimate goal to maximize profitability.</p>\n<h2><strong>Responsibilities</strong></h2>\n<p>In this role, you’ll:</p>\n<ul>\n<li>Develop and drive strategy to achieve optimized profitability within account territory,</li>\n<li>Ruthlessly prioritize by identifying trading opportunities to maximize profitability</li>\n<li>Own pricing strategy and execution, working closely with routing specialists to maximize volume aggregation and account health,</li>\n<li>Cultivate relationships with partners to drive cost efficiencies and quality improvements</li>\n<li>Work with cross-functional stakeholders to manage rates, routes and yield</li>\n<li>Represent Twilio and our values with partners at industry events</li>\n</ul>\n<h2><strong>Qualifications </strong></h2>\n<p>Twilio values diverse experiences from all kinds of industries, and we encourage everyone who meets the required qualifications to apply. If your career is just starting or hasn&#8217;t followed a traditional path, don&#8217;t let that stop you from considering Twilio. We are always looking for people who will bring something new to the table!</p>\n<h3><strong>Required</strong></h3>\n<ul>\n<li>8+ years in international telecom industry in a partner management role</li>\n<li>Highly analytical and strategic attitude with proven ability to analyze and compile large amounts of data to inform decision making</li>\n<li>Demonstrated ability to lead partnerships and exceed critical metrics</li>\n<li>A bias for action with the ability to test and iterate on new ideas quickly with the appropriate controls and data in place to measure success and change or double down on tactics when needed.</li>\n<li>Comfortable working with highly technical, operational and other cross functional teams, while influencing their understanding, building supportive partnerships and driving expected outcome</li>\n<li>Strong individual self drive</li>\n<li>Strong negotiation skills</li>\n</ul>\n<h3><strong>Desired</strong></h3>\n<ul>\n<li>Established relationship with key regional accounts</li>\n<li>Understanding of the SMS supplier ecosystem</li>\n<li>Domain expertise from a highly quant industry such as investment banking, security or commodity trading especially in non-standard segments</li>\n</ul>\n<h2><strong>Location</strong></h2>\n<p>This role will be remote, and based in the United Kingdom.</p>\n<h2><strong>Travel </strong></h2>\n<p>We prioritize connection and opportunities to build relationships with our customers and each other. For this role, approximately 10% travel is anticipated to help you connect in-person in a meaningful way.</p>\n<h2><strong>What We Offer</strong></h2>\n<p>Working at Twilio offers many benefits, including competitive pay, generous time off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.</p>\n<h2><strong>Twilio thinks big. Do you?</strong></h2>\n<p>We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That&#8217;s why we seek out colleagues who embody our values — something we call Twilio Magic. Additionally, we empower employees to build positive change in their communities by supporting their volunteering and donation efforts.</p>\n<p><strong>Twilio is proud to be an equal opportunity employer.</strong> We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Additionally, Twilio participates in the E-Verify program in certain locations, as required by law.</p>",
        "url": "https://jobicy.com/jobs/115962-digital-sales-representative-social-impact-sales",
        "source": "Jobicy",
        "posted_at": "2025-04-02 03:36:12",
        "salary": "",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201023175858-722503.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "B2B Sales Manager - Business Development",
        "company": "ModSquad",
        "location": "Mexico,  USA",
        "description": "Are you a high-energy sales professional looking to join a creative, industry leader? Do you want to accelerate your career growth? You need to stop thinking about the day one stuff. Instead think year one and beyond. If you are interested, here’s what year one with us is all about. Developing new clients, building your&amp;#8230;",
        "html_description": "<p>Are you a high-energy sales professional looking to join a creative, industry leader? Do you want to accelerate your career growth? You need to stop thinking about the day one stuff. Instead think year one and beyond.</p>\n<p>If you are interested, here’s what year one with us is all about. Developing new clients, building your book of business that will keep on giving for years to come. Realistically, we need someone who is a hunter/farmer who is open to learn our processes. Beside a solid base salary, this position is structured with uncapped commission to attract the best of the best.</p>\n<p>ModSquad is currently seeking a Manager level sales executive to join our crew to continue driving forward and close the right type of clients to make ModSquad successful. This position reports to the VP of Sales with responsibility for sales to all small and mid market levels.</p>\n<p>ModSquad is a global leader in the remote workforce model, so we are positioned for success in today’s new world. We support top global brands such as Starz, National Geographic, Kroger, Wounded Warrior Project, Electronic Arts (EA), Children’s Miracle Network Hospitals, and many more. If this is your DNA, apply now!</p>\n<p><b>Hours: </b><b>Standard business hours; more as needed</b></p>\n<p><b>100% Remote role available to US, Jamaica, Mexico </b></p>\n<h2><b>Key Responsibilities:</b></h2>\n<ul>\n<li>Cultivate and develop new business relationships and serve as a trusted business consultant to senior decision-makers</li>\n<li>Assume a lead role in managing sales opportunities and customer negotiations in your region</li>\n<li>Identify proficient sales strategies and tactics for generating leads and closing business (it&#8217;s all about MRR!)</li>\n<li>Develop strong relationships with key strategic partners and, when appropriate, orchestrate the sales process through channel partners</li>\n<li>Engage and utilize the marketing team to target top regional prospects</li>\n</ul>\n<h2><b>What we are looking for:</b></h2>\n<ul>\n<li>University degree in business, marketing, technology, or related field</li>\n<li>3+ years of consultative or value-add sales experience, with a background in closing recurring services such as customer support, moderation, community management, and social media management</li>\n<li>Ability to identify, close, manage, and grow multiple deals each month</li>\n<li>Excellent consultative selling skills</li>\n<li>Concise communication skills</li>\n<li>Experience working with Salesforce.com, Zoom, Slack, Google Docs and similar online/mobile apps</li>\n<li>Strong Excel formula skills for revenue and cost modeling are a requirement as well as contract management, negotiation and legal knowledge.</li>\n<li>Hands-on knowledge of the top social and messaging platforms, and customer-service toolsets, and their role in engaging today’s digital customer</li>\n<li>Ability to travel as needed</li>\n<li>A flexible work schedule allowing for regular interactions with customers and ModSquad teammates in time zones around the world</li>\n<li>Ability to collaborate and strategize on complex issues with the team</li>\n</ul>\n<h2>About ModSquad:</h2>\n<p>ModSquad has been reinventing the Customer Experience Services industry since 2007. Top brands around the globe turn to us for customer support, content moderation, trust and safety, community management, and social media services. We work with startups and Fortune 500 companies and everything in between. Our client list includes Spotify, VSCO, Vimeo, Tourism Ireland, and a ton of other companies we aren’t at liberty to talk about. We support over 50 languages in more than 90 countries. We’re primarily a remote company so you’ve already seen our/your office. If you want to work with great people on cool projects for amazing brands, you’ve come to the right place.</p>\n<p><i>ModSquad is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), gender, national origin, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.</i>Individual base pay or rate depends on various factors, in addition to primary work location, such as complexity and responsibility of role, job or contract duties/requirements, and relevant experience and skills.</p>",
        "url": "https://jobicy.com/jobs/116645-b2b-sales-manager-business-development",
        "source": "Jobicy",
        "posted_at": "2025-04-01 15:47:07",
        "salary": "",
        "job_type": "full-time",
        "category": "Business Development, Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910162701-890885.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "B2B Copywriter - Demand Generation",
        "company": "ModSquad",
        "location": "Anywhere",
        "description": "ModSquad has been reinventing the Customer Experience Services industry since 2007. Top brands around the globe turn to us for customer support, content moderation, trust and safety, community management, and social media services. We work with startups and Fortune 500 companies and everything in between.  Our client list includes Spotify, VSCO, Vimeo, Tourism Ireland, and&amp;#8230;",
        "html_description": "<p>ModSquad has been reinventing the Customer Experience Services industry since 2007. Top brands around the globe turn to us for customer support, content moderation, trust and safety, community management, and social media services. We work with startups and Fortune 500 companies and everything in between.  Our client list includes Spotify, VSCO, Vimeo, Tourism Ireland, and a ton of other companies we aren’t at liberty to talk about. We support over 50 languages in more than 90 countries. We’re primarily a remote company so you’ve already seen our/your office. If you want to work with great people on cool projects for amazing brands, you’ve come to the right place.</p>\n<p>We’re looking to add a writer to our marketing team.</p>\n<p>Are you a person who can build and maintain a content engine that generates demand and drives revenue?  We are seeking someone who can turn visitors into readers, readers into leads, and leads into clients; A writer who can fuel conversations online at scale to pave the way for sales, positioning the sales team as in-demand, trusted experts.</p>\n<p>We’re looking for someone who is data-driven. Someone who understands the ROI of content marketing, how to measure it, and how to maximize it.</p>\n<p>And that someone will have to do it in our signature style.</p>\n<p>We want a writer who resists the easy cliche, the empty jargon, and the overwrought sentences. Someone who aims for more than vapid generalizations and sophomoric insights. A writer who crafts copy that’s clear and conversational, interesting and useful.</p>\n<h2><b>Responsibilities &amp; Duties:</b></h2>\n<ul>\n<li>Develop an inbound content program and roadmap</li>\n<li>Maintain a content calendar with months of revenue-enabling ideas</li>\n<li>Conduct content and market research and run interviews</li>\n<li>Produce authoritative copy that educates and informs</li>\n<li>Write short and long-form pieces: everything from emails to ebooks</li>\n<li>Tailor and repurpose content to a variety of formats and channels</li>\n<li>Utilize SEO best practices to drive organic traffic</li>\n<li>Develop KPIs and track them through GA4, Hubspot, and Salesforce</li>\n<li>Analyze content performance metrics and optimize content accordingly</li>\n</ul>\n<h2><b>Skills and Experience:</b></h2>\n<ul>\n<li>Knows how to tell a compelling story, about anything</li>\n<li>Has an intuitive sense of our brand and voice and can write in our style</li>\n<li>Is committed to deeply understanding our industry and audience</li>\n<li>Can write for every step of the buyer journey</li>\n<li>Cranks out quality copy quickly and efficiently</li>\n<li>Reads stuff like Revising Prose and Several Short Sentences About Writing for fun</li>\n<li>Can articulate our value propositions and bring our messaging framework to life</li>\n<li>Experiments and iterates in a methodical, data-driven way</li>\n<li>Obsesses over ROI</li>\n<li>Stays abreast of new strategies and tactics in this quickly evolving area of marketing</li>\n</ul>\n<h2><b>Requirements:</b></h2>\n<ul>\n<li>3-5 years of proven success as a demand generation content writer</li>\n<li>Bachelor’s degree or equivalent</li>\n<li>Experience or familiarity with our services and related technologies (especially AI)</li>\n<li>Demonstrable knowledge of online content strategy and creation</li>\n<li>Excellent writing, editing, proofreading, and research skills</li>\n<li>Excellent time-management and organizational skills</li>\n<li>Highly familiar with digital customer experiences and the buyer’s journey</li>\n</ul>\n<p><i>ModSquad is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy), gender, national origin, ancestry, age, physical or mental disability, military status, status as a veteran or disabled veteran, sexual orientation, gender identity or expression, marital or family status, genetic information, medical condition, or any other basis protected by applicable federal, state, or local law, ordinance, or regulation.</i></p>",
        "url": "https://jobicy.com/jobs/116644-b2b-copywriter-demand-generation",
        "source": "Jobicy",
        "posted_at": "2025-04-01 15:44:55",
        "salary": "",
        "job_type": "full-time",
        "category": "Content &amp; Editorial",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200910162701-890885.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Information Security Engineer",
        "company": "Branch",
        "location": "USA",
        "description": "Branch is seeking a Security professional to join our established security team. An ideal candidate will be able to bring their existing skills to help cover day to day operational concerns with a desire to continue their learning and career growth. Primary responsibilities include: Security Architecture &amp;amp; Implementation Maintain and expand Cloud security solutions, including&amp;#8230;",
        "html_description": "<p>Branch is seeking a Security professional to join our established security team. An ideal candidate will be able to bring their existing skills to help cover day to day operational concerns with a desire to continue their learning and career growth.</p>\n<h2><strong>Primary responsibilities include:</strong></h2>\n<p><strong>Security Architecture &amp; Implementation</strong></p>\n<ul>\n<li>Maintain and expand Cloud security solutions, including WAF, SIEM, DLP, and IAM tools.</li>\n<li>Evaluate and enhance security configurations across cloud environments.</li>\n<li>Collaborate with IT, Engineering and Cloud Ops teams to ensure secure system and application development.</li>\n<li>Work with Branch’s Managed Defense provider to ensure branch’s systems are protected and monitored 24/7.</li>\n</ul>\n<p><strong>Threat Detection &amp; Incident Response</strong></p>\n<ul>\n<li>Monitor security alerts, analyze threats, and respond to security incidents promptly.</li>\n<li>Maintain logging and monitoring infrastructure.\n<ul>\n<li>Will become an internal expert on the company&#8217;s SIEM.</li>\n<li>Assist with incident response tasks and analysis.</li>\n</ul>\n</li>\n<li>Develop and refine security playbooks for threat mitigation and response.</li>\n<li>Participate and respond to security incidents in a measured, programmatic, and timely manner</li>\n</ul>\n<p><strong>Secondary responsibilities: </strong></p>\n<ul>\n<li>Vulnerability Management &amp; Risk Assessment</li>\n<li>Security Policies &amp; Compliance</li>\n<li>Research &amp; Innovation</li>\n</ul>\n<h2><strong>Qualifications: </strong></h2>\n<ul>\n<li>2-4 years of experience in a similar role.</li>\n<li>Excellent communication skills.</li>\n<li>Ability to independently work security incidents from identification to resolution.</li>\n<li>Cloud Security/CNAPP exposure.</li>\n<li>Solid ethics and core values.</li>\n<li>Experience in using security tools such as EDR/DLP/CNAPP/SIEM.</li>\n<li>Familiarity with security frameworks like SOC 2, PCI, NIST CSF, ISO 27001, CCPA.</li>\n<li>Scripting experience using Bash and Python is preferred.</li>\n<li>Certifications a plus (SEC+, GSEC, CEH, or similar).</li>\n</ul>\n<h2><strong>Compensation:</strong></h2>\n<p>The base compensation range for this role is 120-130k.  The salary range displayed reflects an average base salary range for the position across all the US. The base salary offered to an applicant could be higher or lower based on each applicants’ specific skill set, depth of experience, relevant education or training, etc. The base salary range listed excludes commission/ bonus/ equity or benefits.</p>\n<h2><strong>Benefits: </strong></h2>\n<ul>\n<li>Branch-paid medical, dental, and vision insurance</li>\n<li>Remote-first (domestic USA)</li>\n<li>Equity</li>\n<li>401k</li>\n<li>Flexible time off</li>\n<li>Paid company holidays</li>\n<li>Paid parental leave (eligible after 6 months of employment)</li>\n</ul>\n<h2><strong>Working at Branch</strong></h2>\n<p>A remote-first company with employees located throughout the U.S., Branch emphasizes transparency, accountability, and trust to create a collaborative environment where our product, engineering, marketing, customer support, customer success, and sales teams can all thrive together.</p>\n<p>Our collaborative spirit has helped us become an award-winning fintech company, with Branch’s innovation and workplace recognized across industries. Branch has been honored by Inc., the Webby Awards, Benzinga Fintech Awards, Fintech Breakthrough Awards, Top Workplaces USA, Great Places to Work, and EY Entrepreneur of the Year, Heartland, among others.</p>\n<p>Branch is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/111900-senior-software-engineer-platform-2",
        "source": "Jobicy",
        "posted_at": "2025-04-01 04:25:12",
        "salary": "USD 120,000 - 130,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/3b9dc47a09a30846e3c1355b50098b18.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Sr. Software Engineer - Backend",
        "company": "Lyra Health",
        "location": "USA",
        "description": "Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With&amp;#8230;",
        "html_description": "<p>Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With our innovative digital care platform and global provider network, 17 million people can receive the best care and feel better, faster. Founded by David Ebersman, former CFO of Facebook and Genentech, Lyra has raised more than $900 million.</p>\n<h2><b>About the Role:</b></h2>\n<p>We’re looking for an exceptional Sr. Backend Software Engineer to join our team. We care deeply about making a difference in people’s lives and hope you do too!</p>\n<p>This role can be carried out from our Burlingame, CA headquarters, hybrid, or fully remote/virtually. Remote candidates must be physically located within the United States.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Create lasting impact by building and continuously improving our Python and Java-based APls</li>\n<li>Work within the engineering team on designing, developing and deploying APls that power core product functionality.</li>\n<li>Collaborate with key partners including product management, data science and behavioral health specialists.</li>\n<li>Ensure that best practices are adhered to during all phases of software development.</li>\n<li>Adhere to the highest quality and security standards.</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>BS in CS or related technical field</li>\n<li>6+ years of experience developing enterprise or consumer web applications ideally using Python or Java/Spring</li>\n<li>Experience in developing and deploying multi-tenant web applications</li>\n<li>Experience building scalable REST APls</li>\n<li>Must be highly proactive and a self-starter</li>\n</ul>\n<h2>Diversity &amp; Inclusion at Lyra:</h2>\n<ul>\n<li>Diversity, equity, inclusion, and belonging (DEIB) at Lyra is essential to the way we deliver culturally responsive care, build and manage our provider network, and support holistic efforts to strengthen DEIB in workplaces around the world—including our own.</li>\n<li>People come to Lyra with a range of needs, backgrounds, and abilities that influence their response to mental health support. Our diverse network of providers delivers comprehensive mental health treatment and support rooted in culturally responsive care, a multicultural approach that accounts for the impact of cultural backgrounds on each person’s care experience.</li>\n</ul>\n<p>As a full-time Sr. Software Engineer, you will be employed by Lyra Health, Inc. The anticipated annual base salary range for this full-time position is $142,000 &#8211; $196,000. The base range is determined by role and level, and placement within the range will depend on a number of job-related factors, including but not limited to your skills, qualifications, experience and location. This role may also be eligible for discretionary bonuses.</p>\n<p>Annual salary is only one part of an employee’s total compensation package at Lyra. We also offer generous benefits that include:</p>\n<ul>\n<li>Comprehensive healthcare coverage (including medical, dental, vision, FSA/HSA, life and disability insurances)</li>\n<li>Lyra for Lyrians; coaching and therapy services</li>\n<li>Equity in the company through discretionary restricted stock units</li>\n<li>Competitive time off with pay policies including vacation, sick days, and company holidays</li>\n<li>Paid parental leave</li>\n<li>401K retirement benefits</li>\n<li>Monthly tech allowance</li>\n<li>We like to spread joy throughout the year with well-being perks and activities, surprise swag, free food, regular community celebration…and more!</li>\n</ul>\n<p>&#8220;We are an Equal Opportunity Employer. We do not discriminate on the basis of race, color, religion, sex (including pregnancy), national origin, age, disability, genetic information or any other category protected by law.</p>\n<p>By applying for this position, you acknowledge that your personal information will be processed as per the Lyra Health Workforce Privacy Notice. Through this application, to the extent permitted by law, we will collect personal information from you including, but not limited to, your name, email address, gender identity, employment information, and phone number for the purposes of recruiting and assessing suitability, aptitude, skills, qualifications, and interests for employment with Lyra.  We may also collect information about your race, ethnicity, and sexual orientation, which is considered sensitive personal information under the California Privacy Rights Act (CPRA) and special category data under the UK and EU GDPR.  Providing this information is optional and completely voluntary, and if you provide it you consent to Lyra processing it for the purposes as described at the point of collection, for example for diversity and inclusion initiatives.  If you are a California resident and would like to limit how we use this information, please use the Limit the Use of My Sensitive Personal Information <a href=\"https://privacy-central.securiti.ai/#/dsr/be61bec1-10a5-47ac-94ab-3055974aefb1\">form</a>. This information will only be retained for as long as needed to fulfill the purposes for which it was collected, as described above. Please note that Lyra does not “sell” or “share” personal information as defined by the CPRA. Outside of the United States, for example in the EU, Switzerland and the UK, you may have the right to request access to, or a copy of, your personal information, including in a portable format; request that we delete your information from our systems; object to or restrict processing of your information; or correct inaccurate or outdated personal information in our systems. These rights may be subject to legal limitations.</p>",
        "url": "https://jobicy.com/jobs/114321-senior-software-engineer-backend-4",
        "source": "Jobicy",
        "posted_at": "2025-04-01 04:24:21",
        "salary": "USD 142,000 - 196,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/1594f6d9649b131ca2414928bd60caac.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Full-Stack Software Engineer - Front-End Focus",
        "company": "Amount",
        "location": "USA",
        "description": "As a Full-Stack Software Engineer with a Front-End Focus, you&amp;#8217;ll start your day syncing with a mission-driven Client Experience team, collaborating with designers, back-end engineers, and product managers to align on priorities. Your primary focus will be designing and implementing scalable, high-performance user interfaces, while also integrating with and optimizing back-end services. You&amp;#8217;ll work primarily&amp;#8230;",
        "html_description": "<p>As a Full-Stack Software Engineer with a Front-End Focus, you&#8217;ll start your day syncing with a mission-driven Client Experience team, collaborating with designers, back-end engineers, and product managers to align on priorities. Your primary focus will be designing and implementing scalable, high-performance user interfaces, while also integrating with and optimizing back-end services.</p>\n<p>You&#8217;ll work primarily in JavaScript, TypeScript, and React, leveraging modern frameworks to build seamless, responsive web applications. You&#8217;ll ensure UI/UX best practices are followed, optimize front-end performance for high-traffic fintech applications, and contribute to our back-end services using Java and Spring Boot.</p>\n<p>By the end of the day, you&#8217;ll review pull requests, refine sprint goals, and explore innovative ways to improve both the front-end experience and full-stack efficiency.</p>\n<p><strong>Team:</strong>  Will join a client experience mission-driven team.</p>\n<p><strong>Similar job titles: </strong>Software Engineer, Full-Stack Software Engineer, Software Developer, Front-End Software Engineer</p>\n<p><strong>Salary:</strong> $120,000 &#8211; $160,000</p>\n<h2><strong>WHAT WE’LL TRUST YOU TO DELIVER:</strong></h2>\n<ul>\n<li>Write clean, maintainable, and scalable front-end and full-stack code that meets performance and security standards</li>\n<li>Translate complex requirements into intuitive, high-performance user interfaces, while integrating them seamlessly with back-end services</li>\n<li>Work closely with product and design teams to implement user-friendly features aligned with business needs</li>\n<li><strong>I</strong>mprove load times, responsiveness, and scalability of front-end applications, leveraging best practices in caching and asset management</li>\n<li>Work with Java, Spring Boot, RESTful APIs, and microservices to connect front-end applications with scalable, high-performance back-end systems</li>\n<li>Review pull requests, mentor junior engineers, and contribute to a culture of continuous learning and improvement</li>\n<li>Stay ahead of emerging front-end technologies, ensuring the best tools and frameworks are leveraged for modern fintech applications</li>\n</ul>\n<h2><strong>WHAT YOU LIKELY BRING TO THE TABLE: </strong></h2>\n<ul>\n<li>8+ years in software development, with at least ​5+ years of front-end expertise in a SaaS or FinTech environment</li>\n<li>Proficiency in JavaScript/TypeScript, React, and experience with Angular or Vue.js is a plus</li>\n<li>Strong knowledge of Redux, React Query, or similar tools for managing application state</li>\n<li>Familiarity with Java, Spring Boot, RESTful APIs, and event-driven architectures (ActiveMQ, Temporal)</li>\n<li>Experience with PostgreSQL or Redis for front-end data management and caching</li>\n<li>Deep understanding of front-end optimization techniques, including lazy loading, asset minification, and efficient API calls</li>\n<li>Experience working in agile teams with Jira, Confluence, and Git-based workflows</li>\n<li>A passion for pixel-perfect implementation, accessibility, and modern design principles</li>\n</ul>\n<h2><strong>TOOLS YOU WILL OR MIGHT WORK WITH:</strong></h2>\n<p>ReactJs, Java, Springboot, Micronaut, Temporal, ActiveMQ, Postgres, Redis, Kubernetes, AWS, Jenkins, Git</p>\n<h2><strong>ABOUT AMOUNT (TL;DR)</strong></h2>\n<p><strong>Founded:</strong> 2020<br />\n<strong>Employees:</strong> 150+<br />\n<strong>Locations:</strong> Chicago (HQ) and US Remote<br />\n<strong>Funding:</strong> Amount has raised $281M in total equity capital since inception, including most recently at a valuation of $1B. Investors include WestCap, Hanaco Ventures, Goldman Sachs, Invus Opportunities, Mastercard, and PSCU<br />\n<strong>Key Customers:</strong> TD Bank, Velera, Guaranteed Rate, American Express, Citizens, Fifth Third Bank, Bank United, FIS, Associated Bank, Comerica<br />\n<strong>Tech Stack:</strong> Greenhouse, LinkedIn Recruiter, Lattice, G Suite, Atlassian, AWS, Python, Java, Ruby, GO, node.js, Temporal, Scala, Apache NiFi, Talend, Informatica, Hadoop, Hive, Spark, Pandas, Looker, Argo, Airflow Luigi, Kubernetes, C#, JavaScript (for advanced concepts), ASP.NET MVC, .NET Core, Microsoft SQL Server, Entity Framework (ORM for database interaction)</p>",
        "url": "https://jobicy.com/jobs/116639-full-stack-software-engineer-front-end-focus",
        "source": "Jobicy",
        "posted_at": "2025-04-01 04:04:31",
        "salary": "USD 120,000 - 160,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b2f40690858b404ed10e62bdf422c704.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Senior iOS Engineer",
        "company": "Help Scout",
        "location": "Canada,  Europe,  USA",
        "description": "As a Senior iOS Software Engineer at Help Scout, you will work alongside our experienced Product and Design teams to build world-class mobile applications for iOS. You&amp;#8217;ll be an integral part of the mobile team that provides our customers with helpful mobile solutions that complement and enhance their interactions with Help Scout. We aim to&amp;#8230;",
        "html_description": "<p>As a Senior iOS Software Engineer at Help Scout, you will work alongside our experienced Product and Design teams to build world-class mobile applications for iOS. You&#8217;ll be an integral part of the mobile team that provides our customers with helpful mobile solutions that complement and enhance their interactions with Help Scout.</p>\n<p>We aim to deliver a seamless and reliable experience on our mobile platforms, enabling agile interactions tailored to the mobile world. Our focus is on supporting our mobile users and addressing the most impactful use cases that enhance their experience.</p>\n<h2>Time Zone Note</h2>\n<p>We believe in strong work-life blend, and since we have remote team members living between EU through PT time zones, we require that your regular working hours overlap with<strong> 8am to 12 pm ET</strong> to ensure overlap with your team members.</p>\n<h2>About the Role</h2>\n<p>We’re giving our entire iOS app a fresh new look and feel. You will build new features that delight our users and have the opportunity to work with Kotlin Multiplatform as we enhance the application.</p>\n<p>As an iOS Software Engineer at Help Scout, you will:</p>\n<ul>\n<li>Have significant ownership in the development of our iOS application.</li>\n<li>Collaborate closely with our Android Engineers as a cohesive and collaborative Mobile Team.</li>\n<li>Work alongside Product and Design teams to provide input on the mobile application user experience and interface designs.</li>\n<li>Write clean, efficient, and maintainable code using Swift, some Objective-C (in a few pockets of our code base), and Kotlin Multiplatform.</li>\n<li>Ensure the high performance, quality, and responsiveness of our iOS application.</li>\n<li>Debug and resolve technical issues that arise in our iOS application.</li>\n<li>Work with customers and QA testers to ensure the mobile apps continue to be a resounding success for the business.</li>\n<li>Continuously work on adding new features, optimizing for other devices, and improving the product.</li>\n</ul>\n<h2>About You</h2>\n<ul>\n<li>As a Senior iOS Software Engineer at Help Scout, you have a deep understanding and extensive hands-on experience with Swift.</li>\n<li>You have a great understanding of how &#8220;always online&#8221; products like Help Scout communicate with web services in an unpredictable mobile reality. You can help us design everything to fail gracefully and leverage local storage to provide customers with as seamless an experience as possible.</li>\n<li>You delight not only in how an application works but in how it looks, and you have an excellent understanding of mobile interaction design. You love working on UI animations because they can help you execute the perfect user experience.</li>\n<li>You stay up-to-date with the latest advancements in mobile technology, specifically the iOS platform, and can provide insightful advice about leveraging native platform APIs.</li>\n<li>You value ownership. You love to see your work in the hands of users, and you’re never afraid to dive into an issue to find the quick fix or get to the real root of the issue.</li>\n<li>You are excited about remote work and believe that remote teams are the future of work. You can adjust your work/management style to be remote-friendly.</li>\n<li>You have interest in Kotlin Multiplatform Mobile development. Prior experience in this domain or with Kotlin is appreciated, but not required.</li>\n</ul>\n<h2>About the Process</h2>\n<ol>\n<li><strong>Value Add</strong> &#8211; you’ll meet with Alicia, Mobile Engineering Manager, to talk more about the role and your design work.</li>\n<li><strong>Logistics </strong>&#8211; you&#8217;ll meet with Erika on the Recruiting team to chat through compensation, benefits, timeline, and company culture.</li>\n<li><strong>Test Project </strong>&#8211; we’ll give you a take-home project that’s expected to take ~6 hours (we’ll pay for your time), then our team will review it and provide feedback.</li>\n<li><strong>Project Discussion</strong> &#8211; we&#8217;ll set up some additional time with the team to walk through your work and the decisions you made.</li>\n<li><strong>Final Chat </strong>&#8211; you’ll chat with another 3 people on the team, including our Eng leadership and your Product partner.</li>\n<li><strong>References </strong>&#8211; we’ll ask you for three references. Ideally, we’d like two of them to be managers, but we can be flexible.</li>\n</ol>\n<h2><strong>Compensation</strong></h2>\n<p>Each role at Help Scout has a pay range aligned to our salary formula and based on national market data. We take a competency-based approach and pay is based on the level and band of your role. We assess leveling during the hiring process for new teammates, during our bi-annual performance review cycles, and when a teammate’s role changes.</p>\n<p><strong>The salary range for this role is $162,000 &#8211; $175,000.</strong></p>\n<h2>Hiring Guidelines:</h2>\n<p>All of our roles are remote, however, some roles may carry specific location-based eligibility requirements. Additionally, because Help Scout is a fully remote company and we hire from many countries, we do not sponsor visas. Help Scout teammates need to be authorized to work from their home location.</p>\n<p>For our Sales roles, we are only able to hire in the <strong>United States</strong>.</p>\n<p>For other roles, we are only able to hire in the following countries: <strong>United States</strong>, <strong>Canada</strong>, <strong>Australia</strong>, <strong>Finland</strong>, <strong>Ireland</strong>, <strong>Netherlands</strong>, <strong>Poland</strong>, <strong>United Kingdom</strong>, <strong>Denmark</strong>, <strong>Germany</strong>, and <strong>Norway.</strong></p>\n<p>We’re working on expanding this list. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.</p>\n<p>We are an equal opportunity employer and are committed to building a company that embraces and celebrates diversity and inclusion. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status. We have read the studies and understand that diverse teams build better products, bring more perspective to the table, contribute to a company’s financial success, and help foster a more inclusive environment for all employees, but the bottom line is that it&#8217;s the right thing to do.</p>\n<p>To provide you with the best experience, we can support you with accommodations or adjustments at any stage of the recruitment process. Simply inform our recruitment team during your conversation with them.</p>\n<h2>A note on the use of AI in our interview process</h2>\n<p>While we understand that AI in an important tool in a modern skillset, we ask that you do not utilize AI assistants live on our interviews. Of course, use any tools you need to prepare! But we&#8217;d like for you to have a real human-to-human conversation with our team.</p>\n<p>On our end, we utilize a platform called Brighthire as a notetaker and review tool to ensure a fair and transparent hiring process.</p>",
        "url": "https://jobicy.com/jobs/116637-senior-ios-engineer-6",
        "source": "Jobicy",
        "posted_at": "2025-04-01 03:57:54",
        "salary": "USD 162,000 - 175,000",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210106163921-999274.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Growth Marketing Manager (Lead Lifecycle &amp;amp; Marketing Automation)",
        "company": "Boulevard",
        "location": "USA",
        "description": "As the Growth Marketing Manager for Lead Lifecycle &amp;amp; Marketing Automation, you will be responsible for designing, executing, and optimizing acquisition-focused marketing strategies using email/SMS marketing to engage and nurture leads through their entire journey—from initial awareness to conversion. You will leverage data-driven insights and marketing automation tools to craft personalized, impactful campaigns that drive&amp;#8230;",
        "html_description": "<p>As the Growth Marketing Manager for Lead Lifecycle &amp; Marketing Automation, you will be responsible for designing, executing, and optimizing acquisition-focused marketing strategies using email/SMS marketing to engage and nurture leads through their entire journey—from initial awareness to conversion. You will leverage data-driven insights and marketing automation tools to craft personalized, impactful campaigns that drive leads down the funnel and turn leads/contacts into sales-ready opportunities.</p>\n<p>This role requires a combination of creative thinking, analytical expertise, and technical proficiency to enhance the buyer’s journey through relevant and personalized communications. This role reports to the VP of Growth Marketing and gets to contribute directly to Boulevard’s growth through revenue-driven marketing initiatives.</p>\n<h2><strong>What You’ll Do Here</strong></h2>\n<ul>\n<li><strong>Buyer Journey Mapping: </strong>Work on mapping the ideal buyer’s journey and improving lead touchpoints to ensure an engaging and seamless experience from first touch to conversion.</li>\n<li><strong>Lead Funnel Strategy &amp; Execution: </strong>Develop and implement comprehensive lead lifecycle marketing strategies focused on moving prospects through the funnel, from awareness to consideration and conversion.</li>\n<li><strong>Campaign Development &amp; Optimization: </strong>Develop automated email/SMS campaigns that nurture leads at each stage of the funnel. Partner with the content team to curate high-value, relevant content that resonates with leads at different stages in the funnel (blog posts, guides, case studies, testimonials, etc.) to improve lead conversion rates and customer acquisition costs.</li>\n<li><strong>Continuous Improvement &amp; Testing: </strong>Conduct A/B testing, multivariate testing, and other optimization efforts to refine messaging, offers, and creative elements across campaigns to improve lead conversion.</li>\n<li><strong>Marketing Automation &amp; Tools Management: </strong>Utilize marketing automation platforms (e.g Marketo) to execute, track, and optimize campaigns, ensuring smooth workflows and integration across platforms.</li>\n<li><strong>Lead Scoring &amp; Segmentation: </strong>Partner closely with Rev Ops and Marketing Analytics teams to enhance lead-scoring models that prioritize high-value leads. Utilize segmentation strategies to deliver personalized content and offers to the right leads at the right time.</li>\n<li><strong>Funnel Analytics &amp; Reporting: </strong>Monitor campaign performance and analyze key metrics such as lead progression (lead to qualified to demo conversion). Stay on top of reports and insights to optimize marketing strategies and enhance funnel performance.</li>\n<li><strong>Collaboration Across Teams: </strong>Partner with content, product marketing, and sales teams to ensure marketing efforts are aligned with overall business objectives and deliver a seamless, consistent experience for leads as they move through the funnel</li>\n</ul>\n<h2><strong>What You’ll Need To Thrive</strong></h2>\n<ul>\n<li><strong>Education: </strong>Bachelor&#8217;s degree in Marketing, Business, or a related field (or equivalent experience)<strong><br />\n</strong></li>\n<li><strong>Experience: </strong>Ideal candidates will have 5+ years of experience in lead lifecycle marketing (acquisition-focused) and funnel management in growth marketing or demand generation.</li>\n<li><strong>Skills:</strong>\n<ul>\n<li>Proven track record of designing and executing lead nurturing programs that effectively move prospects through the funnel and drive measurable results</li>\n<li>Strong analytical skills with experience in data-driven decision-making, A/B testing, and campaign performance analysis</li>\n<li>Experience with marketing automation platforms (e.g., Marketo), CRM systems (Salesforce), email and SMS platforms, and best practices</li>\n<li>Exceptional communication skills, with the ability to collaborate effectively across teams and engage stakeholders</li>\n<li>Experience in segmentation, lead scoring, and customer journey optimization</li>\n<li>A creative, results-oriented mindset with a strong focus on continuous improvement</li>\n</ul>\n</li>\n</ul>\n<h2><strong>How We’ll Take Care Of You</strong></h2>\n<p><em>Your starting total cash compensation for this role is between </em>$102,000 &#8211; $145,000<em>, depending on your current skills, experience, training, and overall market demands. This salary range is subject to change, and there is always room for growth and advancement.</em></p>\n<p>In addition to the wonderful people you’ll get to work with and challenging projects that’ll push you &#8211; Boulevard is here to make sure you’re always at the top of your game emotionally, mentally, and physically.</p>\n<ul>\n<li>✨ We’ve got you covered with a 401(k) match plus dental, medical, vision, and life insurance.</li>\n<li> Take a break whenever you need with our flexible vacation day policy.</li>\n<li> Fully remote so you can choose where you want to work. You’ll receive a work from home stipend every month.</li>\n<li> Family planning resources and specialized support programs.</li>\n<li> Equity: get ahead on the ground floor and grow with Boulevard.</li>\n<li> Boulevard Bucks Learning and Development program allows employees to explore businesses in the market we serve.</li>\n</ul>\n<p><em>Boulevard Labs, Inc. is an Equal Opportunity Employer committed to hiring a diverse workforce and sustaining an inclusive culture. All employment decisions at Boulevard Labs, Inc. are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.</em></p>",
        "url": "https://jobicy.com/jobs/115245-campaign-manager",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:18:48",
        "salary": "USD 102,000 - 145,000",
        "job_type": "full-time",
        "category": "Marketing &amp; Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/a45167e12b0ed51058a884cf9cd0c76f.png",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Senior Accountant",
        "company": "RenoFi",
        "location": "EMEA,  Europe,  USA",
        "description": "You’ve spent the past few years in audit and you’re ready for the transition to private. You’re a licensed CPA and you’ve spent some time dabbling in an ERP or two. You’re energized by solving puzzles — and can’t walk away from one until you’ve solved it. You’re a numbers guru at heart, but your&amp;#8230;",
        "html_description": "<p>You’ve spent the past few years in audit and you’re ready for the transition to private. You’re a licensed CPA and you’ve spent some time dabbling in an ERP or two. You’re energized by solving puzzles — and can’t walk away from one until you’ve solved it. You’re a numbers guru at heart, but your superpower is communication. You’re relentless about following up and following through. Most importantly, you care deeply about your team and our mission, and when your co-workers describe you, they always mention that you make your team better.</p>\n<h2><b>YOU WILL WORK ON THE FOLLOWING:</b></h2>\n<p><strong>REVENUE &amp; ACCOUNTS RECEIVABLE:</strong></p>\n<ul>\n<li>Assist with tracking of revenues and deferred revenues by customer and invoice preparation</li>\n</ul>\n<p><strong>CASH MANAGEMENT &amp; ANALYSIS:</strong></p>\n<ul>\n<li>Assist and maintain daily/weekly working capital analysis and cash forecasting</li>\n</ul>\n<p><strong>FINANCIAL CLOSE &amp; REPORTING:</strong></p>\n<ul>\n<li>Assist with preparation of monthly balance sheet reconciliations, month-end close process,   assembling month-end financial statements and monthly financial reporting packages</li>\n<li>Assist with month-end closing of general ledger and AR &amp; AP modules, maintaining fixed</li>\n<li> asset rollforward, prepaid/accrual amortization schedules, data entry and monthly report creation in NetSuite, reconciliation of financial statements</li>\n<li>Prepare monthly bank reconciliations</li>\n<li>Prepare variance explanations from forecast</li>\n<li>Consolidate financial statements including preparation of consolidating and eliminating entries</li>\n<li>Maintain an efficient closing/consolidation process</li>\n</ul>\n<p><strong>ACCOUNTS PAYABLE &amp; EXPENSE MANAGEMENT:</strong></p>\n<ul>\n<li>Process vendor invoices including accurate coding into NetSuite and maintain timely vendor payments</li>\n<li>Process weekly credit card transactions including coding into NetSuite and prepare monthly credit card reconciliations</li>\n</ul>\n<p><strong>DOCUMENTATION &amp; WORKFLOW:</strong></p>\n<ul>\n<li>Maintain documentation of procedures and workflow for assigned areas of responsibility</li>\n<li>Assist with maintenance and organization of accounting files</li>\n<li>Ad hoc tasks and projects as arise</li>\n</ul>\n<p>RenoFi is committed to building a diverse and inclusive team. We believe various backgrounds and experiences contribute to our mission of transforming the renovation lending industry. If your experience doesn’t perfectly match the requirements, we encourage you to apply anyway and tell us why you’d be a great fit for this role!</p>\n<h2><b>ABOUT US:</b></h2>\n<p>The demand for home renovations has never been stronger, yet, it&#8217;s surprisingly difficult for a new homeowner to renovate. It can take a decade to build up enough home equity and savings to pay for a major renovation. As a result, recent homeowners do a lot of financially-suboptimal things to compensate like borrow from their 401k, rack up credit card debt, and use high-interest personal loans. Or they just live unhappily for years in a home that doesn&#8217;t meet their family&#8217;s needs.</p>\n<p>But by completing a major renovation, homeowners are increasing the value of their home. Professional real estate investors leverage this After Renovation Value (ARV) to roll the increase in value into new properties all the time. But there hasn&#8217;t been a great way for homeowners to take advantage of this. If homeowners had an ability to borrow against the ARV, they could increase their borrowing power up to 10x.</p>\n<p>To meet this need, RenoFi created a platform that enables homeowners to borrow funds from RenoFi approved lenders in the form of the first home equity loan purpose-built for renovations! Unlike standard home equity loans, RenoFi Loans use the value of your home post-renovation which lets you borrow the most money at the best possible terms.  RenoFi is creating a full suite of renovation loan products to better suit the needs of today’s homeowners!</p>\n<p>For homeowners, RenoFi makes it possible to renovate years earlier than might be otherwise feasible. For contractors, we empower the financing of renovations at the point of sale, reducing instances of scope reduction, and ensuring prompt payment. Our lender partners, most often credit unions, rely on RenoFi&#8217;s platform to generate loans, create efficiencies, and grow membership. The lenders pay RenoFi for the new loans, which allows us to offer our services to homeowners for free. RenoFi is truly a win-win-win for everyone involved.</p>\n<p>RenoFi is backed by some of the best startup investors in the world, including First Round Capital, NYCA Ventures, CMFG Ventures, and Canaan Partners.</p>\n<h2><b>WE ARE A GLOBALLY DISTRIBUTED TEAM:</b></h2>\n<p>RenoFi has been built from the start as a fully distributed team with an intentional focus on growing a strong team and culture that spans timezones and nationalities.</p>\n<p>Please highlight any prior experience working remotely when applying. US or GMT-adjacent timezones will be prioritized.</p>\n<p>RenoFi offers competitive cash and equity compensation. Some benefit offerings will vary from country to country. In the United States, we offer competitive health and retirement plans. All staff across the globe enjoy a flexible vacation policy.</p>",
        "url": "https://jobicy.com/jobs/112875-senior-accountant-18",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:17:53",
        "salary": "",
        "job_type": "full-time",
        "category": "Finance &amp; Accounting",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/4d0931e9535b402bd83fe4f24e47fac0.png",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Customer Success Manager - SMB",
        "company": "Shopmonkey",
        "location": "Mexico",
        "description": "The Customer Success Manager (CSM) will play a pivotal role in supporting customer engagement and growth initiatives. You will work closely with customers, ensuring they feel empowered, supported, and successful while using our platform. This role focuses on building relationships with clients of varying sizes, driving adoption of key products and features, and identifying opportunities&amp;#8230;",
        "html_description": "<p>The Customer Success Manager (CSM) will play a pivotal role in supporting customer engagement and growth initiatives. You will work closely with customers, ensuring they feel empowered, supported, and successful while using our platform. This role focuses on building relationships with clients of varying sizes, driving adoption of key products and features, and identifying opportunities to enhance customer satisfaction and retention. The Associate CSM will collaborate with cross-functional teams, including sales, implementation, support, and product, to ensure customers are successful throughout their journey. <strong>Please note this remote position is for candidates based in Mexico. </strong></p>\n<h2><strong>You&#8217;ll have an opportunity to</strong></h2>\n<h4><strong>Customer Relationship Management</strong></h4>\n<ul>\n<li>Develop and maintain relationships with assigned customers, including corporate accounts, franchises, and individual users.</li>\n<li>Conduct regular check-ins to ensure customers maintain high Net Promoter Scores (NPS) and are fully engaged with the platform.</li>\n<li>Understand how customers&#8217; businesses operate, identify their unique needs, and make strategic recommendations to help them succeed.</li>\n<li>Become a trusted advisor to key stakeholders and executives, advocating for their success and business goals.</li>\n</ul>\n<h4><strong>Onboarding and Product Adoption</strong></h4>\n<ul>\n<li>Assist with customer education to ensure a seamless transition from onboarding to customer success.</li>\n<li>Conduct product walkthroughs to ensure customers effectively utilize key features and value-added products.</li>\n<li>Drive product adoption by proactively addressing customer challenges and recommending solutions.</li>\n</ul>\n<h4><strong>Customer Growth and Retention</strong></h4>\n<ul>\n<li>Manage accounts by driving upsells, cross-sells, and successful renewals.</li>\n<li>Partner with sales and commercial teams to identify and execute revenue growth opportunities.</li>\n</ul>\n<h4><strong>Issue Resolution and Advocacy</strong></h4>\n<ul>\n<li>Act as the primary point of contact for customer concerns, ensuring issues are addressed quickly and effectively.</li>\n<li>Remove roadblocks to adoption by identifying challenges and proposing solutions.</li>\n<li>Serve as the voice of the customer by representing customer feedback and use cases internally to improve the platform.</li>\n</ul>\n<h4><strong>Customer Insights and Reporting</strong></h4>\n<ul>\n<li>Track and report on key customer success metrics, including engagement levels, product adoption, NPS, and renewal rates.</li>\n<li>Provide regular updates on account health to internal stakeholders.</li>\n</ul>\n<h2><strong>We are looking for you if you have</strong></h2>\n<ul>\n<li>Fluency in English and Spanish</li>\n<li>1-3 years of experience in a customer success or client-facing role, ideally in SaaS.</li>\n<li>Strong interpersonal and communication skills (both written and verbal).</li>\n<li>Experience with customer success and CRM tools (e.g., Salesforce, Vitally, Gainsight).</li>\n<li>Automotive industry experience is a plus</li>\n<li>Customer-centric mindset with a passion for helping clients achieve their goals.</li>\n<li>High emotional intelligence (EQ) and empathy, with the ability to build strong relationships.</li>\n<li>Strong time management and organizational skills.</li>\n<li>Problem-solving mindset with a focus on delivering customer value.</li>\n<li>Ability to thrive in a dynamic, fast-paced startup environment.</li>\n<li>Self-directed, motivated, and continuously learning.</li>\n</ul>\n<h2><strong>Why Shopmonkey? </strong></h2>\n<p><strong>Shopmonkey has become an amazing environment where employees feel that they are valued as people, and not just worker bees. To ensure that our team thrives, we invest in the following perks (benefits below are mainly for U.S. based, full-time employees) Other benefits vary upon location outside the United States, and employment status):</strong></p>\n<h3><strong> Health &amp; Wellness </strong></h3>\n<ul>\n<li>Medical, dental, vision, and life insurance benefits available the 1st of the month following hire date</li>\n<li>Short term and long term disability</li>\n<li>Employee assistance program</li>\n<li>Reimbursement for a personal health and wellness membership</li>\n<li>Generous parental leave</li>\n<li>401(k) available upon hire</li>\n</ul>\n<h3><strong>✈️ Time Off </strong></h3>\n<ul>\n<li>11 paid holidays</li>\n<li>Flexible time off &#8211; take the time off you need!</li>\n</ul>\n<h3><strong> Giving Back </strong></h3>\n<ul>\n<li>Matching donations for approved charitable organizations</li>\n<li>Group volunteer efforts</li>\n</ul>\n<h2><strong>About Shopmonkey</strong></h2>\n<p>Shopmonkey is the leading auto-repair shop software company; it is a cloud-based solution that helps auto-repair shops consolidate tools, save time, and streamline their entire operation onto a simple, easy-to-use platform.</p>\n<p>Headquartered in Silicon Valley and trusted by more than 3,500+ auto shops across the U.S. and Canada, Shopmonkey aims to change the status quo of the car repair market, estimated to be worth more than $500B.</p>\n<p><em>Shopmonkey is committed to building a diverse and inclusive team. We are looking for team members from all backgrounds that are committed to the Shopmonkey mission. </em></p>\n<p><em>Shopmonkey provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. </em></p>\n<p><strong>Please note: </strong>Shopmonkey will never request sensitive information such as your social security number, bank account information, or other non-publicly available information during the application and interview process. If an applicant is extended an offer of employment, such sensitive information will be requested at that time. Shopmonkey will never ask you to receive and ship packages or goods as part of the interview. Other practices to be on alert for:</p>\n<ul>\n<li>Contact initiated via unsolicited text message or cold call. Shopmonkey does not follow up with candidates through instant messaging applications.</li>\n<li>Our Talent Acquisition team only corresponds from email addresses with the domain ‘@Shopmonkey.io’. If a generic email ID ending with Gmail/Yahoo or other domain is used while receiving a job offer or interview call, there is a likelihood of a scammer.</li>\n<li>While some of our jobs can be found on third party job sites, all of our current job opportunities and descriptions are posted on Shopmonkey’s Careers page, or our official LinkedIn Company Page</li>\n</ul>",
        "url": "https://jobicy.com/jobs/115244-customer-support-representative-mexico-2",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:16:55",
        "salary": "",
        "job_type": "full-time",
        "category": "Customer Success",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/baf27bf7e7c0ff8017f9d4271ae886a6.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Account Executive",
        "company": "Simon Data",
        "location": "USA",
        "description": "Simon Data was founded in 2015 by a team of successful serial entrepreneurs with a passion for transforming data to drive real-world results. We are building a best-in-class enterprise Customer Data Platform that empowers marketers to create personalized data-driven experiences for the customers. We’re scrappy problem solvers who believe in tackling big challenges with disruptive&amp;#8230;",
        "html_description": "<p>Simon Data was founded in 2015 by a team of successful serial entrepreneurs with a passion for transforming data to drive real-world results. We are building a best-in-class enterprise Customer Data Platform that empowers marketers to create personalized data-driven experiences for the customers. We’re scrappy problem solvers who believe in tackling big challenges with disruptive thinking and giving our customers the support they need to deliver great next-generation experiences at scale.</p>\n<p>At Simon, we firmly believe that business success starts and ends with people. We all do our best work when we are surrounded by other friendly top performers who want to succeed together. This attitude is core to our values. When you trust your team, invest in their development, and give them ownership, great things happen.</p>\n<h2><strong>The Role</strong></h2>\n<p>Great sales organizations are built on focus, cohesion, drive, and &#8211; of course &#8211; a winning product. At Simon, we’ve built a first-of-it’s kind data and marketing application that benefits from the rapid growth of the cloud data ecosystem and enables businesses to deliver the next generation of customer experiences.</p>\n<p>We are seeking a highly motivated and results-oriented Account Executive to join our dynamic sales team. As an Account Executive at Simon Data, you will be responsible for driving revenue growth by working closely with potential clients, understanding their business needs, and positioning Simon Data as a solution to their challenges. You will play a crucial role in identifying and closing new business opportunities and you&#8217;ll be a key contributor to growing the top line in a category-shaping company</p>\n<p>This role requires a strong work ethic, excellent communication skills, teamwork, and the ability to build and maintain relationships with key stakeholders.</p>\n<h2><strong>What You’ll Do</strong></h2>\n<ul>\n<li>Manage the sales cycle from initial contact through negotiation, closing deals, and contract signing, ensuring customer satisfaction and achieving sales targets.</li>\n<li>Understand customers&#8217; business needs and pain points, articulate the value proposition of the Simon Data solution, and align them with clients&#8217; objectives to drive sales.</li>\n<li>Execute proofs of concept, requiring strong project and stakeholder management skills, as well as the ability to translate customer objectives to strategies and use cases</li>\n<li>Build relationships with the C-Suite and with top Marketing and Tech VPs at high-growth and leading mid-market and enterprise companies, helping them tackle mission-critical problems</li>\n<li>Collaborate with internal teams, including marketing, product development, and customer success, to drive customer acquisition, retention, and product enhancements.</li>\n<li>Develop a deep understanding of our products, features, and benefits to effectively demonstrate their value to prospective clients.</li>\n<li>Stay up-to-date with industry trends, competitor offerings, and market dynamics to identify opportunities and maintain a competitive edge.</li>\n<li>Support positioning within the product itself, working with product to drive content creation around feature releases</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<ul>\n<li>Proven experience in B2B SaaS sales, ideally in the cloud data warehouse, customer data platform, or marketing technology space, with a track record of meeting or exceeding sales targets</li>\n<li>Excellent verbal and written communication skills, with the ability to deliver compelling presentations and negotiate effectively with clients</li>\n<li>Proactive, self-starter with a strong work ethic and the ability to work independently in a fast-paced, target-driven environment</li>\n<li>Ability to build and maintain strong relationships with customers, prospects, and internal stakeholders</li>\n<li>Ability to support demand generation efforts and work collaboratively to build pipeline</li>\n<li>Collaborative style when working across teams</li>\n<li>Quick learner who can absorb and understand the dynamic MarTech landscape at pace</li>\n<li>Strong analytical and problem-solving skills to identify customer needs and propose tailored solutions</li>\n<li>Flexibility to travel for key meetings at your discretion</li>\n<li>Proficiency in the Google office suite (e.g. Gmail, Google Slides), Slack, and Salesforce CRM, Gong and Outreach</li>\n</ul>\n<h2><strong>What We Offer</strong></h2>\n<ul>\n<li>100% coverage of medical premiums for employee AND family</li>\n<li>Flexible PTO</li>\n<li>Generous Maternity and Paternity Leave</li>\n<li>Remote work, quarterly wellness, and client support stipends</li>\n<li>Professional Development stipend</li>\n</ul>\n<p><em>In compliance with the state and city salary transparency requirements, the potential salary for this position is from $100,000 to $130,000 which represents a range commensurate with experience.</em></p>\n<p><strong>Visa sponsorship for this role is currently not available.</strong></p>\n<p>We’re proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status.</p>\n<p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</p>",
        "url": "https://jobicy.com/jobs/91253-account-executive-36",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:13:55",
        "salary": "USD 100,000 - 130,000",
        "job_type": "full-time",
        "category": "Sales",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/112a03eea58b795f9e0cc7f32e50bc8f.jpeg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Technical Support Tier II, Integration",
        "company": "1Password",
        "location": "UK",
        "description": "As a Technical Support Tier II &amp;#8211; Integration, your role is to troubleshoot Tier 2 issues affecting our customers. These issues could include first-level escalations from within our team, more complex reliability issues, and sometimes novel issues from 1Password’s Extended Services, ranging from troubleshooting our CI/CD integrations to handling queries related to Extended Access Management&amp;#8230;.",
        "html_description": "<p>As a Technical Support Tier II &#8211; Integration, your role is to troubleshoot Tier 2 issues affecting our customers. These issues could include first-level escalations from within our team, more complex reliability issues, and sometimes novel issues from 1Password’s Extended Services, ranging from troubleshooting our CI/CD integrations to handling queries related to Extended Access Management. This role is within our Customer Experience Team, or as we like to call it at 1Password: &#8220;CX&#8221;!</p>\n<p>You are equipped with the competencies required to comfortably deal with these more complex issues in a few primary areas of support; alongside this, you have developed competencies to support Tier 1 issues for all of our Extended Services. You contribute in the Tier 2 and Tier 1 spaces respectively, and take on more of a supportive role for your junior colleagues when required.</p>\n<p>This is a remote opportunity within the UK. The starting hours for this role will be as early as 6am GMT/UTC and includes weekend shifts, i.e. Tuesday to Saturday, Sunday to Thursday.</p>\n<h2>What we&#8217;re looking for</h2>\n<ul>\n<li>2-3 years related work experience</li>\n<li>Working knowledge of cloud platforms, identity platform providers, and adjacent services (e.g AWS, Okta, Docker, Kubernetes, etc.)</li>\n<li>Advanced understanding of technologies that impact 1Password products and solutions including developer tools, SIEM platforms, network proxies, VPNs, etc.</li>\n<li>Advanced knowledge of Web Service integrations using REST API</li>\n<li>Familiar with virtualization and provisioning concepts</li>\n<li>Understands cloud infrastructure and has experience deploying containerized applications on cloud platforms</li>\n<li>Knowledge of networking concepts like DNS, TCP/IP ports, etc. Experience with troubleshooting tools like dig, IP address lookup, checking ports, etc.</li>\n<li>Basic scripting ability and has experience in a broad range of programming languages</li>\n<li>Hands on experience with UNIX/LINUX and Windows based platforms</li>\n<li>Preferred: previous experience with the 1Password product</li>\n<li>Preferred: experience working for an organization in the technology space</li>\n</ul>\n<h2>What you can expect</h2>\n<p><b>Deliverables &amp; KPIs:</b></p>\n<ul>\n<li><i>Customer Focus</i> &#8211; Interpret customer requests for technical assistance and address needs effectively and accurately, while maintaining an empathetic, positive, and professional attitude towards the customer at all times. Effectively communicate technical issues to customers, surfacing information readily available through support documentation both internally and externally.</li>\n<li><i>Problem Solving</i> &#8211; Reproduce, diagnose and resolve routine tier 2 queries across your primary areas of support for our Extended Services: 1Password CLI, Events API, Single Sign On (SSO), SSH Tools, Automated Provisioning, Secrets Automation, and Extended Access Management (XAM).</li>\n<li><i>Zoom Support </i>&#8211; Comfortable giving support calls for up to tier 2 issues when required to more quickly resolve customer questions/issues.</li>\n<li><i>System Capability</i> &#8211; Efficiently navigate and utilize internal CX tech stack and customer management systems, in the context of a Technical Rep. Organize and capture knowledge for collaboration and knowledge sharing with the Extended Services team.</li>\n<li><i>Ticket Queue Monitoring</i> &#8211; Triage incoming new tickets or escalations from CX Service and Technical &#8211; Core teams. Assess whether the escalation’s root cause is one of our integrations and liaise with the Core team as needed. Escalates Extended Services’ tickets to a higher tier as required.</li>\n<li><i>Productivity Expectations</i> &#8211; Follows established workflows and adheres to performance expectations for your level in the Extended Services team.</li>\n<li><i>Customer Advocacy</i> &#8211; Where appropriate, file new Gitlab issues for up to tier 2 tickets and feature requests, on behalf of customers for the attention of internal teams. Further, stay up to date with ongoing issues and provide customers with workarounds, where possible.</li>\n<li><i>Mentorship and Collaboration</i> &#8211; Is available to answer questions and support junior representatives via Slack, and is involved in CX’s cross-functional Slack channels. Works with senior representatives to create internal troubleshooting documentation for our team when required.</li>\n</ul>\n<p><b>Product Knowledge:</b></p>\n<ul>\n<li><i>CLI </i>&#8211; Can set-up 1Password CLI with SLS OPH integration, provide high level guidance on advanced CLI solutions such as parsing with jq and chaining multiple CLI commands, and knowledge with using CLI and service accounts, shell integration, op inject, op run, and common use cases.</li>\n<li><i>Events API</i> &#8211; Able to implement Events API integration with Splunk and DataDog following documentation and comfortable parsing/filtering API responses with jq.</li>\n<li><i>SSO</i> &#8211; Can set-up and configure SSO unlock for 1Password accounts using fully supported IdPs and troubleshoot SSO reliability issues using Kibana.</li>\n<li><i>SSH Tools</i> &#8211; Can set-up and configure standard SSH agent integration using OPH and OS specific configurations.</li>\n<li><i>SCIM</i> &#8211; Support standard SCIM configurations with our supported external Identity Providers (IdPs) using supported deployment methods in cloud environments.</li>\n<li><i>Secrets Automation</i> &#8211; Usability knowledge regarding supported SDKs for Connect SDK and can deploy Connect servers in supported cloud environments with all supported deployment methods.</li>\n</ul>\n<p>We believe in the power of remote work, but we also recognize that in-person connection is sometimes important to help us achieve our mission. While we are a remote-first company, occasional travel for in-person engagement will be a part of this role. Frequency will depend on role and responsibilities, and may include, but is not limited to, annual department-wide offsites, team meetings, and customer/industry events. These events will typically be held in varying locations across Canada and the US.</p>\n<h2><b>What we offer</b></h2>\n<p>We believe in working hard, and resting hard. We’re always looking for new ways to support our team members, but here’s a glance at what we currently offer:</p>\n<p><b>Health and wellbeing</b></p>\n<p>&gt;  Maternity and parental leave top-up programs</p>\n<p>&gt;  Wellness spending account</p>\n<p>&gt;  Generous PTO policy</p>\n<p>&gt;  Company-wide wellness days off scheduled throughout the year</p>\n<p>&gt;  Wellness Coach membership</p>\n<p>&gt;  Comprehensive health coverage</p>\n<p><b> Growth and future </b></p>\n<p>&gt;  Employee stock option program for all full-time employees</p>\n<p>&gt;  Retirement matching program</p>\n<p>&gt;  Training budget, 1Password University access, and learning sessions</p>\n<p>&gt;  Free 1Password account (and friends and family discount!)</p>\n<p><b>Flexibility and community</b></p>\n<p>&gt;  Paid volunteer days</p>\n<p>&gt;  Employee-led DEIB programs and ERGs and ECGs</p>\n<p>&gt;  Fully remote environment</p>\n<p>&gt;  Peer-to-peer recognition through Bonusly</p>\n<p><i>1Password is proud to be an equal opportunity employer. We are committed to fostering an inclusive, diverse and equitable workplace that is built on trust, support and respect. We welcome all individuals and do not discriminate on the basis of gender identity and expression, race, ethnicity, disability, sexual orientation, colour, religion, creed, gender, national origin, age, marital status, pregnancy, sex, citizenship, education, languages spoken or veteran status. Be yourself, find your people and share the things you love. </i></p>\n<p><i>Accommodation is available upon request at any point during our recruitment process. If you require an accommodation, please speak to your talent acquisition partner or email us at nextbit@agilebits.com and we’ll work to meet your needs. </i></p>\n<p><i>Remote work is a part of our DNA. Given that our company was founded remotely in 2005, we can safely say we&#8217;re experts at building remote culture. That said, remote work at 1Password does mean working from your home country. If you&#8217;ve got questions or concerns about this, your talent partner would be happy to address them with you.</i></p>\n<p><i>Successful applicants will be required to complete a background check that may consist of prior employment verification, reference checks, education confirmation, criminal background, publicly available social media, credit history, or other information, as permitted by local law.</i></p>",
        "url": "https://jobicy.com/jobs/114294-technical-support-tier-ii-integration",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:13:53",
        "salary": "",
        "job_type": "full-time",
        "category": "Technical Support",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200909195848-296323.png",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Sr. Commercial Counsel",
        "company": "Life360",
        "location": "USA",
        "description": "We are seeking a Senior Commercial Counsel to join our expanding team. This is an exciting opportunity to work closely with teams across Life360 to support a high-growth phase for the Life360 family of mobile software applications and hardware devices, including Tile and Jiobit. In this position, you will be the primary attorney responsible for&amp;#8230;",
        "html_description": "<p>We are seeking a Senior Commercial Counsel to join our expanding team. This is an exciting opportunity to work closely with teams across Life360 to support a high-growth phase for the Life360 family of mobile software applications and hardware devices, including Tile and Jiobit.</p>\n<p>In this position, you will be the primary attorney responsible for commercial contracting for Life360’s growing data and advertising initiatives. You will negotiate and draft data agreements, advertising agreements, technology agreements, and partnership and collaboration agreements. The position also involves supporting business programs across the company and providing strategic legal advice to key stakeholders. In addition, you will support other commercial contracting needs, including helping with vendor agreements, consulting agreements, reseller and distribution agreements, DPAs, and NDAs as needed. You will report to the Deputy General Counsel and collaborate closely with cross-functional teams, including Finance, Product, Privacy, Engineering, and Devices.</p>\n<p>The US-based salary range for this position is $178,500 to $263,000. We take into consideration an individual&#8217;s background and experience in determining final salary- therefore, base pay offered may vary considerably depending on geographic location, job-related knowledge, skills, and experience. The compensation package includes a wide range of medical, dental, vision, financial, and other benefits, as well as equity.</p>\n<h2>What You’ll Do:</h2>\n<ul>\n<li>Be the primary in-house attorney responsible for negotiating and drafting a wide variety of data agreements, advertising agreements, technology agreements, and partnership and collaboration agreements.</li>\n<li>Build templates and playbooks, conduct training, and develop legal processes to support Life360’s growing data and advertising initiatives.</li>\n<li>Provide transaction assistance with general commercial contracts as needed, including vendor agreements, consulting agreements, reseller and distribution agreements, DPAs, and NDAs.</li>\n<li>Work with Privacy and Product attorneys to analyze and mitigate commercial risks related to data privacy, intellectual property, and regulatory compliance.</li>\n<li>Support contract lifecycle management processes, ensuring compliance with internal policies and applicable laws.</li>\n<li>Build relationships and collaborate with teams across the company to understand business needs and translate them into effective commercial agreements.</li>\n</ul>\n<h2>What We’re Looking For:</h2>\n<ul>\n<li>Must have significant hands-on experience negotiating and drafting data and advertising agreements for apps or websites, including familiarity with the ad-tech ecosystem, as well as data privacy regulations (e.g., GDPR, CCPA) and their application in commercial transactions.</li>\n<li>5-12 years of legal experience overall, including at least 3 years of in-house experience. Prefer a mix of law firm and in-house, plus experience counseling consumer technology clients.</li>\n<li>Excellent communication and collaboration skills, and ability to work effectively with cross-functional teams.</li>\n<li>Detail-oriented, and able to prioritize and manage competing demands in a fast-paced environment.</li>\n<li>Strong analytical and problem-solving skills, ability to exercise good judgment with information available, and a solutions-oriented, business-friendly mindset.</li>\n<li>J.D. from an accredited law school and membership in at least one state bar.</li>\n</ul>\n<h2>Our Benefits:</h2>\n<ul>\n<li>Competitive pay and benefits</li>\n<li>Medical, dental, vision, life and disability insurance plans (100% paid for employees)</li>\n<li>401(k) plan with company matching program</li>\n<li>Mental Wellness Program &amp; Employee Assistance Program (EAP) for mental well being</li>\n<li>Flexible PTO, 13 company wide days off throughout the year</li>\n<li>Winter and Summer Week-long Synchronized Company Shutdowns</li>\n<li>Learning &amp; Development programs</li>\n<li>Equipment, tools, and reimbursement support for a productive remote environment</li>\n<li>Free Life360 Platinum Membership for your preferred circle</li>\n<li>Free Tile Products</li>\n</ul>\n<h2>Life360 Values:</h2>\n<p>Our company’s mission driven culture is guided by our shared values to create a trusted work environment where you can bring your authentic self to work and make a positive difference</p>\n<ul>\n<li>Be a Good Person &#8211; We have a team of high integrity people you can trust.</li>\n<li>Be Direct With Respect &#8211; We communicate directly, even when it’s hard.</li>\n<li>Members Before Metrics &#8211; We focus on building an exceptional experience for families.</li>\n<li>High Intensity, High Impact &#8211; We do whatever it takes to get the job done.</li>\n</ul>\n<h2>Our Commitment to Diversity:</h2>\n<p>We believe that different ideas, perspectives and backgrounds create a stronger and more creative work environment that delivers better results. Together, we continue to build an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. It fuels our innovation and connects us closer to our customers and the communities we serve. We strive to create a workplace that reflects the communities we serve and where everyone feels empowered to bring their authentic best selves to work.</p>\n<p><em>We are an equal opportunity employer and value diversity at Life360. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status or any legally protected status.  </em></p>\n<p><em>We encourage people of all backgrounds to apply. We believe that a diversity of perspectives and experiences create a foundation for the best ideas. Come join us in building something meaningful.</em> <em>Even if you don’t meet 100% of the below qualifications, you should still seriously consider applying!</em></p>",
        "url": "https://jobicy.com/jobs/115935-senior-commercial-counsel",
        "source": "Jobicy",
        "posted_at": "2025-03-31 03:09:51",
        "salary": "USD 178,500 - 263,000",
        "job_type": "full-time",
        "category": "Legal &amp; Compliance",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/f269bad3-221.jpeg",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "iOS Engineer - Poe",
        "company": "Quora",
        "location": "Canada,  Europe,  USA",
        "description": "We are seeking a talented iOS Engineer to join us in building Poe, an exciting new platform at the forefront of AI. You will work at the cutting edge of technology to design, develop, and maintain the Poe iOS app. This includes collaborating with our product team to build new AI-driven user features, crafting a&amp;#8230;",
        "html_description": "<p>We are seeking a talented iOS Engineer to join us in building Poe, an exciting new platform at the forefront of AI. You will work at the cutting edge of technology to design, develop, and maintain the Poe iOS app. This includes collaborating with our product team to build new AI-driven user features, crafting a scalable mobile architecture, and creating tools to speed up iteration. As a founding member, you&#8217;ll have a direct influence on the product roadmap and plenty of opportunities to shape the future of AI and mobile platforms.</p>\n<p>Poe has experienced awesome growth so far, and as an iOS Engineer for Poe, you can build the future of AI and technology while gaining invaluable experience with complex problems and systems. If you have a passion for AI, emerging technologies, and mobile development, this role offers an invaluable opportunity to spearhead progress.</p>\n<h2><strong>Responsibilities:</strong></h2>\n<ul>\n<li>Work within a small team of mobile engineers to design, build, and maintain the Poe iOS app</li>\n<li>Build new user-facing features and help drive the Poe product roadmap</li>\n<li>Create tools and infrastructure to enable rapid development of the Poe mobile experience</li>\n<li>Collaborate with the Poe product team and other engineers to enhance the overall user experience</li>\n<li>Own the entire software development process from timeline estimation to coding, testing and release</li>\n</ul>\n<h2><strong>Minimum Requirements:</strong></h2>\n<ul>\n<li><strong>Ability to be available for meetings and impromptu communication during Quora&#8217;s “</strong><strong>coordination hours</strong><strong>&#8221; (Mon-Fri: 9am-3pm Pacific Time)</strong></li>\n<li>2+ years of full-time experience in iOS development with Swift</li>\n<li>Strong knowledge of iOS frameworks, and mobile trends</li>\n<li>High attention to detail in all aspects of development from performance to UI</li>\n<li>A desire to work in a fast-paced, innovative environment and learn continuously</li>\n<li>Self-starter with a strong sense of responsibility; whether it be fixing bugs in a timely manner or proactively identifying issues in order to unblock yourself for a given project</li>\n</ul>\n<h2><strong>Preferred Requirements:</strong></h2>\n<ul>\n<li>Experience with SwiftUI or GraphQL</li>\n<li>Interest in working in the AI space</li>\n</ul>\n<p><strong>At Quora, we value diversity and inclusivity and welcome individuals from all backgrounds, including marginalized or underrepresented groups in tech, to apply for our job openings. We encourage all candidates who share a passion for growing the world’s knowledge, even those who may not strictly meet all the preferred requirements, to apply, as we know that a diverse range of perspectives can have a significant impact on our products and our culture.</strong></p>\n<h2><strong>Additional Information:</strong></h2>\n<p>We are accepting applications on an ongoing basis.</p>\n<p>Quora offers a wide range of benefits including medical/dental/vision coverage, equity refreshers, remote work reimbursement, paid time off, employee assistance programs, and more. Benefits are country-specific and may vary. For more information on benefits, visit this link: www.careers.quora.com/benefits</p>\n<p>There are many factors that will determine the starting pay, including but not limited to experience, location, education, and business needs.</p>\n<ul>\n<li>US candidates only: For US based applicants, the salary range is $128,193 &#8211; $225,160 USD + equity + benefits.</li>\n<li>Canada candidates only: For Canada based applicants, the salary range is $155,509 &#8211; $234,118 CAD + equity + benefits.</li>\n</ul>\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
        "url": "https://jobicy.com/jobs/116611-ios-engineer-poe",
        "source": "Jobicy",
        "posted_at": "2025-03-30 14:42:43",
        "salary": "CAD 155,509 - 234,118",
        "job_type": "full-time",
        "category": "Software Engineering",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200916172339-629302.jpg",
        "job_level": "Any",
        "scraped_date": "2025-04-03"
    },
    {
        "title": "Senior Product Manager, Growth",
        "company": "Givebutter",
        "location": "USA",
        "description": "Givebutter is the most-loved nonprofit fundraising and CRM platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Use of the Givebutter platform&amp;#8230;",
        "html_description": "<p>Givebutter is the most-loved nonprofit fundraising and CRM platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Use of the Givebutter platform is completely free with a 100% transparent tip-or-fee model.</p>\n<p>Givebutter has been certified as a Great Place to Work® in 2021, 2022, 2023, and 2024, and is the #1 rated nonprofit software company on G2 across multiple categories.</p>\n<p>Our mission is to empower the changemaker in all of us. We believe giving should be fun, so you’ll want to do it again, and we also believe that work should be fun, so that you’ll have the greatest impact. We are excited to hear from talented people who want to work with other talented people in making the world a butter place—and have fun along the way.</p>\n<h2>We want to hear from people who…</h2>\n<ul>\n<li>Have a passion for growing software businesses and staying up to date with industry leaders like Elena Verna, Kyle Poyar, Lenny Rachitsky, and Brian Balfour.</li>\n<li>Love doing Growth work and strive to be among the best in the field.</li>\n<li>Enjoy running A/B tests and experiments to optimize performance.</li>\n<li>Are highly analytical and can translate strategic insights into measurable business impact.</li>\n<li>Find scouring data for insights deeply satisfying.</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Own the product roadmap for acquiring and onboarding new accounts into Givebutter.</li>\n<li>Partner with the VP of Growth to define the product strategy for the Growth pod.</li>\n<li>Collaborate with Design, Engineering, and Marketing to build onboarding experiences that drive activation and increase new account acquisition.</li>\n<li>Analyze data and customer research to develop product experiences and experiments that improve activation and acquisition.</li>\n<li>Lead experiments and new features from ideation to deployment, ensuring they deliver meaningful business impact.</li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li>5+ years of product management experience, ideally in a high-scale B2B SaaS or data-driven B2C environment with 100K+ MAUs.</li>\n<li>Deep understanding of SaaS unit economics, including cohort analysis, CAC, conversion rates, retention, and customer lifetime value.</li>\n<li>Data fluency—comfortable with SQL and spreadsheets; Python is a plus.</li>\n<li>Strong analytical and strategic thinking—able to connect product, marketing, and business objectives through data-driven decision-making.</li>\n<li>Experimentation mindset—experience running A/B tests, pricing tests, and interpreting results.</li>\n<li>Bonus: Background in Statistics, Finance, Economics, or Performance Marketing.</li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li><strong>Remote Work:</strong> Work from anywhere in the United States.</li>\n<li><strong>Health Insurance: </strong>We offer Medical, Dental, and Vision insurance covered 100% for employees as well as HSA and FSA accounts.</li>\n<li><strong>Mental Health: </strong>Givebutter health insurance plans come with access to a TalkSpace membership.</li>\n<li><strong>401k:</strong> We offer access to a retirement planning account for all employees, with a match coming in April 2025.</li>\n<li><strong>Vacation and Holiday: </strong>Givebutter offers a Flexible PTO policy with uncapped Vacation days. Givebutter is closed for a whole week in the summer for an employee Wellness Week.</li>\n<li><strong>Parental Leave: </strong>We offer 12 weeks of paid parental leave for both primary and secondary caregivers.</li>\n<li><strong>Home Office Stipend:</strong> Upgrade your home office with company-sponsored expenses, including high-quality laptops, monitors, and modern technology.</li>\n<li><strong>Charitable Giving: </strong>Employees are encouraged to donate up to $50/month to any verified nonprofit they wish to support on Givebutter.</li>\n<li><strong>Professional Development: </strong>We offer learning and development reimbursement opportunities.</li>\n<li><strong>Love What You Do:</strong> We are a mission-driven company serving the charitable sector. Feel good about the work you&#8217;re doing and the company you work for.</li>\n</ul>\n<h2>Compensation</h2>\n<ul>\n<li>Total Cash Compensation Range $145K – $170K • Offers Equity • Offers Bonus</li>\n</ul>",
        "url": "https://jobicy.com/jobs/116606-senior-product-manager-growth",
        "source": "Jobicy",
        "posted_at": "2025-03-30 10:12:38",
        "salary": "USD 145,000 - 170,000",
        "job_type": "full-time",
        "category": "Product &amp; Operations",
        "company_logo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/05/51ca261310065df6b11ed6c81972be72.jpg",
        "job_level": "Senior",
        "scraped_date": "2025-04-03"
    }
]