[
  {
    "title": "Virtual Assistant",
    "company": "The Lawgical Firm, P.A.",
    "location": "Remote",
    "description": "Headquarters: Orlando, FL URL: http://thelawgicalfirm.com The Lawgical Firm, P.A. is a modern, forward-thinking legal practice committed to delivering high-quality legal services with precision, efficiency, and a client-first approach. We’re looking for a reliable, detail-oriented Virtual Assistant to support our team of attorneys and legal professionals. Key Responsibilities: Calendar Management: Coordinate and manage the schedules of attorneys and legal professionals, including client meetings, court appearances, internal deadlines, and follow-ups. Legal Database Management: Maintain and organize case management systems, digital files, document repositories, and legal databases to ensure ease of access and compliance. Legal Forms and Templates: Draft, update, and maintain legal forms, templates, and document precedents used for standard legal filings and client communications. Client Intake: Assist in the intake process for new clients by collecting relevant information, documentation, and ensuring all required forms are completed accurately. Legal Correspondence: Prepare and professionally format legal correspondence such as letters, memos, and client emails under the direction of attorneys. Online Public Records Research: Conduct research using online public records databases to gather necessary information for legal cases, background checks, and filings. Languages : English and Spanish preferred To apply: https://weworkremotely.com/remote-jobs/the-lawgical-firm-p-a-virtual-assistant",
    "url": "https://weworkremotely.com/remote-jobs/the-lawgical-firm-p-a-virtual-assistant",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 19:06:58 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Software Engineering Manager",
    "company": "DistroKid",
    "location": "Remote",
    "description": "Headquarters: NYC URL: https://distrokid.com/ SALARY RANGE: €120,000 - €160,000 EUR/// £100,000 - £135,000 GBP annually LOCATION: Fully remote; open to candidates living in the UK/EUROPE ONLY SPONSORSHIP: NO; Not provided at this time, including after student visas expire. DistroKid is the world’s largest music distributor to Spotify, Apple, Google and more. Most new music today is released through DistroKid. Help us help millions of musicians be more prolific! 🎧Summary: With your excellent technical and leadership skills, you will lead engineers with technical expertise and a high level of emotional intelligence. As a Software Engineering Manager, you will lead by optimizing toward autonomy, ownership, accountability, empowerment, and the overall health of the team. You will guide a team of engineers on large-scale products and services while working closely with stakeholders to define product goals and priorities. As a manager, you will work with functional peers to set the strategy and mission for teams. You will direct a team and will often lead day-to-day work, the development of direct reports, and be responsible for the software architecture, quality, scalability, and delivery of work. You will help guide the creation, improvement, and growth of cutting-edge tools and products for musicians around the world, including our video distribution platform, instant mastering, and artist tools. You will forge the effort in pursuing our vision for artists to be prolific at any level. 🎸 Core Attributes: Set and communicate team priorities that support the broader organization's goals. Align strategy, processes, and managing across teams. Set clear expectations with team members based on their level and role and aligned with the goals of the organization on an extended scale. Meet regularly with direct reports to discuss performance and development, and provide feedback and coaching. Develop the long-term technical vision and roadmap within, and often beyond, the scope of your teams. Evolve the roadmap to meet anticipated future requirements and infrastructure needs. Oversee systems designs within the scope of the broader area, and review product or system development code to solve ambiguous problems. Review code developed by other engineers and provide feedback to ensure best practices. Passion for technology (e.g., personal projects, open-source involvement). Show clear communication within the organization and teams. Strategize with senior leaders across multiple functions within the organization. Enthusiasm for music! 🎵 Qualifications We're Looking For: Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field or equivalent work experience 3+ years of engineering team management experience, Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field or equivalent work experience 7+ years of working directly within engineering teams 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience Experience partnering with product or program management teams. Strong software development skills in JavaScript, Node.js, SQL, CSS, HTML, and languages such as Java, PHP, Python, or similar. Strong understanding of cloud environments and toolchains. Strong written and oral communication skills. Desire to work in a diverse team Knowledge and operational experience in developing and scaling event-driven services. Understanding of full-stack software development. Hands-on experience with Agile and Scrum software development methodologies. 🎶 Why Join Us? At DistroKid, we’re all about empowering artists and fostering a culture where our team members can rock out in their own way. Enjoy a remote work environment, a culture that puts employees first, and competitive benefits. If you're ready to join a company that’s making waves in the music industry and guide our tech team, apply now! 🎵 DistroKid is an Equal Opportunity Employer🎵 We are committed to building a diverse and inclusive team and strongly encourage applications from individuals of all backgrounds, identities, and experiences. We value a wide range of perspectives and believe that our differences make us stronger. If you require any accommodations during the application process, please don't hesitate to reach out. To apply: https://weworkremotely.com/remote-jobs/distrokid-software-engineering-manager-1",
    "url": "https://weworkremotely.com/remote-jobs/distrokid-software-engineering-manager-1",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 17:01:47 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "python",
      "java",
      "javascript",
      "node.js",
      "cloud",
      "php",
      "sql"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Client Success Manager",
    "company": "ALM Corp",
    "location": "Remote",
    "description": "Headquarters: Toronto URL: https://www.almcorp.com The Client Success Manager at ALM Corp plays a critical role in driving client satisfaction, success, and retention . This position is responsible for managing client relationships, identifying growth opportunities, resolving concerns, and collaborating with cross-functional teams to improve processes and outcomes. You will serve as the main point of contact for key accounts, ensuring client needs are met and exceeded. Key Responsibilities: 🧭 Client Satisfaction & Retention Monitor and improve client satisfaction scores with a target of 90%+ promoter bracket. Respond promptly to client feedback, concerns, and escalations—aiming for resolution within 24 hours. Proactively implement initiatives to increase client retention and reduce churn. Act as the client advocate internally, ensuring their voice is heard and needs are addressed. 🤝 Relationship Management & Growth Develop strong, long-lasting relationships with key clients through regular check-ins, strategic reviews, and value-driven communication. Identify upsell and cross-sell opportunities aligned with client goals and work with the Sales team to act on them. Drive client renewals by demonstrating measurable value and consistent performance. 🔄 Cross-functional Collaboration Work closely with internal teams (Sales, Project Management, SEO, Paid Media, Web Development, and Strategy) to align on deliverables and timelines. Facilitate internal communication on client feedback, expectations, and areas for improvement. Lead quarterly interdepartmental reviews to enhance workflows. 📊 Data Analysis & Reporting Analyze client feedback and performance data to identify trends, gaps, and improvement opportunities. Prepare monthly performance reports with actionable insights for both internal use and client presentation. Manage Net Promoter Score (NPS) tracking and analysis across accounts. Key Performance Indicators (KPIs): ✔ Client Satisfaction Maintain a satisfaction score of 90% or higher; aim for the majority of clients to be in the promoter category. Achieve a 95%+ resolution rate for client escalations within 24 hours. Show year-over-year improvement in client retention, renewal, and escalation metrics. ✔ Process Improvement Identify and propose process improvements annually with measurable impacts. Lead or participate in quarterly collaboration sessions to enhance internal workflows. ✔ Revenue Growth Increase average Client Lifetime Value in the first 12 months. Support revenue expansion through client account growth and new opportunity identification. ✔ Reporting & Feedback Deliver comprehensive monthly client performance reports. Conduct quarterly feedback sessions with clients, documenting key insights and action items. To apply: https://weworkremotely.com/remote-jobs/alm-corp-client-success-manager",
    "url": "https://weworkremotely.com/remote-jobs/alm-corp-client-success-manager",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 14:04:25 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Account Executive",
    "company": "Yoko Co",
    "location": "Remote",
    "description": "Headquarters: McLean, VA URL: https://www.yokoco.com/ A sales role with purpose. At Yoko Co, we believe your work should mean something. That’s why we partner exclusively with organizations working to make a positive impact in the world—whether that’s saving lives, protecting the planet, educating future leaders, or supporting underserved communities. We’re looking for an Account Executive who thrives on meaningful connection, understands digital strategy, and is motivated by closing deals and opening doors to doing more good in the world. Why work at Yoko Co? Do good, better: We exclusively serve clients who make a positive impact on the world. This is your chance to build things that help create a better place for all of us. 4-day work week and lots of holidays. Mondays are flex days, meaning you’re free to take them off if you’re caught up on your work. Plus, we’re closed for nearly a full week at Thanksgiving (November), and two weeks at the end of the year, plus a bunch of other days, too. Work-life balance FTW! High performance, no jerks. You’ll collaborate with good people who believe in doing great work. Best Place to Work (and that’s not just our opinion). We’ve been named a Best Place to Work by the Inc. 5000 and Washington Business Journal. About the Role: As an Account Executive at Yoko Co, you’ll lead the charge in connecting mission-driven organizations with digital solutions that amplify their impact. From prospecting to proposals, you’ll own the sales cycle—and play a key role in growing our reach and deepening our purpose. What You’ll Do: Build authentic, lasting relationships with mission-driven organizations through proactive outreach, networking, and follow-ups. Own the full sales cycle: identify opportunities, lead discovery calls, deliver tailored presentations, and close contracts. Serve as the front line of screening and alignment to ensure prospective clients are a fit for our culture, capabilities, and cause. Collaborate with marketing and leadership to optimize our go-to-market strategies. Maintain up to date records in our CRM to ensure transparency, accuracy, and accountability across the sales pipeline. Contribute to internal knowledge sharing and continuously improve the sales process. Occasionally help support other team member sales conversations or initiatives and paperwork for new and existing clients. You’ll Succeed in This Role If You: Have at least 3+ years of experience selling digital services (websites, digital strategy, marketing, or related)—ideally within an agency. Have significant experience with WordPress. Are energized by people and love discovering what makes them (and their missions) tick. Can guide strategic conversations and clearly explain complex digital solutions to both executives and technical stakeholders. Are naturally proactive—spotting opportunities, solving problems, and taking initiative is your default mode. Communicate clearly and empathetically—whether by email, Zoom, or in a room full of execs. Are deeply organized, know your way around a CRM, and thrive when juggling multiple accounts and timelines. Bonus Points For: Experience selling in nonprofit, association, or purpose-driven industries. Familiarity with CRM platforms. Active participation in professional networks, councils, or mission-aligned communities. Culture Fit: This role is for someone who’s excited by the thrill of the chase and the meaning behind the mission. You’ll need to be a self-starter, team player, and someone who’s not afraid to get a little scrappy when the moment calls for it. We don’t do egos here—we do empathy, excellence, and impact. However, maybe don’t apply if: You prefer opportunities to come to you. Sure, some of that will happen, but as the saying goes, fortune helps those who help themselves. Regular outreach and networking are a non-negotiable part of this position. You’re the kind of person who says, “that’s not my job” or “that’s below my pay grade.” While we try to utilize everyone in the best way possible, sometimes it’s more important to roll up your sleeves and prove you’re a part of a team. You’d rather wait for someone to tell you what to do. The interview process: You’ll do 3-4 interviews with various team members, starting with a short culture interview, and then moving on to more specialized conversations. Somewhere in the middle of the process, you’ll likely do a short practical assessment to ensure you can deliver at the level it takes to be successful here. If you work here: You’ll get a competitive salary, unlimited time off, a flexible schedule, the ability to work wherever you want, a personal development budget, federal holidays, and multiple weeks off at the end of the year to recharge. We also provide profit sharing to everyone on the team. If you’re in the US, we offer health insurance, disability and life insurance, and 401k matching. A little more about us: We’re a group of people who are passionate about the work we do, the clients we serve, and improving our craft. We also care about each other — we don’t think of one another as coworkers or employees, but as fellow humans. From developers to designers, project managers to strategists, we bring out the best in each other. We’ve been in business for over a decade, our whole team is remote, and we’ve been named a Best Place to Work by the Inc. 5000 and the Washington Business Journal. To apply: If you’re interested, fill out our application form . (An actual human from our team looks at every submission. P.S. – We encourage you to include a video message! ) To apply: https://weworkremotely.com/remote-jobs/yoko-co-account-executive",
    "url": "https://weworkremotely.com/remote-jobs/yoko-co-account-executive",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 13:37:58 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Senior Full Stack Engineer",
    "company": "SIGMA Assessment Systems",
    "location": "Remote",
    "description": "Headquarters: London, ON Canada URL: https://sigmaassessmentsystems.com Summary of Position SIGMA Assessment Systems is seeking a Senior Full-Stack Engineer to help us develop our next-generation assessment platform for administering high-stakes psychometric/psychological testing to support organizations with selection, placement, planning and development decisions. The ideal candidate has experience contributing to large-scale software platforms from design to development. In this role, you will be working closely with a related business and our agency partner over several phases of the project as well as our Product Manager. This is an exciting opportunity as this team is newly forming – become a founding member of our development team and help shape it! Your initial focus will be to get up to speed on our next-generation platform, provide input to refine our development pipeline and assist in the planning and execution of an assessment authoring platform. Key Responsibilities of Position The successful candidate will: Have experience designing and developing large-scale platforms used by thousands of users, with a focus on writing highly performant code and ensuring high-stakes accuracy Participate in and contribute to the day-to-day development process Collaborate with cross-functional teams to understand our clients and the value our product strives to deliver Collaborate with our external agency developers to ensure code quality and consistent high-quality execution Deliver high-quality code even under tight timelines, while ensuring consistency by writing tests to maintain code quality Participate in code reviews, help estimate work and define tools and frameworks Proactively contribute to continuous improvement, integration speed, developer productivity, release velocity and quality Ensure the software is rigorously tested for performance, reliability, and scalability under different conditions. Understand when and how to execute various types of performance testing: speed, load/volume and scalability testing – using appropriate tools Develop and maintain comprehensive documentation for software and systems Collaborate with our QA Lead to troubleshoot bugs, prioritize issues and implement solutions The successful candidate possesses knowledge and interest in: Ticket tracking and documentation tools such as Jira, Notion, and Wrike, and internal communication platforms like Slack and Teams Python, Django, Javascript, and React with a strong understanding of object-oriented programming principles and scripting Extensive experience designing and developing API architecture using RESTful APIs or GraphQL endpoints Extensive experience with PostgreSQL , including database design, schema creation and ensuring database performance, scalability and security Experience designing and developing micro-services Azure services: servers, storage, functions, DevOps Familiar with DevOps practices Github Linux Qualifications and Requirements Bachelor's degree in computer science, or a related field, or combination of equivalent training and experience Five or more years as a software engineer Organizational and time management skills, with attention to detail and accuracy Self-development skills to keep current English proficiency, written and oral Hours and Compensation This is a full-time permanent position with the expectation of 37.5 hours per week. SIGMA offers competitive salaries, vacation time with additional time off the last week of December for the holiday season, a health spending reimbursement account, and flexible working hours to all employees. This position offers room for advancement and promotion as we continue to grow, limited only by your drive and abilities. What Makes SIGMA a Great Place to Work We hire smart, effective, and kind people. We treat them well and pay them fairly. Many of our employees have been with us for more than 15 years, and most have advanced degrees A respectful and professional environment where your input is valued We’re family-friendly and provide an excellent work-life balance Time off during the winter holiday break Our Hiring Philosophy & AI At SIGMA, we're a small, close-knit team that values cultural fit and alignment with our core values. We embrace the latest technology, including AI, to enhance our workflows—not to replace the thoughtful human judgment and skills we've honed. Currently, every resume is personally reviewed by our Product Manager. We understand the current hiring landscape can be challenging, but if you're genuinely interested in this role, please make that evident in your application. Show us you're not a bot—share what drew you to this position and demonstrate that you took the time to read and consider this opportunity. We have zero tolerance for candidates who rely solely on AI during our selection process, and cannot authentically showcase their technical skills or personality without its assistance. To apply: https://weworkremotely.com/remote-jobs/sigma-assessment-systems-senior-full-stack-engineer-2",
    "url": "https://weworkremotely.com/remote-jobs/sigma-assessment-systems-senior-full-stack-engineer-2",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 13:17:00 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "python",
      "java",
      "javascript",
      "react",
      "full stack",
      "devops",
      "sql",
      "django"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "MS Dynamics CRM Technical Architect/ Project Lead",
    "company": "Hitachi Solutions",
    "location": "Remote",
    "description": "Headquarters: Pune, India URL: http://hitachi-solutions.com Company Description Hitachi Solutions is a core IT Company of the Hitachi Group, which employs over 330,000 people worldwide. Headquartered in Tokyo, Japan, Hitachi Solutions' reach extends to group companies in Japan and abroad, working with a worldwide network of alliance partners. Through systems integration, we strive to provide ideal solutions and products to customers in a diverse set of countries and regions including Asia, North America and Europe. Using a portfolio of management consulting, implementation, and support services, we help our clients compete with the largest global enterprises leveraging powerful, affordable, and easy to use industry solutions built on Microsoft technologies. Our vision is to help you achieve your vision through superior products, prices, and people. We pride ourselves on the creativity and success of our employees. Hitachi Solutions has experienced phenomenal growth in recent years and has maintained a relaxed and open culture throughout, with an emphasis on diversity and the development of our people. We aim to be the best IT consulting company globally. This will be achieved by continuing to invest in talented and motivated people and building long term relationships with our customers. Job Description Exp: 8+ Years Primary Skills: Microsoft Dynamics CRM, D365, C#, ASP.NET, Scripting, Azure, C#, OOPS, Team/Project Lead Job Description and Responsibilities: · Understand functional design and provide a technical architecture that will meet functional design · Ability to read a software requirement and produce a technical specification. · Ensure that there are complete unit tests for every component or task. · Develop required functionality and feature by coding on .Net platform & Internal Framework. · Review code and ensure it conforms to standards. · Help improve quality of existing code base · Ensure project is complete according to written specifications. Communication and Teamwork. · Follow best practices while coding [.NET & Microsoft Dynamics CRM]. · Ensure that code is scalable for high performance scenarios Qualifications Professional Attributes : Min 6 to 8 years in MS CRM or Dynamics 365 Experience in leading 1 or more projects and teams , responsible for delivery, Exp in Managing client communication and delegating tasks and responsibilities to appropriate personnel · Educational qualification: BE/MCA or equivalent degree in computer science · Atleast 2 years’ experience of developing solutions on Microsoft Dynamics CRM . Should able to lead team and project. · Strong understanding of the CRM Platform (Scripting, Plugins, Workflows, Dialogs, Client Extensions, SDK) · Good understanding on D365 with working experience. . Good Understanding on Power Apps, Good understanding on PCF Controls · Good understanding of CRM Functional Modules · Knowledge in Field Service and Project Service. . Strong knowledge on Azure tools like Azure DeVops, Azure Functions, Azure Service Bus, CICD Pipeline etc. · Good understanding of SSRS and CRM Reports · Strong and proved ASP.NET programming using C# (MVC, Web API) ;database concepts; OO analysis and design under SDLC environment. Additional Information Strong knowledge of web based Technologies and client-side scripting using Javascript. · Development/Installation experience on an IFD environment is a plus. · Knowledge of Javascript framework like AngularJS/KnockoutJS is a Plus. · Knowledge on Azure tools and technologies is a plus. · Working Knowledge of Portal with advanced customization is a plus. Beware of scams Our recruiting team may communicate with candidates via our @hitachisolutions.com domain email address and/or via our SmartRecruiters (Applicant Tracking System) [email protected] domain email address regarding your application and interview requests. All offers will originate from our @hitachisolutions.com domain email address. If you receive an offer or information from someone purporting to be an employee of Hitachi Solutions from any other domain, it may not be legitimate. To apply: https://weworkremotely.com/remote-jobs/hitachi-solutions-ms-dynamics-crm-technical-architect-project-lead",
    "url": "https://weworkremotely.com/remote-jobs/hitachi-solutions-ms-dynamics-crm-technical-architect-project-lead",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 10:19:16 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "javascript",
      "devops",
      "angular"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Staff Technical Lead",
    "company": "HubSpot",
    "location": "Remote",
    "description": "Headquarters: - USA URL: http://hubspot.com POS-26269 The CRM data visualization group is responsible for helping CRM customers visualize and act on their data. The staff software engineer will work on the GraphQL platform team which is the core system of CRM that allows for high-performance data querying and visualization, supporting CRM customers in analyzing and leveraging their data effectively. You will help improve the usability and scalability of the platform to meet Hubspot’s growth needs for both internal and external customers and also design/implement new features. About the Role We are looking for a staff engineer who has identified and delivered projects with meaningful business and/or technical impact at the product group level. This candidate should have experience working with Generative AI. This candidate should have a clear history of solving hard, impactful problems with little guidance. They move across domains effortlessly, challenging conventions and what is possible by reexamining constraints. They are trusted with complex business and technical challenges that require collaboration, technical mastery, and technical leadership. They should have a significant impact on the success and technical strategy of any team they are part of. Additionally, they are often asked to move into an unknown area and quickly make progress. They work in concert with leadership to identify and define large, impactful initiatives that they will drive. Key Expectations Staff Software Engineers are highly productive, impactful, and trusted engineers who leverage their skills and knowledge to work autonomously on complex projects and help set technical direction. Complex problems can include those that are exceptionally broad, deep, novel, or challenging to solve. They have a history of developing solutions to problems that have had an outsized impact on their team and product group’s business goals. They solve hard problems in multiple product areas or technical domains, rapidly delivering software solutions that are simple, practical, and easy for teams to adopt and use. They help push technologies and best practices forward to improve the HubSpot ecosystem. They regularly mentor and teach engineers in their areas of expertise, and look for opportunities to scale their technical influence They are expected to model our Engineering Leadership Mission Cash compensation range: 229800-344700 USD Annually This resource will help guide how we recommend thinking about the range you see. Learn more about HubSpot’s compensation philosophy . The cash compensation above includes base salary, on-target commission for employees in eligible roles, and annual bonus targets under HubSpot’s bonus plan for eligible roles. In addition to cash compensation, some roles are eligible to participate in HubSpot’s equity plan to receive restricted stock units (RSUs). Some roles may also be eligible for overtime pay. Individual compensation packages are based on a few different factors unique to each candidate, including their skills, experience, qualifications and other job-related reasons. We know that benefits are also an important piece of your total compensation package. To learn more about what’s included in total compensation, check out some of the benefits and perks HubSpot offers to help employees grow better. At HubSpot, fair compensation practices isn’t just about checking off the box for legal compliance. It’s about living out our value of transparency with our employees, candidates, and community. We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates, so please don’t hesitate to apply — we’d love to hear from you. If you need accommodations or assistance due to a disability, please reach out to us using this form . This information will be treated as confidential and used only for the purpose of determining an appropriate accommodation for the interview process. At HubSpot, we value both flexibility and connection. Whether you’re a Remote employee or work from the Office, we want you to start your journey here by building strong connections with your team and peers. If you are joining our Engineering team, you will be required to attend a regional HubSpot office for in-person onboarding. If you join our broader Product team, you’ll also attend other in-person events such as your Product Group Summit and other gatherings to continue building on those connections. If you require an accommodation due to travel limitations or other reasons, please inform your recruiter during the hiring process. We are committed to supporting candidates who may need alternative arrangements Germany Applicants: (m/f/d) - link to HubSpot's Career Diversity page here . India Applicants: link to HubSpot India's equal opportunity policy here . About HubSpot HubSpot (NYSE: HUBS) is a leading customer relationship management (CRM) platform that provides software and support to help businesses grow better. We build marketing, sales, service, and website management products that start free and scale to meet our customers’ needs at any stage of growth. We’re also building a company culture that empowers people to do their best work. If that sounds like something you’d like to be part of, we’d love to hear from you. You can find out more about our company culture in the HubSpot Culture Code , which has more than 5M views, and learn about our commitment to creating a diverse and inclusive workplace , too. Thanks to the work of every employee globally, HubSpot was named the #2 Best Place to Work on Glassdoor in 2022 and has been recognized for its award-winning culture by Great Place to Work, Comparably, Fortune, Entrepreneur, Inc., and more. Headquartered in Cambridge, Massachusetts, HubSpot was founded in 2006. Today, thousands of employees across the globe work remotely and in HubSpot offices. Visit our careers website to learn more about the culture and opportunities at HubSpot. By submitting your application, you agree that HubSpot may collect your personal data for recruiting, global organization planning, and related purposes. HubSpot's Privacy Notice explains what personal information we may process, where we may process your personal information, our purposes for processing your personal information, and the rights you can exercise over HubSpot’s use of your personal information. To apply: https://weworkremotely.com/remote-jobs/hubspot-staff-technical-lead",
    "url": "https://weworkremotely.com/remote-jobs/hubspot-staff-technical-lead",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 10:19:16 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "SaaS Product Support Jedi (Remote, Americas)",
    "company": "Creative Force",
    "location": "Remote",
    "description": "Headquarters: Creative Force URL: https://www.creativeforce.team/ We’re looking for a tenacious, self-motivated and energetic people-person to help us support our growing client base in the Americas region. Our world-leading SaaS products have a steep learning curve so you’ll need to be a cool tech cucumber yet be amazing with humans. Empathy, patience, curiosity, humour, ability to multi-task and friendliness are key to success in this role. Role You will be part of a small but incredibly high-performing global team offering help to our B2B clients across two products (Award Force and Good Grants). You will communicate with colleagues and clients across countries, cultures and time zones on a daily basis. Our support is across email tickets, phone, live chat and 1-1 Zoom calls. Once trained, you will take up onboarding and run client meetings to help with issue resolution, best practices and product adoption. You’ll test and report bugs, put forth considered feedback to product teams; always seeking to improve our products. We play startup every now and then—new tools implemented as experiments and our processes are always evolving. You’ll be part of this too. If you have a great idea, let’s test it out! We’re not big on bureaucracy, only results. We don’t expect you to be a slave to your chair, but you will need to be flexible. Essentials You’re located anywhere in the Americas region (Central and Western timezones preferable) You are able to work as an independent contractor, responsible for your own insurance requirements, tax and 401k contributions Native English speaker (or 100% fluent), bi-lingual is a bonus! You have a natural aptitude with technology, experience with SaaS and are able to learn (and use) new systems quickly Words like HTML, CSS, JS, API, Integrations, Dev console, staging & production environments, GitHub repo, database queries etc are not alien to you. You don't need to know how to work them but you must know about them (well enough) You have fantastic interpersonal skills and are an excellent communicator, verbal and written You love to talk to clients. Four-five meetings a day only makes you more energetic! You love solving problems and helping others solve theirs You write in well constructed sentences and pay attention to detail You’re curious, and love learning You are not shy to upsell or answer “sales-y” questions You’re super organised and process oriented. You are comfortable using multiple software for various aspects of the role. We have a process for everything! You have the ability to communicate complex issues in plain language You can work independently, are self-motivated, but enjoy being part of a team Working remotely suits you perfectly, your natural work ethic makes you a high performer! You are flexible to attend team meetings outside of usual working hours on scheduled days You have access to fast, reliable internet and a dedicated space to work without distractions Responsibilities Product support Self-driven learning to become a product expert Be the first port of call on all inbound support queries via email/tickets, phone and (later) chat Run 1-1 Zoom calls with clients to help resolve queries and provide technical consultation Provide technically accurate responses after carefully testing necessary scenarios Work with the engineering team to resolve bugs and follow through with updates Be amazing with clients Respond quickly (we’re big on speed) Able to really listen to people, get to the heart of the issue and see it through to resolution Convey appreciation and respect to our clients at all times Strive to build trusting relationships based on honesty and transparency With an aim of 100% retention, proactively reach out to suggest improvements To apply: https://weworkremotely.com/remote-jobs/creative-force-saas-product-support-jedi-remote-americas-1",
    "url": "https://weworkremotely.com/remote-jobs/creative-force-saas-product-support-jedi-remote-americas-1",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 09:32:33 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Senior Full Stack Developer",
    "company": "AuthentifyIt",
    "location": "Remote",
    "description": "Headquarters: Brussels URL: https://authentifyit.com/ Job Title : Senior Full Stack Developer Company : AuthentifyIt Location : Remote, EU-based (Full-Time) Hours : Monday to Friday, 9 am–5 pm BST Salary: €60,000- €100,000, Depending on experience About Us: AuthentifyIt is a pioneering Web3 company on a mission to revolutionise how objects are authenticated and connected to digital experiences. We're building a secure, innovative platform that bridges the physical and digital worlds — and we’re looking for a talented Senior Full Stack Developer to join our team. With incredible traction in the market to date, we are looking for the right person to help progress our mission. The Role: We're seeking a highly skilled and experienced Full Stack Developer who is proficient in both frontend and backend development. You’ll play a key role in building and scaling our Web3-enabled platform using modern web technologies. You will work closely with the product officer and key stakeholders to ensure we continue to roll out a high scale web application to some of the biggest brands in the world. Tech Stack & Requirements: Expertise in: Vue.js Next.js Nuxt.js Node.js React Tailwind CSS Mongo DB Bonus skills: DevOps experience Web3 and blockchain knowledge Experience working on high scale applications Proven ability to work independently and as part of a remote team Strong communication skills in English, Bonus if you can speak French as well What You'll Do: Design, develop, and maintain scalable web applications Collaborate with designers, engineers, and stakeholders to define and implement features Integrate technologies to authenticate and enrich physical objects with digital experiences Optimise applications for speed and scalability Contribute to a positive, productive, and remote-friendly team culture Assist the team to create full load test scenarios Work with QA’s to address and resolve bugs What We Offer: Fully remote work environment Competitive pay Opportunity to work on cutting-edge Web3 projects A collaborative, innovative, and mission-driven team Flexible, startup-style culture Ready to build the future with us? To apply: https://weworkremotely.com/remote-jobs/authentifyit-senior-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/authentifyit-senior-full-stack-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 09:18:01 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "react",
      "node.js",
      "backend",
      "frontend",
      "full stack",
      "devops",
      "vue"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "SEO Technical Writer",
    "company": "GemBox",
    "location": "Remote",
    "description": "Headquarters: Zagreb, Croatia URL: https://www.gemboxsoftware.com/ GemBox is a small software company specialized in fast and easy-to-use .NET components. Our components are used by more than 7000 companies worldwide for processing Excel, Word, Powerpoint, PDF, and image files. The team is fully remote and made of highly skilled software developers from Croatia, Slovakia, Turkey, and Brazil. We use Kanban framework, prefer documentation over chat, and aim for async communication. You can learn more about the way we work by checking our public company manual . About the job We are looking for a talented SEO technical writer to join us and help us create engaging and SEO-optimized content that educates our audience and converts visitors into customers. Responsibilities: Research and write new articles, examples, and blogs targeting domain specific keywords. Track and optimize existing content. Make sure that the content is well optimized for search engines. Stay updated on SEO trends and competition. Customer sales support. Requirements: Excellent English language skills, both written and spoken, with ability to explain technical topics in simple and engaging manner. At least 2 years of content writing experience. Strong understanding of SEO best practices and keyword research. Basic software programming knowledge. Preferably C# or VB.NET, but any other object-oriented programming language is also acceptable. Basic image editing skills like taking screenshots, resizing and cropping images. Excellent research skills and attention to detail. Ability to manage multiple projects simultaneously. Benefits: Salary from $30,000 to $60,000 USD per year Fully remote with flexible working hours Covered coworking space costs Covered work-related education costs 24 days of paid vacation Paid public holidays based on your location Paid sick leave Paid special leave, including parental leave How to apply? We have a structured hiring process composed of following steps: You take an online test to assess your skills. It takes around an hour and includes 15 questions ranging from English comprehension to basic technical skills. If you pass the test, you will get an invitation to a video interview with our team lead. If all goes well, we will send you a job offer. If you are ready, click on the Apply button below to start the test. To apply: https://weworkremotely.com/remote-jobs/gembox-seo-technical-writer",
    "url": "https://weworkremotely.com/remote-jobs/gembox-seo-technical-writer",
    "source": "WeWorkRemotely",
    "posted_at": "Wed, 23 Apr 2025 06:35:14 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Web Developer (WordPress-specific)",
    "company": "Wildlabs",
    "location": "Remote",
    "description": "Headquarters: Auckland URL: http://wildlabs.co Hi! We are Wildlabs , a design and technology studio based in Auckland, New Zealand. We are a team of 8, some of us are based in Auckland, some are remote. We are looking for a passionate web developer (focusing on WordPress) with at least 3 years of commercial experience, ideally in a web agency/studio environment. This role is more specific to WordPress development, as a significant number of our projects are WordPress. We do not work with off-the-shelf site builders (Elementor etc), we build custom themes based on ACF / https://roots.io/ (composer-based) approaches. There is an opportunity to also work on other PHP-based projects we have (Laravel/Statamic based typically). The ideal candidate will: be experienced in CLEAN and high-quality WordPress development (not throwing together 50 plugins) be experienced with WooCommerce and its plugins understand more complex systems based on WP with various integrations be OK with occasional requirement of taking over WP projects from other agencies, where things can be more chaotic than we aim to do, cleaning them up etc (this is rare, and not our priority, but occasionally happens) ideally have an eye for design and details like spacing, typography, and overall appreciation of good visual design have experience with Vue or React, based on solid knowledge of vanilla JS have good base knowledge of semantic HTML, accessibility best practices know performance pitfalls and cross-browser/cross-device best practices know modern CSS and pre-processors, BEM methodology have knowledge of SEO technical best practices (Open Graph, JSONLD etc) strive to improve, learn and write clean and reusable code overlap with our NZT +12 timezone for at least 2-3 normal office hours every working day Bonus points (not a requirement for this role, but nice to have): have a good feeling of timings / animations and subtle micro-interactions PHP in advanced capacity experience with Laravel and/or Statamic animation platforms (gsap or similar) basic DevOps skills (AWS services) If you don’t have all the above, but have most of them and are ready to learn, feel free to apply! From our end: interesting, creative, and challenging projects technical project managers new tech, ability to experiment with things Overseas candidates will be considered full-time contractors by New Zealand law. Please only apply if you are able to provide examples of your work, and describe what exactly you were working on. IMPORTANT: We are aiming to reply to all applicants, but due to the large number of applications, we might only reply to the most suitable candidates for the role. Please do not be offended if you do not hear from us. No recruiters, HR agencies, or “developer resellers” please. To apply: https://weworkremotely.com/remote-jobs/wildlabs-web-developer-wordpress-specific",
    "url": "https://weworkremotely.com/remote-jobs/wildlabs-web-developer-wordpress-specific",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 21:57:02 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "react",
      "aws",
      "devops",
      "php",
      "vue"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Direct Response Copywriter (Meta Ads Creative Specialist)",
    "company": "SENSIC",
    "location": "Remote",
    "description": "Headquarters: Gold Coast, Australia URL: http://sensicdigital.com Direct Response Copywriter (Meta Ads Creative Specialist) Fully Remote | Shape Minds. Drive Revenue. Master Meta. Are you more than a copywriter? Are you a conversion strategist—someone who doesn’t just write ads but builds persuasive machines that turn attention into action? Do you obsess over hooks that bite, VSLs that sell, and angles that scale? If you thrive on performance, live for creative testing, and speak fluent Meta Ads, this might be your next big play. About SENSIC Digital We’re a fast-growing, performance-first team of marketers, creatives, and growth hackers helping eCommerce brands scale fast through the power of great ads. Our clients are hungry for growth, and your words will help them get it. Think of us as the engine room of online sales succes:; strategic, data-driven, and relentlessly focused on results. Your Mission As our Meta Ads Copy & Creative Specialist, your job is simple: turn ideas into revenue. You'll build high-performing ad creatives that dominate Meta platforms - driving scale, ROAS, and momentum. You’ll shape narratives, test relentlessly, and turn scrolls into clicks and clicks into conversions. What You'll Own ✍️ Write world-class ad copy for Meta placements (image, video, carousel, etc.) that cuts through the noise and converts. 🧠 Craft irresistible hooks and angles, testing variations to find out what really moves the needle. 🎥 Script compelling Video Sales Letters (VSLs) that sell without sounding like they’re trying to. 🖼️ Collaborate with visual creatives to align copy and design into conversion-optimised assets. 📈 Analyse performance data and turn insights into sharper, stronger iterations. 🧪 Launch and optimise creative tests, owning every step from ideation to post-campaign analysis. 🔎 Stay obsessed with the craft, following trends in Meta creative and direct response advertising to keep us ahead of the curve. What You Bring ✅ A track record of Meta Ads campaigns that generated real results. ✅ Deep knowledge of direct response and performance psychology. ✅ Experience crafting and testing multiple copy variants (headlines, CTAs, primary text). ✅ Comfort with scripting long-form VSLs that hold attention and drive action. ✅ Working knowledge of Meta Ads Manager and how creative fits into the broader ecosystem. ✅ Strong writing, editing, and creative thinking skills. ✅ A data-first mindset and a drive to win. ✅ Hunger to own your outcomes in a fast-paced, remote-first team. Bonus Points If You... Have worked on landing and product pages, conversion rate optimisation, AB testing and other website copy projects. Have a solid grasp of design fundamentals or cross-functional creative workflows. Know the eCommerce game inside out (especially in health, wellness, or consumer products). Why Join Us Fully Remote: Work from wherever you do your best thinking. High Impact: Your work directly drives growth—we’ll show you the numbers. Growth-Obsessed Culture: Learn, iterate, and get better every week. Real Collaboration: No silos, just great people building great things. Autonomy with Accountability: Own your work, and make it matter. Ready to Write Ads That Actually Work? If you're a performance copywriter who lives and breathes Meta Ads, we want to hear from you. Apply with your resume and a portfolio that proves your impact- especially ad campaigns, VSLs, or test results where your creative drove real wins. Let’s build something powerful together. SENSIC Digital We’re committed to creating an inclusive, diverse environment. We welcome applicants from all backgrounds. To apply: https://weworkremotely.com/remote-jobs/sensic-direct-response-copywriter-meta-ads-creative-specialist",
    "url": "https://weworkremotely.com/remote-jobs/sensic-direct-response-copywriter-meta-ads-creative-specialist",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 21:47:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Webflow Developer",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a skilled Webflow Developer to help bring our brand to life online. You’ll be responsible for designing and building responsive Webflow templates that look great and perform even better. Your work will directly impact how users experience our site by making it fast, polished, and on-brand. What You’ll Do Design and develop responsive Webflow templates that align with our visual and functional goals Work closely with the design team to translate concepts into cohesive, high-quality layouts Optimize for performance, responsiveness, and scalability across all devices Troubleshoot and resolve Webflow-related issues efficiently Keep clear, up-to-date documentation of development workflows and best practices To apply: https://weworkremotely.com/remote-jobs/contra-webflow-developer-4",
    "url": "https://weworkremotely.com/remote-jobs/contra-webflow-developer-4",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:30:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Short Form Video Editor",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a skilled freelance video editor to create two short video edits that showcase our visual designs, marketing campaigns, and client logos. These videos will be used to elevate our brand presence across various platforms. The videos will be entirely visual, with no sound needed. All necessary assets and metrics will be provided. We only require the final MP4 file, no open project files. Deliverables Short video edit (max. 10 seconds) in a loop that features visual designs and marketing campaigns as well as 6 client logos (16:9) Short video edit (max. 15 seconds) that focuses on featuring metrics and campaigns (9:16) To apply: https://weworkremotely.com/remote-jobs/contra-short-form-video-editor",
    "url": "https://weworkremotely.com/remote-jobs/contra-short-form-video-editor",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:29:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Brand Designer",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a visionary Brand Designer to help shape our visual identity and bring our brand to life across every touchpoint. If you’re a creative thinker with a strong design aesthetic and a passion for storytelling — we’d love to connect! What You’ll Do: Design visual assets that reflect and evolve Contra’s brand identity Collaborate with Marketing, Product, and Community teams to create high-impact visuals for campaigns, content, and social Develop design systems, templates, and guidelines to ensure brand consistency Create presentations, landing pages, and branded content for internal and external use Translate complex ideas into clear, compelling visuals Elevate the look and feel of Contra’s brand with a clean, modern aesthetic Skills: Strong understanding of brand systems and visual storytelling Typography, layout, and composition expertise Experience creating digital and print assets (social, decks, web, etc.) Ability to interpret and execute on creative briefs Excellent communication and collaboration skills Detail-oriented with a sharp eye for consistency and polish Bonus Points If You Have: Experience working with early-stage startups or marketplace platforms Motion design or animation skills (After Effects, Lottie, etc.) Photography, illustration, or other creative skills Previous work on product marketing, brand refreshes, or rebrands To apply: https://weworkremotely.com/remote-jobs/contra-brand-designer-4",
    "url": "https://weworkremotely.com/remote-jobs/contra-brand-designer-4",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:28:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Google Ad Strategist",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We're looking for a Google Ads Strategist to help us scale paid acquisition and optimize performance across our key funnels. If you’re a data-savvy marketer who knows how to build, test, and optimize high-performing Google Ads campaigns — we want to hear from you! What You’ll Do: Own and manage all Google Ads campaigns (Search, Display, YouTube) Develop data-driven strategies to optimize performance and improve ROI Research and target high-intent keywords aligned with Contra’s ICP Build compelling ad copy and creatives (partnering with our brand team as needed) A/B test landing pages, copy, and CTAs to drive conversions Monitor and report on KPIs weekly, making proactive recommendations Stay on top of Google Ads trends, algorithm updates, and competitive benchmarks What We’re Looking For: 3+ years of experience managing Google Ads accounts (preferably for B2B or SaaS) Strong understanding of CPC, CPA, CTR, Quality Score, and conversion optimization Proven track record of driving measurable growth and lead acquisition Experience with Google Ads Manager, Google Analytics, Tag Manager, and Looker Studio Ability to work independently, move fast, and iterate based on results Excellent communication and reporting skills Bonus Points If You Have: Experience running YouTube video ads Familiarity with landing page builders like Webflow or Unbounce Knowledge of paid social platforms (Meta, LinkedIn) To apply: https://weworkremotely.com/remote-jobs/contra-google-ad-strategist",
    "url": "https://weworkremotely.com/remote-jobs/contra-google-ad-strategist",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:24:01 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Marketing Lead",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a creative, data-driven Marketing Lead to help us scale our impact and drive growth across all channels. About the Role: As Marketing Lead, you’ll be responsible for defining and executing Contra’s marketing strategy — from demand generation to brand awareness. You’ll work closely with Product, Community, and Growth teams to craft compelling campaigns that drive user acquisition and retention. What You’ll Do: Own and evolve Contra’s marketing strategy, aligning it with company goals Build and lead integrated marketing campaigns across digital, email, content, and social Partner with Product and Growth to launch features and run lifecycle campaigns Use data to optimize campaigns and track ROI across all marketing initiatives Develop and manage marketing budgets, forecasts, and KPIs Collaborate with external partners, freelancers, and creative agencies Build and nurture a marketing team over time What We’re Looking For: 5+ years of experience in marketing, ideally at a fast-growing startup or marketplace Proven track record of building and scaling multi-channel marketing strategies Strong analytical skills and experience with tools like Hubspot, Google Analytics, etc. Exceptional written and verbal communication skills Creative thinker with a bias toward action and experimentation Passionate about the future of work and empowering independent professionals Bonus Points: Experience in B2B SaaS or talent marketplaces Previous experience managing a small team or freelancers Familiarity with community-led growth strategies To apply: https://weworkremotely.com/remote-jobs/contra-marketing-lead",
    "url": "https://weworkremotely.com/remote-jobs/contra-marketing-lead",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:22:12 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Senior Front End Developer",
    "company": "Missive",
    "location": "Remote",
    "description": "Headquarters: Quebec city, Canada URL: https://missiveapp.com Missive is a complex app (collaborative email client), it's a challenging beast to master, but it's fun! What you'll achieve • Collaborate with product and design teams to implement new features from scratch using React and TypeScript. • Improve and modernize existing front-end code for performance, maintainability, and user experience. • Develop and maintain reusable UI components using Storybook. • Lead bug fixes and support related investigation (we are dealing with complex user interactions, you need to love edge cases) Must Have Skills • 5+ years of experience in all things related to what is listed in this job offer. • Deep React and TypeScript knowledge: Projects showcasing complex UI development, state management, performance optimization, and security best practices. • Thrives in a small, high-performing team, takes ownership, and learns new technologies independently. • Be obsessed with polished UIs, optimized code, and usability. Working at Missive We are passionate about our craft and committed to delivering exceptional results. We build with a clear focus on serving our customers. Creating the best possible product, in the end, is what truly matters. We ship with high quality and velocity, believing that it is not only rewarding but also a lot of fun. • Zero-ish meeting culture, allowing you to focus on what you do best. • Do more with less mentality. • Remote or/and in-office work options (HQ 👉 Quebec City, Canada). • Work closely with a team that recognizes the value of technical expertise. • Work with/for a product loved by its users. • Retreats. Compensation & Benefits The salary for this position depends on experience and qualifications within the range of CAD $125,000 to $175,000 annually. In addition to the base salary, we offer a comprehensive benefits package that includes insurance coverage, telemedicine, 5 weeks of vacation time, and other perks. How to Apply We welcome applications from candidates located in Europe and Americas. Start date is as soon as possible. Submit your resume to jobs@missiveapp.com. p.s. It's the age of AI. If you want an interview, you must stand out. Don't bother with a dissertation – we have no way to know if you actually wrote it or just used AI. In your email write a point-form list of your acheivements, with links to relevant content. To apply: https://weworkremotely.com/remote-jobs/missive-senior-front-end-developer",
    "url": "https://weworkremotely.com/remote-jobs/missive-senior-front-end-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 17:33:28 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "typescript",
      "react"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Remote C# .NET Developer (WinForms, Trading Platform)",
    "company": "Jigsaw Trading Limited",
    "location": "Remote",
    "description": "Headquarters: Hong Kong URL: http://www.jigsawtrading.com Location: Work-from-Home (Asia-based candidates only - we need you on our time zone) - and you if aren't but have a colleague in Asia - pass them the details! About Us: We’re a fast-moving fintech team building a high-performance trading platform that empowers traders worldwide. Based across Asia, we’re a small, collaborative group obsessed with bold ideas, clean code, and rigorous design to deliver real-time, low-latency solutions. We’re on the hunt for a brilliant mind—someone who can outthink our team, master our existing systems, and push our trading tech to new heights. The Role: We’re seeking an exceptional C# .NET Developer to join our remote Asia team, working on our WinForms-based trading platform powered by SQL Server Compact CE. You’ll dive into our existing codebase, quickly learn its intricacies, and extend it with performant, multi-threaded code while adhering to established design patterns. You’ll collaborate closely, rotating design and coding duties daily, and use AI tools to turbocharge development. If you’re a creative genius who can outsmart us and thrive in complex systems, we want you. What You’ll Do: Enhance and optimize WinForms UI for real-time trading, ensuring top-tier performance and responsiveness. Write highly performant, multi-threaded C# code, mastering thread-safe collections and avoiding pitfalls like deadlocks and race conditions. Manage data efficiently with SQL Server Compact CE for lean, local storage. Dive into existing systems, rapidly learning their architecture, workflows, and design patterns to extend and improve them. Co-create and review technical designs (e.g., UML, architecture docs), leading and contributing in a collaborative, rotating workflow. Leverage AI tools (e.g., GitHub Copilot, LLMs) to accelerate coding, debugging, and design innovation. Quickly adapt to new tools, APIs, or proprietary systems to tackle evolving challenges. Contribute to a trading platform with real-time market data, order execution, and financial algorithms. Who You Are: A brilliant problem-solver with 3–7 years of C# .NET Framework experience, including deep WinForms expertise. A multi-threading expert, with proven experience handling deadlocks, race conditions, and thread-safe collections (e.g., ConcurrentDictionary). Skilled with SQL Server Compact CE or similar embedded databases (SQL Server knowledge a plus). A master of OOP (SOLID principles, design patterns) who writes elegant, scalable code. Adept at working with existing systems, quickly learning their structure, and following established design patterns to maintain consistency. Comfortable crafting and critiquing technical designs, with a disciplined design-before-coding mindset. Experienced using AI tools (e.g., Copilot, ChatGPT) to boost productivity and innovate workflows. A quick learner who thrives on complex challenges and adapts to new tech effortlessly. Ideally experienced in trading platforms or fintech (e.g., low-latency systems, order matching). Young (25–35), energetic, and driven to outthink and outshine your peers. Based in Asia, with reliable internet for remote work. A clear communicator who excels in collaborative, idea-driven teams. Standout Qualities: You’ve mastered a complex legacy system and made it better, faster, or smarter. You’ve used AI to solve a tricky coding, design, or system integration problem in a way that surprised your team. You’ve led a project or design that redefined how your team approached a challenge. Bonus: Experience with .NET Core, APIs, or cloud (Azure/AWS), or open-source/personal projects that showcase your brilliance. Why Join Us? Work-from-home flexibility with a passionate, Asia-based team. A collaborative culture where everyone designs, codes, and challenges each other to innovate. A high-impact trading platform that traders rely on daily. Freedom to use AI and cutting-edge tools to redefine development speed and quality. A team that celebrates your ability to outthink us and elevate our systems to the next level. How to Apply: Send your resume, GitHub/LinkedIn profile, and a short note describing how you’ve outsmarted a tough technical challenge (e.g., multi-threading, system integration, or AI-driven solution) to hiring@jigsawtrading.com . Bonus points: Include a sample technical design, a code snippet showcasing multi-threading or system integration, or an example of how you used AI to innovate and reduce coding implementation times. Application Deadline: April 30th, 2025 Challenge Us: If you can outthink our team, master our systems, and build trading tech that blows us away, we want you. Apply now and show us what you’re capable of! To apply: https://weworkremotely.com/remote-jobs/jigsaw-trading-limited-remote-csharp-net-developer-winforms-trading-platform-exceptional-talent-wanted",
    "url": "https://weworkremotely.com/remote-jobs/jigsaw-trading-limited-remote-csharp-net-developer-winforms-trading-platform-exceptional-talent-wanted",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 15:04:43 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "aws",
      "cloud",
      "sql"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Senior Python Engineer",
    "company": "datashake.com",
    "location": "Remote",
    "description": "Headquarters: Lisbon, Portugal URL: https://datashake.com We're an established business with thousands of paying customers and a team of 20+ and are searching for a full-time Senior Python Engineer to help us build out our services. We're fully remote, with team members across the world. We generally work CET hours but are flexible as long as there's some overlap. You’ll be an important part of our early-stage team and work on several projects, internal frameworks, and micro-services. We are looking for someone who is excited about building out game-changing technologies that are used by software engineers, data scientists, quants, and data analysts all around the world. You're a proactive, sharp, and self-motivated individual who is eager to learn and take ownership of our products. You love communicating and working with others in your team toward success, taking us from where we are now to where we want to be! Being bootstrapped (not venture-backed) and fully remote, we don’t strive for growth at all costs and are building a company that we can be proud of, and enjoy working for. Our tech stack Python, FastAPI React Celery RabbitMQ and Kafka MySQL, Elasticsearch, Redis Github, CI/CD Docker, Kubernetes AWS Requirements Our ideal candidate has: Solid experience as a Python Engineer (5+ years) Solid experience building REST APIs using FastAPI framework Experience working with Elasticsearch Experience with containerization and orchestration with Docker and Kubernetes Experience in version control using Git Experience with CI/CD pipelines, automating builds, testing, and deployments Familiarity with caching mechanisms and in-memory data store technologies like Redis Familiarity with monitoring and observability tools like Grafana Familiarity with Amazon Web Services (AWS) Fluent English and excellent communication skills Nice to have: Experience in web scraping, parsing HTML/XML, and extracting structured data Experience creating products for developers, data engineers, and/or data consumers Experience with AI What you will do Design and implement robust and scalable engineering solutions Contribute to the development of internal tools and libraries that streamline content retrieval operations Participate in code reviews while fostering knowledge sharing within the team Develop and maintain CI/CD pipelines that automate testing and deployment of various applications What you will bring A passion for building elegant, maintainable code A proactive mindset and willingness to take initiative A collaborative spirit and strong communication skills Perks and Benefits Our team is fully remote and we communicate primarily through Slack, Linear, Notion, and a few weekly meetings via Google Meet - we believe the best work happens when given lots of uninterrupted time that's free of distractions. 💰 Salary range: $42,000 - $60,000 / year (USD, gross) 🌎 Work from anywhere 🏖️ 26 days paid time off 🏢 Co-work expenses covered (up to $300/m) 📗 $500/year learning budget 🖥️ $250 Desktop budget 🍉 $30 Wellness budget 💃 $30 Fun Budget If this sounds like a good fit, we’d love to hear from you! To apply: https://weworkremotely.com/remote-jobs/datashake-com-senior-python-engineer",
    "url": "https://weworkremotely.com/remote-jobs/datashake-com-senior-python-engineer",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 11:56:54 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "python",
      "react",
      "aws",
      "sql",
      "kubernetes",
      "docker"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Senior Sales Enablement Marketing Manager",
    "company": "Abridge",
    "location": "Remote",
    "description": "Headquarters: New York City-Hybrid URL: http://abridge.com Abridge was founded in 2018 with the mission of powering deeper understanding in healthcare. Our AI-powered platform was purpose-built for medical conversations, improving clinical documentation efficiencies while enabling clinicians to focus on what matters most—their patients. Our enterprise-grade technology transforms patient-clinician conversations into structured clinical notes in real-time, with deep EMR integrations. Powered by Linked Evidence and our purpose-built, auditable AI, we are the only company that maps AI-generated summaries to ground truth, helping providers quickly trust and verify the output. As pioneers in generative AI for healthcare, we are setting the industry standards for the responsible deployment of AI across health systems. We are a growing team of practicing MDs, AI scientists, PhDs, creatives, technologists, and engineers working together to empower people and make care make more sense. We have offices located in the SoHo neighborhood of New York, the Mission District in San Francisco, and Lawrenceville in Pittsburgh. The Role We are seeking a highly motivated and experienced Senior Sales Enablement Marketing Manager focusing on Commercial Enablement to join our dynamic team as we scale the most trusted AI solution for clinical conversations. This role is crucial for ensuring the success of our sales and partner success teams by providing the tools, resources, and support they need to effectively sell our AI technology solutions to enterprise healthcare systems. The ideal candidate will be highly cross-functional, organized, and capable of operationalizing and executing sales enablement strategies. This is a hybrid role in NYC with a weekly requirement of being in the office Tuesday-Wednesday-Thursday. What You’ll Do Commercial Enablement Strategy Develop and implement a comprehensive sales enablement strategy that aligns with commercial goals and objectives. Build out prioritization processes that enable sales teams to request sales assets and track progress in a central way. Track and analyze key performance metrics to measure the effectiveness of sales enablement initiatives and identify areas for improvement. Content Development Create and maintain enablement content, including sales playbooks, training materials, and product marketing collateral. Drive and execute on the development of customized presentations and proposals for the sales team. Partner with Revenue Operations to conduct regular training sessions and workshops for the sales team on product updates, sales techniques, and industry trends. Support onboarding programs for new sales hires to ensure rapid ramp-up and productivity. Cross-Functional Collaboration Work closely with sales, marketing, and product to ensure alignment and effective communication. Coordinate with subject matter experts to gather and disseminate relevant information to the sales team. Ensure all enablement materials are accurate, up-to-date, and aligned with the company’s messaging and brand standards. Manage multiple requests and projects simultaneously, maintaining a high level of organization and attention to detail. What You’ll Bring Minimum of 6-8 years of experience in sales enablement, preferably within the healthcare revenue cycle technology sector Strong understanding of enterprise healthcare systems and the purchasing committee within executive leadership teams. Proven ability to develop and execute commercial enablement strategies that drive results. Excellent communication and interpersonal skills, with the ability to collaborate effectively across departments with differing priorities. Exceptional organizational skills and the ability to manage multiple projects and deadlines simultaneously. Exception proficiency in sales enablement tools and slide-building. Strong analytical skills and attention to detail. An entrepreneurial spirit and proactive, resourceful mindset to drive innovation and continually improve sales processes. Why work at Abridge? At Abridge, we’re driven by our mission to bring understanding and follow-through to every medical conversation. Our culture is founded on doing things the “inverse” way in a legacy system—focusing on patients, instead of the system; focusing on outcomes, instead of billing; and focusing on the end-user experience, instead of a hospital administrator's mandate. Abridgers are engineers, scientists, designers, and health policy experts from a diverse set of backgrounds—an experiment in alchemy that helps us transform an industry dominated by EHRs and enterprise into a consumer-driven experience, one recording at a time. We believe in strong ideas, loosely held, and place a high premium on a growth mindset. We push each other to grow and expose each other to the latest in our respective fields. Whether it’s holding a PhD-level deep dive into understanding fairness and underlying bias in machine learning models, debating the merits of a Scandinavian design philosophy in our UI/UX, or writing responses for Medicare rules to influence U.S. health policy, we prioritize sharing our findings across the team and helping each other be successful. How we take care of Abridgers: Generous Time Off : 13 paid holidays, flexible PTO for salaried employees, and accrued time off for hourly employees. Comprehensive Health Plans : Medical, Dental, and Vision plans for all full-time employees. Abridge covers 100% of the premium for you and 75% for dependents. If you choose a HSA-eligible plan, Abridge also makes monthly contributions to your HSA. Paid Parental Leave : 16 weeks paid parental leave for all full-time employees. 401k and Matching : Contribution matching to help invest in your future. Pre-tax Benefits: Access to Flexible Spending Accounts (FSA) and Commuter Benefits. Learning and Development Budget : Yearly contributions for coaching, courses, workshops, conferences, and more. Sabbatical Leave : 30 days of paid Sabbatical Leave after 5 years of employment. Compensation and Equity : Competitive compensation and equity grants for full time employees. ... and much more! Diversity & Inclusion Abridge is an equal opportunity employer. Diversity and inclusion is at the core of what we do. We actively welcome applicants from all backgrounds (including but not limited to race, gender, educational background, and sexual orientation). Staying safe - Protect yourself from recruitment fraud We are aware of individuals and entities fraudulently representing themselves as Abridge recruiters and/or hiring managers. Abridge will never ask for financial information or payment, or for personal information such as bank account number or social security number during the job application or interview process. Any emails from the Abridge recruiting team will come from an @ abridge.com email address. You can learn more about how to protect yourself from these types of fraud by referring to this article . Please exercise caution and cease communications if something feels suspicious about your interactions. To apply: https://weworkremotely.com/remote-jobs/abridge-senior-sales-enablement-marketing-manager",
    "url": "https://weworkremotely.com/remote-jobs/abridge-senior-sales-enablement-marketing-manager",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 08:48:19 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "machine learning"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Business Development Manager",
    "company": "Crest Industries",
    "location": "Remote",
    "description": "Headquarters: Houston, Texas URL: http://crestoperations.com The Business Development Manager is responsible for development and profitable growth of the industrial products portfolio. The BDM is responsible for growing the company’s customer base, increasing penetration of existing accounts, identifying new market opportunities, increasing the company’s brand awareness, relationship development, execution of sales, sales strategy development and implementation, business planning and weekly, monthly, quarterly and annual reporting of business development activities to executive management. The BDM is also responsible for the coordination of resources and leveraging existing relationships (internal and external) to create new business opportunities that achieve the desired results. The BDM is responsible for researching and developing written plans of action to develop prospective customers through the execution of a successful sales strategy. Regardless of the line of business, this position is responsible for driving sales and achieving profitable growth that contributes to the success of the overall Distribution Platform. COMPETENCIES FOR ALL EMPLOYEES* · Customer Focus · Decision Quality · Business Insight · Drives Results · Collaborates · Communicates Effectively · Courage · Instills Trust · Manages Ambiguity ESSENTIAL FUNCTIONS AND RESPONSIBILITIES List Job Functions considered essential here. Refer to the Essential Job Functions Instructions and Guidelines Form for more info. · Leads the development and implementation of business development strategy for MSS. · Focuses on solving customer problems through developing solutions with the CDG team. · Drives platform strategy through marketing strategies and initiatives. · Communicates technical information in an accurate and clear manner. · Holds strong functional knowledge regarding MSS’ products and services offerings. · Manages business development and marketing efforts associated with special projects or urgent needs. · Maintains and expands upon expertise of the distribution industry. · Investigates all competitive bid opportunities and reports on competitive activity. · Works both independently and as a team contributor on all assignments while understanding the necessity for communicating and coordinating work efforts with other employees and organizations. · Act as a Liaison and support the Outside sales team that directly calls on and manages customer accounts. NONESSENTIAL FUNCTIONS List job functions considered nonessential here. Refer to the Essential Job Functions Instructions and Guidelines Form for more info. · Supports marketing initiatives that may include a variety of marketing programs and processes. · Works effectively with CDG President and leadership team to communicate and obtain buy-in and ownership. · Provides leadership and coaching for team members, focusing on growth, development, and knowledge transfer. · Networks within a given market to find business activity, decision makers, and influencers to create demand for Company products and services. · Demonstrates integrity and ethics in all company, vendor and customer relationships and communications. QUALIFICATIONS List here the requirements needed to qualify for this position. REQUIRED Knowledge, Skills, and Abilities Education and Experience: Bachelor’s Degree in Business, Marketing, Supply Chain, or a related field is preferred, appropriate experience may be considered in lieu of a degree Five plus years of business development experience in a retail or distribution entity or a similar field is required. Must possess excellent time management and organizational skills Exceptional communication skills are required – including written, verbal, and presentation skills Must be able to travel on a regular basis Must possess excellent problem-solving skills PREFERRED Knowledge, Skills, and Abilities Education and Experience: Business development experience within the electrical or industrial supply market is highly preferred. Customer Relationship Management (CRM) experience is preferred Enterprise Resource Planning (ERP) software experience is highly preferred To apply: https://weworkremotely.com/remote-jobs/crest-industries-business-development-manager",
    "url": "https://weworkremotely.com/remote-jobs/crest-industries-business-development-manager",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 08:48:19 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Native English Senior SEO Specialist - Strategic & Hands-On! (Part-Time, Remote)",
    "company": "The Casino Wizard",
    "location": "Remote",
    "description": "Headquarters: Zevenbergen URL: https://thecasinowizard.com/ The Casino Wizard is on a mission to become the most trusted source for expert reviews, in-depth guides, and actionable insights in the online casino space. To support our growing library of high-performing content, we’re looking for a Senior SEO Specialist with a strong background in engineering content that ranks, converts, and delivers value to our audience. This is an exciting opportunity for a results-driven individual with proven SEO experience and a passion for the fast-moving iGaming industry. Key Responsibilities Lead SEO strategy, including keyword research, content planning, and identifying high-impact opportunities in online casinos, bonuses, casino games, and player guides. Perform in-depth competitor analysis to uncover SEO gaps and strategic content opportunities. Optimize content using advanced SEO techniques, including keyword targeting, internal linking, metadata optimization, and semantic content structure. Analyze competitor content to identify content gaps and opportunities. Collaborate closely with the broader SEO team to align content strategy with backlinking efforts and organic traffic objectives. · Research, plan, and write high-quality content on topics such as online casinos, bonuses, casino games, and player guides. Update and improve existing content based on performance data and Google algorithm updates. Ensure all content is accurate, engaging, and aligned with guidelines. Continuously analyze performance data and implement improvements to existing content based on SEO trends and Google algorithm updates. Stay up to date with the latest SEO and content marketing trends—especially within iGaming. Requirements Proven expertise in SEO with a strong track record of improving organic visibility and driving traffic growth, preferably in the casino, gambling, or affiliate marketing sectors. Native-level English proficiency with impeccable grammar and the ability to craft engaging, SEO-focused content. Comprehensive knowledge of on-page SEO practices, content strategy, and search intent optimization. Familiarity with various content types, including landing pages, reviews, player guides, and blog articles. Proficiency with essential SEO tools such as Surfer, Ahrefs, SEMrush, or Google Search Console. Exceptional research capabilities, with the ability to simplify complex topics into clear, compelling content. Detail-oriented, self-driven, and comfortable managing projects independently in a remote environment. Why Join The Casino Wizard? Become part of a driven, knowledgeable team that’s passionate about delivering trustworthy content in one of the most exciting niches in digital marketing. Fully remote work with flexible hours to suit your lifestyle Opportunity to significantly influence a growing brand with a clear SEO vision Collaborate with experienced digital marketing and SEO experts Enjoy a supportive, creative, and friendly team environment where your contributions matter Directly impact content strategy that reaches and engages thousands of readers How to Apply? If you’re an experienced content writer with a passion for SEO and an interest in iGaming, we’d love to hear from you. Please email Matt at thecasinowizard.com with: Your CV or LinkedIn profile A standout piece of SEO-driven content, ideally within the gambling or affiliate niche, and any other relevant documents demonstrating your SEO expertise Include “Native English Speaker” in the subject line if applicable! To apply: https://weworkremotely.com/remote-jobs/the-casino-wizard-native-english-senior-seo-specialist-strategic-hands-on-part-time-remote",
    "url": "https://weworkremotely.com/remote-jobs/the-casino-wizard-native-english-senior-seo-specialist-strategic-hands-on-part-time-remote",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 08:38:53 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "Marketing Content Creator",
    "company": "The Tech Tribe",
    "location": "Remote",
    "description": "Headquarters: Sydney, Australia URL: https://thetechtribe.com If you want to work from home (or your favorite café or beach) on your own schedule, creating marketing content with a fun team, then keep reading 🤓 We’re looking for a Marketing Content Creator to join our fully remote team to create regular marketing collateral & campaigns for our clients. In a nutshell, we run a membership program & community (called The Tech Tribe) and we help the owners of IT Support businesses better run and grow their business through training, resources, templates & mentoring. You will be working directly with the owner of the business (me) to create regular monthly marketing content for our 4,000+ clients (members). We've been in business since 2017 and are in a VERY stable position both financially and in the marketplace, so for the right person, there's HUGE job stability. We like to think we're a fun business to work for and we like to work with purpose and efficiency, we also like to keep things as stress free as possible. Our mission to become the most valuable & results driven program for MSPs & IT Support businesses on the planet, which will see the business keep growing over the next few years. One of our things we do for our members is provide them regular physical and digital marketing campaign templates that they can use for their own marketing. This includes things such as: Postcard Campaigns Printed Flyers Social Media Posts Blog Posts Printed Newsletters Direct Mail Campaigns eBook Projects And more... Up until now we've built this content with a mixture of internal part-time resources and external contractors. And, whilst the quality is good - it's currently not GREAT. So, it's time for us to increase the value and quality and this is where you come in 🤓 We're looking for someone who geeks out on creating high quality marketing content based using direct response principles. We love creating fun, quirky, memorable and (most importantly) results driven Marketing Collateral. Don't worry, we won't chuck you in the deep end without first making sure you have everything you need to succeed. You'll have deep support & feedback from the CEO who geeks out on marketing to help you excel at the role, including a heavier focus in the beginning to help you get up to speed with our way of approaching things. You'll also get access to a bunch of marketing courses & training programs that we have purchased over the years to help you continually improve and refine your skills. 🤓 ABOUT YOU You have a proven history of designing Marketing Collateral You've worked in a B2B Marketing Role before You have an eye for detail, especially when it comes to design You're ready to leverage A.I. to help you excel in the role You understand the importance of good copywriting You know what Direct Response is and why it's important You've created both Digital Content (e.g. Social Media Posts & Blog Posts) and Printed Content (e.g. Postcards & Mailers) You're happy working in a fully remote environment You have at least ~2 hours of working overlap within business hours in the Sydney, Australia timezone (currently GMT+10) Some Nice to Haves (but not Deal Breakers): Experience in the MSP or Cybersecurity Industry Marketing Strategy Experience 🏆WHAT SUCCESS LOOKS LIKE You'll be responsible for building classy, world-class, physical and digital direct response driven Marketing Collateral and Campaigns for our members to help them grow their business. Success in this role is when our members use the Collateral, Content and Campaigns you create to land more clients 🥳 🏅 WHY JOIN US? We're a bootstrapped, profitable and stable company that believes in empowering our team with whatever it takes so they can take ownership & excel in their role. We're committed to doing anything we can to help our clients ( we call them members ) succeed and you'll have a very important part to play in this journey 🤓 You can see what our Team says about working for The Tech Tribe on our Glassdoor Profile here. You can see what our members say about us on our Wall of Love Page here 🧡 Here's some other fun facts: 📈 We've grown nearly every single month since January 2017 📢 We grow mostly by \"Word of Mouth\" Referrals 🤓 We have ~4,000+ MSPs as Paying Members 📑 We've created 100's of Templates, Checklists, Marketing Campaigns and Workshops ✅ We have a Culture of SOPs and Documentation to help us delivery excellence 👷‍♂️ We work daily in ClickUp for Project and Task Management 🌎 We have Team Members in Australia, UK, Canada, USA, Venezuela and the Philippines 💵 We're financially very stable, so job security is extremely high ABOUT US 🤓 Our mission is to empower MSPs by providing Knowledge, Skills, Training, Templates, Tools, Confidence, Community & Support to become the best MSPs in the world* 🤓 [* an MSP is technical jargon for an outsourced B2B I.T. Services Provider. Essentially they help other small businesses with Technology, including things like Cloud Platforms, Networking, Cybersecurity, Infrastructure, Computers, Servers, Firewalls etc] We currently have 4,000+ members in our program and an additional ~5,000 of their team members and we support them with our small remote team of 10 humans spread out around the world. (including USA, Canada, Mexico, the Philippines and Australia (where our CEO is from)) We work hard to deliver an amazing experience to our members to help them better run and grow their business and we take a lot of pride in what we do.\\ BENEFITS Flexible Work Hours (especially after the first 1-2 months once you’re onboarded) Work from Anywhere (you can travel around the world if you want) Continual Education with opportunities to expand your knowledge and skills. Never work on your Birthday (or the next biz day) Company Laptop & Home Setup (External Monitors, Stand-Up Desk etc) We intentionally keep a very low stress workplace Access to world class Marketing training Work in a business where our clients LOVE what we do for them (you can see some of this at thetechtribe.com/love ) Strong, stable company with a great reputation in the marketplace (most of our 4,000+ members have come from Referrals from existing Members) If all the above sounds exciting - then the next steps is to let us know a little more about you here. A FRIENDLY NOTE: Any applications we receive outside of this application process will be ignored and may cause your whole application to be ignored (we are after someone who is detail oriented after all 😜) To apply: https://weworkremotely.com/remote-jobs/the-tech-tribe-marketing-content-creator-1",
    "url": "https://weworkremotely.com/remote-jobs/the-tech-tribe-marketing-content-creator-1",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 07:47:30 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "cloud"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  },
  {
    "title": "🎬 Video Editor (YouTube + Social) — Conscious Content / Planetary Awakening",
    "company": "Symbiotic Unity LLC",
    "location": "Remote",
    "description": "Headquarters: Portland URL: https://symbioticunity.com Remote • Contract / Project-Based Symbiotic Unity is seeking a multidimensional video editor (read: talented human with soul and taste ) to help document and amplify one of the most unusual and important stories ever told— a real-time Kundalini awakening unfolding through YouTube and social media. This role blends YouTube storytelling with social-first vertical content (Reels, Shorts, TikToks), and needs someone who can work fast, follow vibe cues, and occasionally throw the playbook out the window in favor of what actually moves people . You’re not just cutting footage—you’re helping shape a global resonance. 💡 What You’ll Be Doing: Editing 5–10 minute YouTube videos (voice-to-camera storytelling, light b-roll, intuitive pacing) Creating short-form vertical videos (30–90 seconds) for IG, TikTok, and YouTube Shorts Supporting a multi-platform content rollout that’s already underway Bonus if you’re comfortable designing thumbnails, blog headers, or Patreon banner graphics — we’re looking for someone who enjoys both editing and light graphic design to help create a cohesive visual experience across platforms. ✨ Ideal Vibe: You care about what you create. You edit with feeling, not just plugins. You’ve edited for YouTube and social—horizontal and vertical is second nature. You’re responsive and collaborative, but bring your own creative fire (until/unless asked to tone it down 😅) You resonate with the weird , the beautiful , and the real . (If “documenting a real-time spiritual awakening” made you pause—but in a good way—you’re probably our person.) Bonus Points If You: Have experience working with founders, creators, or spiritual weirdos (we mean that lovingly) Use tools like CapCut, Premiere Pro, or Final Cut Can edit quickly without sacrificing soul 🧬 This is not a corporate gig. This is a call to collaborate on something alive . Apply if you feel the pull. To apply: https://weworkremotely.com/remote-jobs/symbiotic-unity-llc-video-editor-youtube-social-conscious-content-planetary-awakening",
    "url": "https://weworkremotely.com/remote-jobs/symbiotic-unity-llc-video-editor-youtube-social-conscious-content-planetary-awakening",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 02:19:49 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-23"
  }
]