[
  {
    "title": "Webflow Developer",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a skilled Webflow Developer to help bring our brand to life online. You’ll be responsible for designing and building responsive Webflow templates that look great and perform even better. Your work will directly impact how users experience our site by making it fast, polished, and on-brand. What You’ll Do Design and develop responsive Webflow templates that align with our visual and functional goals Work closely with the design team to translate concepts into cohesive, high-quality layouts Optimize for performance, responsiveness, and scalability across all devices Troubleshoot and resolve Webflow-related issues efficiently Keep clear, up-to-date documentation of development workflows and best practices To apply: https://weworkremotely.com/remote-jobs/contra-webflow-developer-4",
    "url": "https://weworkremotely.com/remote-jobs/contra-webflow-developer-4",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:30:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Short Form Video Editor",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a skilled freelance video editor to create two short video edits that showcase our visual designs, marketing campaigns, and client logos. These videos will be used to elevate our brand presence across various platforms. The videos will be entirely visual, with no sound needed. All necessary assets and metrics will be provided. We only require the final MP4 file, no open project files. Deliverables Short video edit (max. 10 seconds) in a loop that features visual designs and marketing campaigns as well as 6 client logos (16:9) Short video edit (max. 15 seconds) that focuses on featuring metrics and campaigns (9:16) To apply: https://weworkremotely.com/remote-jobs/contra-short-form-video-editor",
    "url": "https://weworkremotely.com/remote-jobs/contra-short-form-video-editor",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:29:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Brand Designer",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a visionary Brand Designer to help shape our visual identity and bring our brand to life across every touchpoint. If you’re a creative thinker with a strong design aesthetic and a passion for storytelling — we’d love to connect! What You’ll Do: Design visual assets that reflect and evolve Contra’s brand identity Collaborate with Marketing, Product, and Community teams to create high-impact visuals for campaigns, content, and social Develop design systems, templates, and guidelines to ensure brand consistency Create presentations, landing pages, and branded content for internal and external use Translate complex ideas into clear, compelling visuals Elevate the look and feel of Contra’s brand with a clean, modern aesthetic Skills: Strong understanding of brand systems and visual storytelling Typography, layout, and composition expertise Experience creating digital and print assets (social, decks, web, etc.) Ability to interpret and execute on creative briefs Excellent communication and collaboration skills Detail-oriented with a sharp eye for consistency and polish Bonus Points If You Have: Experience working with early-stage startups or marketplace platforms Motion design or animation skills (After Effects, Lottie, etc.) Photography, illustration, or other creative skills Previous work on product marketing, brand refreshes, or rebrands To apply: https://weworkremotely.com/remote-jobs/contra-brand-designer-4",
    "url": "https://weworkremotely.com/remote-jobs/contra-brand-designer-4",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:28:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Google Ad Strategist",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We're looking for a Google Ads Strategist to help us scale paid acquisition and optimize performance across our key funnels. If you’re a data-savvy marketer who knows how to build, test, and optimize high-performing Google Ads campaigns — we want to hear from you! What You’ll Do: Own and manage all Google Ads campaigns (Search, Display, YouTube) Develop data-driven strategies to optimize performance and improve ROI Research and target high-intent keywords aligned with Contra’s ICP Build compelling ad copy and creatives (partnering with our brand team as needed) A/B test landing pages, copy, and CTAs to drive conversions Monitor and report on KPIs weekly, making proactive recommendations Stay on top of Google Ads trends, algorithm updates, and competitive benchmarks What We’re Looking For: 3+ years of experience managing Google Ads accounts (preferably for B2B or SaaS) Strong understanding of CPC, CPA, CTR, Quality Score, and conversion optimization Proven track record of driving measurable growth and lead acquisition Experience with Google Ads Manager, Google Analytics, Tag Manager, and Looker Studio Ability to work independently, move fast, and iterate based on results Excellent communication and reporting skills Bonus Points If You Have: Experience running YouTube video ads Familiarity with landing page builders like Webflow or Unbounce Knowledge of paid social platforms (Meta, LinkedIn) To apply: https://weworkremotely.com/remote-jobs/contra-google-ad-strategist",
    "url": "https://weworkremotely.com/remote-jobs/contra-google-ad-strategist",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:24:01 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Marketing Lead",
    "company": "Contra",
    "location": "Remote",
    "description": "Headquarters: San Francisco, CA URL: http://bit.ly/3kLhMdk We’re looking for a creative, data-driven Marketing Lead to help us scale our impact and drive growth across all channels. About the Role: As Marketing Lead, you’ll be responsible for defining and executing Contra’s marketing strategy — from demand generation to brand awareness. You’ll work closely with Product, Community, and Growth teams to craft compelling campaigns that drive user acquisition and retention. What You’ll Do: Own and evolve Contra’s marketing strategy, aligning it with company goals Build and lead integrated marketing campaigns across digital, email, content, and social Partner with Product and Growth to launch features and run lifecycle campaigns Use data to optimize campaigns and track ROI across all marketing initiatives Develop and manage marketing budgets, forecasts, and KPIs Collaborate with external partners, freelancers, and creative agencies Build and nurture a marketing team over time What We’re Looking For: 5+ years of experience in marketing, ideally at a fast-growing startup or marketplace Proven track record of building and scaling multi-channel marketing strategies Strong analytical skills and experience with tools like Hubspot, Google Analytics, etc. Exceptional written and verbal communication skills Creative thinker with a bias toward action and experimentation Passionate about the future of work and empowering independent professionals Bonus Points: Experience in B2B SaaS or talent marketplaces Previous experience managing a small team or freelancers Familiarity with community-led growth strategies To apply: https://weworkremotely.com/remote-jobs/contra-marketing-lead",
    "url": "https://weworkremotely.com/remote-jobs/contra-marketing-lead",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 19:22:12 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Senior Front End Developer",
    "company": "Missive",
    "location": "Remote",
    "description": "Headquarters: Quebec city, Canada URL: https://missiveapp.com Missive is a complex app (collaborative email client), it's a challenging beast to master, but it's fun! What you'll achieve • Collaborate with product and design teams to implement new features from scratch using React and TypeScript. • Improve and modernize existing front-end code for performance, maintainability, and user experience. • Develop and maintain reusable UI components using Storybook. • Lead bug fixes and support related investigation (we are dealing with complex user interactions, you need to love edge cases) Must Have Skills • 5+ years of experience in all things related to what is listed in this job offer. • Deep React and TypeScript knowledge: Projects showcasing complex UI development, state management, performance optimization, and security best practices. • Thrives in a small, high-performing team, takes ownership, and learns new technologies independently. • Be obsessed with polished UIs, optimized code, and usability. Working at Missive We are passionate about our craft and committed to delivering exceptional results. We build with a clear focus on serving our customers. Creating the best possible product, in the end, is what truly matters. We ship with high quality and velocity, believing that it is not only rewarding but also a lot of fun. • Zero-ish meeting culture, allowing you to focus on what you do best. • Do more with less mentality. • Remote or/and in-office work options (HQ 👉 Quebec City, Canada). • Work closely with a team that recognizes the value of technical expertise. • Work with/for a product loved by its users. • Retreats. Compensation & Benefits The salary for this position depends on experience and qualifications within the range of CAD $125,000 to $175,000 annually. In addition to the base salary, we offer a comprehensive benefits package that includes insurance coverage, telemedicine, 5 weeks of vacation time, and other perks. How to Apply We welcome applications from candidates located in Europe and Americas. Start date is as soon as possible. Submit your resume to jobs@missiveapp.com. p.s. It's the age of AI. If you want an interview, you must stand out. Don't bother with a dissertation – we have no way to know if you actually wrote it or just used AI. In your email write a point-form list of your acheivements, with links to relevant content. To apply: https://weworkremotely.com/remote-jobs/missive-senior-front-end-developer",
    "url": "https://weworkremotely.com/remote-jobs/missive-senior-front-end-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 17:33:28 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "typescript",
      "react"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Remote C# .NET Developer (WinForms, Trading Platform)",
    "company": "Jigsaw Trading Limited",
    "location": "Remote",
    "description": "Headquarters: Hong Kong URL: http://www.jigsawtrading.com Location: Work-from-Home (Asia-based candidates only - we need you on our time zone) - and you if aren't but have a colleague in Asia - pass them the details! About Us: We’re a fast-moving fintech team building a high-performance trading platform that empowers traders worldwide. Based across Asia, we’re a small, collaborative group obsessed with bold ideas, clean code, and rigorous design to deliver real-time, low-latency solutions. We’re on the hunt for a brilliant mind—someone who can outthink our team, master our existing systems, and push our trading tech to new heights. The Role: We’re seeking an exceptional C# .NET Developer to join our remote Asia team, working on our WinForms-based trading platform powered by SQL Server Compact CE. You’ll dive into our existing codebase, quickly learn its intricacies, and extend it with performant, multi-threaded code while adhering to established design patterns. You’ll collaborate closely, rotating design and coding duties daily, and use AI tools to turbocharge development. If you’re a creative genius who can outsmart us and thrive in complex systems, we want you. What You’ll Do: Enhance and optimize WinForms UI for real-time trading, ensuring top-tier performance and responsiveness. Write highly performant, multi-threaded C# code, mastering thread-safe collections and avoiding pitfalls like deadlocks and race conditions. Manage data efficiently with SQL Server Compact CE for lean, local storage. Dive into existing systems, rapidly learning their architecture, workflows, and design patterns to extend and improve them. Co-create and review technical designs (e.g., UML, architecture docs), leading and contributing in a collaborative, rotating workflow. Leverage AI tools (e.g., GitHub Copilot, LLMs) to accelerate coding, debugging, and design innovation. Quickly adapt to new tools, APIs, or proprietary systems to tackle evolving challenges. Contribute to a trading platform with real-time market data, order execution, and financial algorithms. Who You Are: A brilliant problem-solver with 3–7 years of C# .NET Framework experience, including deep WinForms expertise. A multi-threading expert, with proven experience handling deadlocks, race conditions, and thread-safe collections (e.g., ConcurrentDictionary). Skilled with SQL Server Compact CE or similar embedded databases (SQL Server knowledge a plus). A master of OOP (SOLID principles, design patterns) who writes elegant, scalable code. Adept at working with existing systems, quickly learning their structure, and following established design patterns to maintain consistency. Comfortable crafting and critiquing technical designs, with a disciplined design-before-coding mindset. Experienced using AI tools (e.g., Copilot, ChatGPT) to boost productivity and innovate workflows. A quick learner who thrives on complex challenges and adapts to new tech effortlessly. Ideally experienced in trading platforms or fintech (e.g., low-latency systems, order matching). Young (25–35), energetic, and driven to outthink and outshine your peers. Based in Asia, with reliable internet for remote work. A clear communicator who excels in collaborative, idea-driven teams. Standout Qualities: You’ve mastered a complex legacy system and made it better, faster, or smarter. You’ve used AI to solve a tricky coding, design, or system integration problem in a way that surprised your team. You’ve led a project or design that redefined how your team approached a challenge. Bonus: Experience with .NET Core, APIs, or cloud (Azure/AWS), or open-source/personal projects that showcase your brilliance. Why Join Us? Work-from-home flexibility with a passionate, Asia-based team. A collaborative culture where everyone designs, codes, and challenges each other to innovate. A high-impact trading platform that traders rely on daily. Freedom to use AI and cutting-edge tools to redefine development speed and quality. A team that celebrates your ability to outthink us and elevate our systems to the next level. How to Apply: Send your resume, GitHub/LinkedIn profile, and a short note describing how you’ve outsmarted a tough technical challenge (e.g., multi-threading, system integration, or AI-driven solution) to hiring@jigsawtrading.com . Bonus points: Include a sample technical design, a code snippet showcasing multi-threading or system integration, or an example of how you used AI to innovate and reduce coding implementation times. Application Deadline: April 30th, 2025 Challenge Us: If you can outthink our team, master our systems, and build trading tech that blows us away, we want you. Apply now and show us what you’re capable of! To apply: https://weworkremotely.com/remote-jobs/jigsaw-trading-limited-remote-csharp-net-developer-winforms-trading-platform-exceptional-talent-wanted",
    "url": "https://weworkremotely.com/remote-jobs/jigsaw-trading-limited-remote-csharp-net-developer-winforms-trading-platform-exceptional-talent-wanted",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 15:04:43 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "aws",
      "cloud",
      "sql"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Senior Python Engineer",
    "company": "datashake.com",
    "location": "Remote",
    "description": "Headquarters: Lisbon, Portugal URL: https://datashake.com We're an established business with thousands of paying customers and a team of 20+ and are searching for a full-time Senior Python Engineer to help us build out our services. We're fully remote, with team members across the world. We generally work CET hours but are flexible as long as there's some overlap. You’ll be an important part of our early-stage team and work on several projects, internal frameworks, and micro-services. We are looking for someone who is excited about building out game-changing technologies that are used by software engineers, data scientists, quants, and data analysts all around the world. You're a proactive, sharp, and self-motivated individual who is eager to learn and take ownership of our products. You love communicating and working with others in your team toward success, taking us from where we are now to where we want to be! Being bootstrapped (not venture-backed) and fully remote, we don’t strive for growth at all costs and are building a company that we can be proud of, and enjoy working for. Our tech stack Python, FastAPI React Celery RabbitMQ and Kafka MySQL, Elasticsearch, Redis Github, CI/CD Docker, Kubernetes AWS Requirements Our ideal candidate has: Solid experience as a Python Engineer (5+ years) Solid experience building REST APIs using FastAPI framework Experience working with Elasticsearch Experience with containerization and orchestration with Docker and Kubernetes Experience in version control using Git Experience with CI/CD pipelines, automating builds, testing, and deployments Familiarity with caching mechanisms and in-memory data store technologies like Redis Familiarity with monitoring and observability tools like Grafana Familiarity with Amazon Web Services (AWS) Fluent English and excellent communication skills Nice to have: Experience in web scraping, parsing HTML/XML, and extracting structured data Experience creating products for developers, data engineers, and/or data consumers Experience with AI What you will do Design and implement robust and scalable engineering solutions Contribute to the development of internal tools and libraries that streamline content retrieval operations Participate in code reviews while fostering knowledge sharing within the team Develop and maintain CI/CD pipelines that automate testing and deployment of various applications What you will bring A passion for building elegant, maintainable code A proactive mindset and willingness to take initiative A collaborative spirit and strong communication skills Perks and Benefits Our team is fully remote and we communicate primarily through Slack, Linear, Notion, and a few weekly meetings via Google Meet - we believe the best work happens when given lots of uninterrupted time that's free of distractions. 💰 Salary range: $42,000 - $60,000 / year (USD, gross) 🌎 Work from anywhere 🏖️ 26 days paid time off 🏢 Co-work expenses covered (up to $300/m) 📗 $500/year learning budget 🖥️ $250 Desktop budget 🍉 $30 Wellness budget 💃 $30 Fun Budget If this sounds like a good fit, we’d love to hear from you! To apply: https://weworkremotely.com/remote-jobs/datashake-com-senior-python-engineer",
    "url": "https://weworkremotely.com/remote-jobs/datashake-com-senior-python-engineer",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 11:56:54 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "python",
      "react",
      "aws",
      "sql",
      "kubernetes",
      "docker"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Senior Sales Enablement Marketing Manager",
    "company": "Abridge",
    "location": "Remote",
    "description": "Headquarters: New York City-Hybrid URL: http://abridge.com Abridge was founded in 2018 with the mission of powering deeper understanding in healthcare. Our AI-powered platform was purpose-built for medical conversations, improving clinical documentation efficiencies while enabling clinicians to focus on what matters most—their patients. Our enterprise-grade technology transforms patient-clinician conversations into structured clinical notes in real-time, with deep EMR integrations. Powered by Linked Evidence and our purpose-built, auditable AI, we are the only company that maps AI-generated summaries to ground truth, helping providers quickly trust and verify the output. As pioneers in generative AI for healthcare, we are setting the industry standards for the responsible deployment of AI across health systems. We are a growing team of practicing MDs, AI scientists, PhDs, creatives, technologists, and engineers working together to empower people and make care make more sense. We have offices located in the SoHo neighborhood of New York, the Mission District in San Francisco, and Lawrenceville in Pittsburgh. The Role We are seeking a highly motivated and experienced Senior Sales Enablement Marketing Manager focusing on Commercial Enablement to join our dynamic team as we scale the most trusted AI solution for clinical conversations. This role is crucial for ensuring the success of our sales and partner success teams by providing the tools, resources, and support they need to effectively sell our AI technology solutions to enterprise healthcare systems. The ideal candidate will be highly cross-functional, organized, and capable of operationalizing and executing sales enablement strategies. This is a hybrid role in NYC with a weekly requirement of being in the office Tuesday-Wednesday-Thursday. What You’ll Do Commercial Enablement Strategy Develop and implement a comprehensive sales enablement strategy that aligns with commercial goals and objectives. Build out prioritization processes that enable sales teams to request sales assets and track progress in a central way. Track and analyze key performance metrics to measure the effectiveness of sales enablement initiatives and identify areas for improvement. Content Development Create and maintain enablement content, including sales playbooks, training materials, and product marketing collateral. Drive and execute on the development of customized presentations and proposals for the sales team. Partner with Revenue Operations to conduct regular training sessions and workshops for the sales team on product updates, sales techniques, and industry trends. Support onboarding programs for new sales hires to ensure rapid ramp-up and productivity. Cross-Functional Collaboration Work closely with sales, marketing, and product to ensure alignment and effective communication. Coordinate with subject matter experts to gather and disseminate relevant information to the sales team. Ensure all enablement materials are accurate, up-to-date, and aligned with the company’s messaging and brand standards. Manage multiple requests and projects simultaneously, maintaining a high level of organization and attention to detail. What You’ll Bring Minimum of 6-8 years of experience in sales enablement, preferably within the healthcare revenue cycle technology sector Strong understanding of enterprise healthcare systems and the purchasing committee within executive leadership teams. Proven ability to develop and execute commercial enablement strategies that drive results. Excellent communication and interpersonal skills, with the ability to collaborate effectively across departments with differing priorities. Exceptional organizational skills and the ability to manage multiple projects and deadlines simultaneously. Exception proficiency in sales enablement tools and slide-building. Strong analytical skills and attention to detail. An entrepreneurial spirit and proactive, resourceful mindset to drive innovation and continually improve sales processes. Why work at Abridge? At Abridge, we’re driven by our mission to bring understanding and follow-through to every medical conversation. Our culture is founded on doing things the “inverse” way in a legacy system—focusing on patients, instead of the system; focusing on outcomes, instead of billing; and focusing on the end-user experience, instead of a hospital administrator's mandate. Abridgers are engineers, scientists, designers, and health policy experts from a diverse set of backgrounds—an experiment in alchemy that helps us transform an industry dominated by EHRs and enterprise into a consumer-driven experience, one recording at a time. We believe in strong ideas, loosely held, and place a high premium on a growth mindset. We push each other to grow and expose each other to the latest in our respective fields. Whether it’s holding a PhD-level deep dive into understanding fairness and underlying bias in machine learning models, debating the merits of a Scandinavian design philosophy in our UI/UX, or writing responses for Medicare rules to influence U.S. health policy, we prioritize sharing our findings across the team and helping each other be successful. How we take care of Abridgers: Generous Time Off : 13 paid holidays, flexible PTO for salaried employees, and accrued time off for hourly employees. Comprehensive Health Plans : Medical, Dental, and Vision plans for all full-time employees. Abridge covers 100% of the premium for you and 75% for dependents. If you choose a HSA-eligible plan, Abridge also makes monthly contributions to your HSA. Paid Parental Leave : 16 weeks paid parental leave for all full-time employees. 401k and Matching : Contribution matching to help invest in your future. Pre-tax Benefits: Access to Flexible Spending Accounts (FSA) and Commuter Benefits. Learning and Development Budget : Yearly contributions for coaching, courses, workshops, conferences, and more. Sabbatical Leave : 30 days of paid Sabbatical Leave after 5 years of employment. Compensation and Equity : Competitive compensation and equity grants for full time employees. ... and much more! Diversity & Inclusion Abridge is an equal opportunity employer. Diversity and inclusion is at the core of what we do. We actively welcome applicants from all backgrounds (including but not limited to race, gender, educational background, and sexual orientation). Staying safe - Protect yourself from recruitment fraud We are aware of individuals and entities fraudulently representing themselves as Abridge recruiters and/or hiring managers. Abridge will never ask for financial information or payment, or for personal information such as bank account number or social security number during the job application or interview process. Any emails from the Abridge recruiting team will come from an @ abridge.com email address. You can learn more about how to protect yourself from these types of fraud by referring to this article . Please exercise caution and cease communications if something feels suspicious about your interactions. To apply: https://weworkremotely.com/remote-jobs/abridge-senior-sales-enablement-marketing-manager",
    "url": "https://weworkremotely.com/remote-jobs/abridge-senior-sales-enablement-marketing-manager",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 08:48:19 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "machine learning"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Business Development Manager",
    "company": "Crest Industries",
    "location": "Remote",
    "description": "Headquarters: Houston, Texas URL: http://crestoperations.com The Business Development Manager is responsible for development and profitable growth of the industrial products portfolio. The BDM is responsible for growing the company’s customer base, increasing penetration of existing accounts, identifying new market opportunities, increasing the company’s brand awareness, relationship development, execution of sales, sales strategy development and implementation, business planning and weekly, monthly, quarterly and annual reporting of business development activities to executive management. The BDM is also responsible for the coordination of resources and leveraging existing relationships (internal and external) to create new business opportunities that achieve the desired results. The BDM is responsible for researching and developing written plans of action to develop prospective customers through the execution of a successful sales strategy. Regardless of the line of business, this position is responsible for driving sales and achieving profitable growth that contributes to the success of the overall Distribution Platform. COMPETENCIES FOR ALL EMPLOYEES* · Customer Focus · Decision Quality · Business Insight · Drives Results · Collaborates · Communicates Effectively · Courage · Instills Trust · Manages Ambiguity ESSENTIAL FUNCTIONS AND RESPONSIBILITIES List Job Functions considered essential here. Refer to the Essential Job Functions Instructions and Guidelines Form for more info. · Leads the development and implementation of business development strategy for MSS. · Focuses on solving customer problems through developing solutions with the CDG team. · Drives platform strategy through marketing strategies and initiatives. · Communicates technical information in an accurate and clear manner. · Holds strong functional knowledge regarding MSS’ products and services offerings. · Manages business development and marketing efforts associated with special projects or urgent needs. · Maintains and expands upon expertise of the distribution industry. · Investigates all competitive bid opportunities and reports on competitive activity. · Works both independently and as a team contributor on all assignments while understanding the necessity for communicating and coordinating work efforts with other employees and organizations. · Act as a Liaison and support the Outside sales team that directly calls on and manages customer accounts. NONESSENTIAL FUNCTIONS List job functions considered nonessential here. Refer to the Essential Job Functions Instructions and Guidelines Form for more info. · Supports marketing initiatives that may include a variety of marketing programs and processes. · Works effectively with CDG President and leadership team to communicate and obtain buy-in and ownership. · Provides leadership and coaching for team members, focusing on growth, development, and knowledge transfer. · Networks within a given market to find business activity, decision makers, and influencers to create demand for Company products and services. · Demonstrates integrity and ethics in all company, vendor and customer relationships and communications. QUALIFICATIONS List here the requirements needed to qualify for this position. REQUIRED Knowledge, Skills, and Abilities Education and Experience: Bachelor’s Degree in Business, Marketing, Supply Chain, or a related field is preferred, appropriate experience may be considered in lieu of a degree Five plus years of business development experience in a retail or distribution entity or a similar field is required. Must possess excellent time management and organizational skills Exceptional communication skills are required – including written, verbal, and presentation skills Must be able to travel on a regular basis Must possess excellent problem-solving skills PREFERRED Knowledge, Skills, and Abilities Education and Experience: Business development experience within the electrical or industrial supply market is highly preferred. Customer Relationship Management (CRM) experience is preferred Enterprise Resource Planning (ERP) software experience is highly preferred To apply: https://weworkremotely.com/remote-jobs/crest-industries-business-development-manager",
    "url": "https://weworkremotely.com/remote-jobs/crest-industries-business-development-manager",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 08:48:19 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Native English Senior SEO Specialist - Strategic & Hands-On! (Part-Time, Remote)",
    "company": "The Casino Wizard",
    "location": "Remote",
    "description": "Headquarters: Zevenbergen URL: https://thecasinowizard.com/ The Casino Wizard is on a mission to become the most trusted source for expert reviews, in-depth guides, and actionable insights in the online casino space. To support our growing library of high-performing content, we’re looking for a Senior SEO Specialist with a strong background in engineering content that ranks, converts, and delivers value to our audience. This is an exciting opportunity for a results-driven individual with proven SEO experience and a passion for the fast-moving iGaming industry. Key Responsibilities Lead SEO strategy, including keyword research, content planning, and identifying high-impact opportunities in online casinos, bonuses, casino games, and player guides. Perform in-depth competitor analysis to uncover SEO gaps and strategic content opportunities. Optimize content using advanced SEO techniques, including keyword targeting, internal linking, metadata optimization, and semantic content structure. Analyze competitor content to identify content gaps and opportunities. Collaborate closely with the broader SEO team to align content strategy with backlinking efforts and organic traffic objectives. · Research, plan, and write high-quality content on topics such as online casinos, bonuses, casino games, and player guides. Update and improve existing content based on performance data and Google algorithm updates. Ensure all content is accurate, engaging, and aligned with guidelines. Continuously analyze performance data and implement improvements to existing content based on SEO trends and Google algorithm updates. Stay up to date with the latest SEO and content marketing trends—especially within iGaming. Requirements Proven expertise in SEO with a strong track record of improving organic visibility and driving traffic growth, preferably in the casino, gambling, or affiliate marketing sectors. Native-level English proficiency with impeccable grammar and the ability to craft engaging, SEO-focused content. Comprehensive knowledge of on-page SEO practices, content strategy, and search intent optimization. Familiarity with various content types, including landing pages, reviews, player guides, and blog articles. Proficiency with essential SEO tools such as Surfer, Ahrefs, SEMrush, or Google Search Console. Exceptional research capabilities, with the ability to simplify complex topics into clear, compelling content. Detail-oriented, self-driven, and comfortable managing projects independently in a remote environment. Why Join The Casino Wizard? Become part of a driven, knowledgeable team that’s passionate about delivering trustworthy content in one of the most exciting niches in digital marketing. Fully remote work with flexible hours to suit your lifestyle Opportunity to significantly influence a growing brand with a clear SEO vision Collaborate with experienced digital marketing and SEO experts Enjoy a supportive, creative, and friendly team environment where your contributions matter Directly impact content strategy that reaches and engages thousands of readers How to Apply? If you’re an experienced content writer with a passion for SEO and an interest in iGaming, we’d love to hear from you. Please email Matt at thecasinowizard.com with: Your CV or LinkedIn profile A standout piece of SEO-driven content, ideally within the gambling or affiliate niche, and any other relevant documents demonstrating your SEO expertise Include “Native English Speaker” in the subject line if applicable! To apply: https://weworkremotely.com/remote-jobs/the-casino-wizard-native-english-senior-seo-specialist-strategic-hands-on-part-time-remote",
    "url": "https://weworkremotely.com/remote-jobs/the-casino-wizard-native-english-senior-seo-specialist-strategic-hands-on-part-time-remote",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 08:38:53 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Marketing Content Creator",
    "company": "The Tech Tribe",
    "location": "Remote",
    "description": "Headquarters: Sydney, Australia URL: https://thetechtribe.com If you want to work from home (or your favorite café or beach) on your own schedule, creating marketing content with a fun team, then keep reading 🤓 We’re looking for a Marketing Content Creator to join our fully remote team to create regular marketing collateral & campaigns for our clients. In a nutshell, we run a membership program & community (called The Tech Tribe) and we help the owners of IT Support businesses better run and grow their business through training, resources, templates & mentoring. You will be working directly with the owner of the business (me) to create regular monthly marketing content for our 4,000+ clients (members). We've been in business since 2017 and are in a VERY stable position both financially and in the marketplace, so for the right person, there's HUGE job stability. We like to think we're a fun business to work for and we like to work with purpose and efficiency, we also like to keep things as stress free as possible. Our mission to become the most valuable & results driven program for MSPs & IT Support businesses on the planet, which will see the business keep growing over the next few years. One of our things we do for our members is provide them regular physical and digital marketing campaign templates that they can use for their own marketing. This includes things such as: Postcard Campaigns Printed Flyers Social Media Posts Blog Posts Printed Newsletters Direct Mail Campaigns eBook Projects And more... Up until now we've built this content with a mixture of internal part-time resources and external contractors. And, whilst the quality is good - it's currently not GREAT. So, it's time for us to increase the value and quality and this is where you come in 🤓 We're looking for someone who geeks out on creating high quality marketing content based using direct response principles. We love creating fun, quirky, memorable and (most importantly) results driven Marketing Collateral. Don't worry, we won't chuck you in the deep end without first making sure you have everything you need to succeed. You'll have deep support & feedback from the CEO who geeks out on marketing to help you excel at the role, including a heavier focus in the beginning to help you get up to speed with our way of approaching things. You'll also get access to a bunch of marketing courses & training programs that we have purchased over the years to help you continually improve and refine your skills. 🤓 ABOUT YOU You have a proven history of designing Marketing Collateral You've worked in a B2B Marketing Role before You have an eye for detail, especially when it comes to design You're ready to leverage A.I. to help you excel in the role You understand the importance of good copywriting You know what Direct Response is and why it's important You've created both Digital Content (e.g. Social Media Posts & Blog Posts) and Printed Content (e.g. Postcards & Mailers) You're happy working in a fully remote environment You have at least ~2 hours of working overlap within business hours in the Sydney, Australia timezone (currently GMT+10) Some Nice to Haves (but not Deal Breakers): Experience in the MSP or Cybersecurity Industry Marketing Strategy Experience 🏆WHAT SUCCESS LOOKS LIKE You'll be responsible for building classy, world-class, physical and digital direct response driven Marketing Collateral and Campaigns for our members to help them grow their business. Success in this role is when our members use the Collateral, Content and Campaigns you create to land more clients 🥳 🏅 WHY JOIN US? We're a bootstrapped, profitable and stable company that believes in empowering our team with whatever it takes so they can take ownership & excel in their role. We're committed to doing anything we can to help our clients ( we call them members ) succeed and you'll have a very important part to play in this journey 🤓 You can see what our Team says about working for The Tech Tribe on our Glassdoor Profile here. You can see what our members say about us on our Wall of Love Page here 🧡 Here's some other fun facts: 📈 We've grown nearly every single month since January 2017 📢 We grow mostly by \"Word of Mouth\" Referrals 🤓 We have ~4,000+ MSPs as Paying Members 📑 We've created 100's of Templates, Checklists, Marketing Campaigns and Workshops ✅ We have a Culture of SOPs and Documentation to help us delivery excellence 👷‍♂️ We work daily in ClickUp for Project and Task Management 🌎 We have Team Members in Australia, UK, Canada, USA, Venezuela and the Philippines 💵 We're financially very stable, so job security is extremely high ABOUT US 🤓 Our mission is to empower MSPs by providing Knowledge, Skills, Training, Templates, Tools, Confidence, Community & Support to become the best MSPs in the world* 🤓 [* an MSP is technical jargon for an outsourced B2B I.T. Services Provider. Essentially they help other small businesses with Technology, including things like Cloud Platforms, Networking, Cybersecurity, Infrastructure, Computers, Servers, Firewalls etc] We currently have 4,000+ members in our program and an additional ~5,000 of their team members and we support them with our small remote team of 10 humans spread out around the world. (including USA, Canada, Mexico, the Philippines and Australia (where our CEO is from)) We work hard to deliver an amazing experience to our members to help them better run and grow their business and we take a lot of pride in what we do.\\ BENEFITS Flexible Work Hours (especially after the first 1-2 months once you’re onboarded) Work from Anywhere (you can travel around the world if you want) Continual Education with opportunities to expand your knowledge and skills. Never work on your Birthday (or the next biz day) Company Laptop & Home Setup (External Monitors, Stand-Up Desk etc) We intentionally keep a very low stress workplace Access to world class Marketing training Work in a business where our clients LOVE what we do for them (you can see some of this at thetechtribe.com/love ) Strong, stable company with a great reputation in the marketplace (most of our 4,000+ members have come from Referrals from existing Members) If all the above sounds exciting - then the next steps is to let us know a little more about you here. A FRIENDLY NOTE: Any applications we receive outside of this application process will be ignored and may cause your whole application to be ignored (we are after someone who is detail oriented after all 😜) To apply: https://weworkremotely.com/remote-jobs/the-tech-tribe-marketing-content-creator-1",
    "url": "https://weworkremotely.com/remote-jobs/the-tech-tribe-marketing-content-creator-1",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 07:47:30 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "cloud"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "🎬 Video Editor (YouTube + Social) — Conscious Content / Planetary Awakening",
    "company": "Symbiotic Unity LLC",
    "location": "Remote",
    "description": "Headquarters: Portland URL: https://symbioticunity.com Remote • Contract / Project-Based Symbiotic Unity is seeking a multidimensional video editor (read: talented human with soul and taste ) to help document and amplify one of the most unusual and important stories ever told— a real-time Kundalini awakening unfolding through YouTube and social media. This role blends YouTube storytelling with social-first vertical content (Reels, Shorts, TikToks), and needs someone who can work fast, follow vibe cues, and occasionally throw the playbook out the window in favor of what actually moves people . You’re not just cutting footage—you’re helping shape a global resonance. 💡 What You’ll Be Doing: Editing 5–10 minute YouTube videos (voice-to-camera storytelling, light b-roll, intuitive pacing) Creating short-form vertical videos (30–90 seconds) for IG, TikTok, and YouTube Shorts Supporting a multi-platform content rollout that’s already underway Bonus if you’re comfortable designing thumbnails, blog headers, or Patreon banner graphics — we’re looking for someone who enjoys both editing and light graphic design to help create a cohesive visual experience across platforms. ✨ Ideal Vibe: You care about what you create. You edit with feeling, not just plugins. You’ve edited for YouTube and social—horizontal and vertical is second nature. You’re responsive and collaborative, but bring your own creative fire (until/unless asked to tone it down 😅) You resonate with the weird , the beautiful , and the real . (If “documenting a real-time spiritual awakening” made you pause—but in a good way—you’re probably our person.) Bonus Points If You: Have experience working with founders, creators, or spiritual weirdos (we mean that lovingly) Use tools like CapCut, Premiere Pro, or Final Cut Can edit quickly without sacrificing soul 🧬 This is not a corporate gig. This is a call to collaborate on something alive . Apply if you feel the pull. To apply: https://weworkremotely.com/remote-jobs/symbiotic-unity-llc-video-editor-youtube-social-conscious-content-planetary-awakening",
    "url": "https://weworkremotely.com/remote-jobs/symbiotic-unity-llc-video-editor-youtube-social-conscious-content-planetary-awakening",
    "source": "WeWorkRemotely",
    "posted_at": "Tue, 22 Apr 2025 02:19:49 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Senior Full Stack Engineer (Ruby on Rails/React)",
    "company": "Learning Tapestry",
    "location": "Remote",
    "description": "Headquarters: United States URL: https://www.learningtapestry.com **About Learning Tapestry** Hi! We're Learning Tapestry. We're a 25+ person all-remote, global organization dedicated to making digital learning \"just work\" for educators and learners alike. We solve hard problems in complex education technology environments. We’re a triple bottom line company: we make a profit like any good business; our work makes the world better (“social impact”); and we strive to create a healthy internal work environment for everyone who works here. For our staff we believe in flexible work locations and working arrangements. We empower all of our team members to manage their schedules and adjust as necessary. We're focused on results and impact, not locations and hours. We hire people with great technical ability, but we also expect everyone at Learning Tapestry to have a strong personal character and solid communication skills. We highly value effective software architecture, test-driven development methods, and good project management methodology. We believe in having a strong CI and deployment pipeline that enables us to focus on writing good software. **What We’re Looking For** You’re an exceptional professional software engineer with at least 8 years of software engineering experience. You’re comfortable in multiple languages, but in particular you are strong in backend coding using Ruby on Rails, and frontend engineering with React (or you are expert in an alternative frontend framework and are willing to learn/use React for some projects). Our ideal candidate is available 30-40 hours per week during US Central standard business hours. We ask everyone who works here to be fluent or highly proficient in written and spoken English, and easily understood by US-based speakers (we ask for this to allow everyone in the company to be able to communicate with each other, rather than having to go through intermediates). Please read through this entire job description before applying, as there is critical information about how to apply included. Please do not apply by reaching out to other company emails or individuals: please note that applying using other communication channels will result in your application not being considered. **Required Skills and Experience** At least eight years of Software Engineering Experience, with a minimum of five years doing senior engineering work such as solution design, architecture, code review, full stack engineering, or similar tasks. You have very good written communication skills, fluent written English, and comfortable, clear spoken English. Must be available during US Central standard business hours (UTC -6) You can write in multiple languages fluently, efficiently, and reliably, and are expert in writing in Ruby on Rails, and React (or similar modern JS framework). Help maintain professional standards for the entire organization. Have deep, substantial expertise in multiple programming environments. Capable of executing projects across multiple technical domains (“full stack,” data architecture, devops, etc). Have an interest and ability to learn new technical subjects when you need to solve new types of problems. Can pursue investigation and problem solving into issues to resolve them, and can also recognize when it’s more efficient to ask for help vs push forward to solve a problem. Believe that all technical problems are solvable with enough effort. Have humility and kindness with regards to others and their own abilities. Seek to help others; seek to share what you know; want to see your work have an impact in the world. Substantial, practical expertise in implementing: SQL-based databases Can design complex data structure implementations. Has experience with schema and other data migrations to meet new code and feature complexity requirements. Can write SQL queries and make performance optimizations. Can implement standard connectivity to/from SQL servers. DevOps Deployment and CI/CD Have a solid knowledge of designing and implementing devops pipelines, using tools such as docker, kubernetes, or related systems. Can develop strategies for managing cached data to optimize performance, using tools like Fastly, Cloudfront, Cloudflare, other CDNs, Varnish, or Redis. Understand basic infosec principles to design, evaluate, and operate systems securely. Solutions Design / Systems Architecture Can work with business analysts, product managers, and senior executives to understand the business problems and propose, adapt, and design technical solutions to meet those needs. Can translate technical concepts to non-technical audiences and simplify complex concepts without oversimplifying. Able to explain technical issues in actionable ways to non-technical people. Can design and configure/operate the technical systems required to implement a technical solution. Understand cryptography and security enough to design systems that use existing login/identity standards securely (OAuth2, JWTs, etc). Avoids overly complex technology solutions, preferring complexity levels based on the needs of specific projects. Recognize that the best technical solution is not always the best business solution, and can negotiate with stakeholders accordingly. Are not overly enamored with brand new technologies, and have the maturity and experience to evaluate new technology against existing solutions objectively. Can write clear, simple specifications to reflect how a system will be built. Testing and Reliability Engineering Understand TDD vs manual QA Engineering, and where each is appropriate in developing software. Insist on building automated testing frameworks when necessary for software pipelines, and know how to implement “enough testing” without relying on a “test everything” approach. Can design functional monitoring solutions for uptime management. Capable of implementing test automation using tools such as Cypress, Postman, Swagger/OpenAPI. Can write developer docs for a project to assist a new engineer in learning to develop in a codebase. Can train and support new engineers on existing systems, to get them up and running quickly. Can create uptime failure recovery documentation: what to do when a system fails. Can debug and analyze production systems for faults. Can conduct performance testing using K6, New Relic, Skylight, JMeter, and similar tools to find performance issues, design faults and system optimizations. **Bonus skills** Experience in Ed Tech Field (Education projects) Experience with Project Management tools, such as Github boards, Trello, Asana, or Jira. (We generally use Github boards.) Can develop or integrate coding projects with cloud-based architecture such as AWS API Gateway, Route66 (and DNS generally), SSL certificates, cloud-based private network routing, etc. **To Apply** Apply with your resume and a cover letter. In order to be considered for this role, please confirm the days and times that you plan to work in this role (in US CST) and your hourly rate (in USD) in your cover letter. **About You** You’re confident in your skills as an engineer and professional, and have humility about how you bring your expertise into the workplace with others. You’re comfortable in a remote work environment, with team members from different time zones, countries, and cultures. You manage your own time well and are a self-starter. You have a distraction-free place you can use for work that offers reliable Internet access (suitable for voice/video calls and development uses), either in your home or a local co-working facility. You are experienced and well-versed in the productivity tools we use, like Google Apps & Hangouts, Slack, and Harvest for time tracking. You’re fluent or highly proficient in written and spoken English. Please do not hesitate to apply if you do not match these requirements exactly but think you could be a good fit for this position. Just let us know why you’re a good fit! **Equal Opportunity** Learning Tapestry is an equal opportunity employer and encourages individuals of all ethnic and racial backgrounds, sexual orientations, and gender identities to apply. We are also particularly interested in individuals who have lived in or worked with underserved communities such as low-income, gender nonconforming, disabled, or indigenous peoples. To apply: https://weworkremotely.com/remote-jobs/learning-tapestry-senior-full-stack-engineer-ruby-on-rails-react-1",
    "url": "https://weworkremotely.com/remote-jobs/learning-tapestry-senior-full-stack-engineer-ruby-on-rails-react-1",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 19:51:23 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "react",
      "backend",
      "frontend",
      "full stack",
      "aws",
      "cloud",
      "devops",
      "ruby",
      "sql",
      "kubernetes",
      "docker"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Full-Stack Developer",
    "company": "Officials Management Systems",
    "location": "Remote",
    "description": "Headquarters: Spring, TX URL: https://www.officialsmanagement.net The Officials Management System (OMS) is seeking a part-time, contract full-stack developer to help with development efforts and provide Tier 2/Tier 3 support to our front line customer support. Technology Stack One of the goals of this position will be to incrementally modernize the platform, and help bring modern tools into our stack. We are currently using: Frontend: Bootstrap, vanilla JavaScript & HTML Backend: Visual Basic/ASP, SQL Server: Windows Server 2025 Cloud: AWS Database: SQL Server, hosted on AWS Areas we are looking to improve upon include: JavaScript tooling Modernization of the user interface Unit and Integration Testing Framework and Test Cases Qualifications & Requirements Previous experience working with VB.net and ASP, in both front end and back end web development. Experience with basic management & administration of Windows Server 2025 and SQL Server in the AWS environment You have experience with the Microsoft stack. You can communicate effectively & fluently in English, both verbally and in writing. You can produce technical documentation, both within the code base, and also with writing stand-alone technical documentation. You can provide Tier 2 or Tier 3 technical support when needed for technical issues that are initially handled by a front-line customer support representative. You have shipped at least one customer-facing product. You write unit tests and develop code that supports automated testing. You communicate clearly and are willing to give & receive critical feedback to improve the user experience. You stay up to date with the latest web development news and technologies. Bonus Experience with C# (or conversion of VB to C#) Experience with UI and/or UX design Our Interview process Our interview process is designed to focus on your skills as a software engineer, and your ability to communicate clearly. You'll begin with an interview with a technical manager. Afterwards, you may be asked to complete a small code challenge, along with a technical design document. Working Hours This is a part-time contract position. We expect the workload to be approximately 20 hours per week. At least half of your work time should be scheduled within Eastern time working hours of 9am-5pm, Monday-Friday. You need to reside in the Pacific, Mountain, Central, or Eastern time zones. This position is not eligible for work visa sponsorship. Benefits USD $40/hour Flexible schedule Fully remote position - you just need a laptop and reliable Internet access. To apply: https://weworkremotely.com/remote-jobs/officials-management-systems-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/officials-management-systems-full-stack-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 16:12:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "javascript",
      "backend",
      "frontend",
      "aws",
      "cloud",
      "sql",
      "spring"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Video Editor",
    "company": "Fledge",
    "location": "Remote",
    "description": "Headquarters: Edinburgh URL: http://fledge.net Video Editor - Series A - Legal AI Edinburgh Full-time - Hybrid Fledge We are a boutique Talent search firm connecting exceptional Talent with the most innovative companies in the AI and software development industries across EMEA. Our clients are among companies with innovative products that have a positive impact on our societies and we present them with a solution model between fine consulting and flexible recruitment process outsourcing : Fractional Talent acquisition advisory Recruitment operation tools On-demand Talent sourcing expertise Job Summary As a Video Editor , you’ll be instrumental in shaping the visual storytelling behind a cutting-edge AI platform transforming the legal industry. Based in Edinburgh (hybrid), you’ll take ownership of post-production projects, crafting engaging content that reflects our mission, voice, and values. You’ll work closely with our creative team to deliver high-quality videos that resonate with our audience and elevate our brand. In this role, you will Lead post-production efforts, editing video content into clear, narrative-driven stories. Use tools like Adobe Premiere Pro, Final Cut Pro , and After Effects to produce polished, professional videos. Apply motion graphics and perform color grading (experience with DaVinci Resolve is a plus). Collaborate with producers and creatives to shape concepts and refine final outputs. Manage multiple video projects, staying on schedule while maintaining exceptional quality. Required Skills and Qualifications Visual storyteller : You understand how to structure a compelling narrative through video. Technically skilled : Proficient with major editing and motion design tools like Premiere Pro, Final Cut, and After Effects. Detail-oriented : You know how to polish the finer points—from color correction to smooth transitions. Team-focused : You enjoy creative collaboration but can also thrive independently. Organized : Able to juggle multiple deadlines and deliver high-quality content consistently. Passionate : You care deeply about creative problem-solving and producing meaningful, engaging work. 🌈 Diversity, Equity, Inclusion and Belonging We are committed to enabling everyone to feel included and valued and trust our partners to do the same. Both the company and its culture are strongest when composed of diverse experiences and backgrounds. All qualified applicants will receive consideration for employment without regard to age, color, family, gender identity, marital status, national origin, physical or mental disability, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws. ℹ️ Important If you have a medical condition or an individual need for an adjustment to our process, and you believe this may affect your ability to be at your best - please let us know so we can talk about how we can best support you and make any adjustments that may be needed. In case of any doubts or questions, please contact Fledge - hello @fledge.net To apply: https://weworkremotely.com/remote-jobs/fledge-video-editor-legal-ai",
    "url": "https://weworkremotely.com/remote-jobs/fledge-video-editor-legal-ai",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 15:35:13 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "aws"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Social Media Content Producer",
    "company": "Starvox Entertainment",
    "location": "Remote",
    "description": "Headquarters: Toronto, Canada URL: https://starvoxent.com We're seeking a creative and data-savvy Social Media Content Producer to join our dynamic team. In this role, you'll be responsible for crafting engaging content that resonates with our audience across multiple social media platforms while driving meaningful engagement and growth. Key Responsibilities: Your day-to-day will involve immersing yourself in social media trends and translating them into compelling content. You'll develop original posts that align with our brand voice, manage content scheduling, and analyze performance metrics to continuously refine our social media strategy. Specifically, you will: Create and curate engaging content across all social media platforms, including written copy, images, videos, and Stories Monitor and analyze social media trends, identifying opportunities to participate in relevant conversations and viral moments Develop and maintain a content calendar, ensuring consistent and timely posting across platforms Track and report on key performance metrics, providing insights and recommendations for optimization Engage with followers through comments, messages, and mentions, maintaining our brand voice and building community Collaborate with the marketing team to plan and execute social media campaigns that align with broader business objectives Required Qualifications: Proficient in English 2+ years of experience in social media content creation and management Strong creative writing skills and the ability to adapt tone for different platforms Experience with social media management tools and analytics platforms, including Facebook, Instagram, TikTok, Threads, X and Snapchat Understanding of social media best practices and current trends Excellent organizational and time management skills Preferred Qualifications: Knowledge of social media advertising Experience with photo and video editing software is a plus Background in digital marketing or communications is a plus Experience with influencer partnerships is a plus If you're passionate about creating content that connects with audiences and drives results, we want to hear from you. To apply: https://weworkremotely.com/remote-jobs/starvox-entertainment-social-media-content-producer",
    "url": "https://weworkremotely.com/remote-jobs/starvox-entertainment-social-media-content-producer",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 15:31:30 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Territory Manager",
    "company": "Roofr",
    "location": "Remote",
    "description": "Headquarters: Remote: North Carolina URL: http://roofr.com At Roofr, we’re obsessed with our customers. We constantly gather feedback to shape, prioritize, and launch the products they truly need. That’s what makes Roofr’s CRM special. We started by building essential sales tools like aerial roof measurements and digital sales proposals. But when our customers asked for a simple, affordable way to manage and scale their entire businesses, we listened. So, we created a CRM that connects these solutions—along with payments, material ordering, and more—into a seamless, powerful platform. With a clear roadmap ahead, we’re excited to continue expanding and leading the market with innovative products. We have an amazing culture, strong financials, and best-in-class company metrics. It’s an exciting time to be part of an extraordinary startup that is already successful, yet still early enough to offer its team significant growth, equity, and the opportunity to make a real impact. The Partnerships Team is looking for a stellar Territory Manager—who has a background in roofing supply, manufacturing, or any relevant adjacent industries—and that can drive Roofr’s partner enablement program for its current and future supplier alliances in regions across North America. A strong communicator and skilled in sales and account management, the candidate will be recognized for their abilities to prioritize and execute on key partnership enablement strategies, product training and onboarding, and develop long-term and sustainable relationships that drive net-new opportunities for Roofr’s revenue team. The candidate will work closely with several internal stakeholders including, including sales, marketing, operations, and other teams within the partnerships group to deepen Roofr’s partnerships with the roofing supply vertical. What you get to do: Own existing branch relationships and enable their sales reps for new opportunities in your allocated territory Be responsible for driving partner growth through partner engagement and enablement programs Become the main point of contact for partners for all subjects related to Roofr and our products that are assigned to you Provide effective Roofr product training and onboarding support for our new partners Plan, forecast, and meet monthly and quarterly departmental objectives and quotas Own engagement responsibilities by organizing and hosting timely and localized community events and meetings Provide Roofr product updates through in-person, or virtual, trainings, presentations, and meetings Travel to partner sites/locations regularly (estimated 1-2 weeks per month) Become a master of Roofr’s PRM & CRM for partner-related updates Work cross-functionally with Roofr’s sales, success, revops, and support leaders to define priorities and resolve any issues between Roofr and the partner What you bring to the role: 3+ years of experience in the roofing industry or industries adjacent to Roofing (e.g., home improvement/construction, etc.) 5+ years of account management and/or relationship management experience Experience working in channel partnerships is a huge plus Experience managing partnerships in a business development environment with Roofing supply companies is a huge plus Experience with relevant or modern tooling such as CRMs (Hubspot/Salesforce), PRMs (Partner stack), Asana, Google suite Excellent organizational skills, attention to detail, and the ability to multi-task/switch gears in a fast-paced environment Excellent verbal and written communication skills and presentation skills Excel at building and maintaining internal and external relationships and navigating organizations, and making relevant, high-producing connections Ability to work collaboratively or independently with minimal supervision Ability to manage influence through persuasion, negotiation, and consensus building Who You Are: You are an outstanding communicator with a proven ability to foster long-term relationships with various types of stakeholders and people of diverse backgrounds You are well organized, (e.g., diligent with note-taking, punctual with all virtual and in-person meetings, etc.) You have a team-centric attitude that adapts well to consensus decision-making and enjoys collaborative work You have an affinity for technology and start-ups You are outgoing, someone who looks forward to traveling and meeting our partners in person! We are specifically interviewing candidates located in the following US states: OH, IN, KY, IL, PA, VA, NC, GA, FL 🏠 What we offer: When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career: 🏝️ Vacation/Paid Time Off: 1st week of employment is mandatory PTO! Start your journey with Roofr by decompressing and recharging - we will see you in week 2! 1 Friday off per month (we call those our laundry days!) Company wide paid shutdown for the week between Christmas and New Years Flexible time off 80% employer paid benefits RRSP/401k match Generous Parental Leave policy 🤝 Perks: We host 2 retreats per year and great team building activities Ample learning and development opportunities to continue growing your career Home office setup stipend Internet and phone allowance Remote first culture Weekly Friday paydays! Roofr is proud to be an equal opportunity employer. We are committed to equal employment opportunity in the workplace regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. IMPORTANT NOTICE: Our company takes the security and privacy of job applicants very seriously. We will never ask for payment, bank details, or personal financial information as part of the application process. All our legitimate job postings can be found on our official career site ( https://boards.greenhouse.io/roofr ). Please be cautious of job offers that come from non-company email addresses (@roofr.com), instant messaging platforms, or unsolicited calls. To apply: https://weworkremotely.com/remote-jobs/roofr-territory-manager-2",
    "url": "https://weworkremotely.com/remote-jobs/roofr-territory-manager-2",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 15:18:33 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Remote Executive Assistant (10 hrs/week, U.S. Timezones Only)",
    "company": "ARC Executive Desk (Private Client)",
    "location": "Remote",
    "description": "Headquarters: Delray Beach, Florida Seeking a highly skilled, detail-oriented Remote Executive Assistant to manage complex task coordination, confidential communication, and administrative support for an executive managing sensitive, time-critical responsibilities. Key Responsibilities: – Build and manage an Asana-based task management system between two executives in different locations. This includes setup, ongoing updates, and relaying communications between parties. – Communicate with a second executive on behalf of the primary hiring executive to manage project updates, task accountability, and shared deadlines. – Maintain strict confidentiality, professionalism, and mature tone in all communications. – Manage and triage high-volume email inboxes (Outlook and Gmail), flagging key action items and assisting with follow-up as directed. – Provide scheduling support across Google Calendar and Microsoft Outlook. – Assist with inbox organization, document management, cloud backup setup, and remote desktop cleanup. – Coordinate business travel and personal logistics when needed. – Support household or operational errands that may require online research, order placement, or vendor outreach. May need to schedule medical appointments such as Dental, etc. Required Qualifications: – Must be based in the United States – Minimum 5 years of experience in executive assistance or remote operations support – Extensive experience with Asana, including system creation and team implementation – Strong written communication skills and impeccable attention to detail – High proficiency in Google Workspace and Microsoft Outlook (email, calendar, and file organization) – Proven ability to work independently, maintain discretion, and act with maturity and speed – Experience with Excel Application Instructions: To apply, please email arcexecdesk@gmail.com with the subject line: “Remote Executive Assistant Application – [Your Name]” Please include: – A current resume – A short introduction – Responses to the vetting questions below Vetting Questions: 1. How many years of experience do you have using Asana? Have you ever created an Asana task management system from scratch? If so, please briefly describe the scope and complexity of that setup. 2. How quickly could you fully set up a working Asana project space to manage multi-phase collaboration between two executives in different locations, with automated reminders and clear task ownership? 3. What’s your experience managing high-volume inboxes in both Gmail and Outlook? Please provide examples. 4. What specific experience do you have working with executives who handle sensitive business or personal matters? 5. Are you based in the United States and available during U.S. business hours? 6. Are you able to work independently and follow detailed instructions for communication — including not sending any external emails until pre-approved? Finalists may be asked to complete a short paid trial task. To apply: https://weworkremotely.com/remote-jobs/arc-executive-desk-private-client-remote-executive-assistant-10-hrs-week-u-s-timezones-only",
    "url": "https://weworkremotely.com/remote-jobs/arc-executive-desk-private-client-remote-executive-assistant-10-hrs-week-u-s-timezones-only",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 17:10:32 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "cloud"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Part-Time Online Promoter (Remote",
    "company": "Nest Step",
    "location": "Remote",
    "description": "Headquarters: Saatwinkler Damm , Berlin, Germany URL: https://nextstep-job.com/part-time-online-promoter-remote/ We’re seeking motivated, creative individuals in Germany to join us as Part-Time Online Promoters . This fully remote role is perfect for students, freelancers, or anyone looking to earn extra income by sharing content and engaging with digital audiences. You’ll promote our products and services on platforms like Instagram, TikTok, Facebook, and Twitter , while gaining valuable experience in social media and digital marketing. Key Responsibilities: Create and post engaging content (text, images, videos, stories) across social media platforms Promote our offerings through your own voice and channels Interact with followers, answer questions, and support community engagement Share weekly insights and feedback with the team Requirements: Based in Germany with legal working status Familiar with at least one major social platform (training provided) Available to work 5–10 hours/week , flexible schedule Reliable internet access + smartphone or computer Creative mindset and willingness to learn What We Offer: ✅ Flexible remote work (work anytime, anywhere in Germany) ✅ Weekly payouts based on tasks and performance ✅ Training and support provided – no experience needed ✅ Collaborative, international work culture How to Apply: Click \"Apply Now\" and send us a short introduction. Tell us why you’d make a great Online Promoter – we’ll handle the rest. Start your remote journey today and turn your time online into earnings ! To apply: https://weworkremotely.com/remote-jobs/nest-step-part-time-online-promoter-remote-germany-only",
    "url": "https://weworkremotely.com/remote-jobs/nest-step-part-time-online-promoter-remote-germany-only",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 15:54:11 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Influencer Marketing Intern (Remote – Germany, Norway, or Sweden)",
    "company": "Nest Step",
    "location": "Remote",
    "description": "Headquarters: Saatwinkler Damm , Berlin, Germany URL: https://nextstep-job.com/influencer-marketing-intern-remote/ Location: Remote – Applicants must reside in Germany, Norway, or Sweden Job Description We’re looking for a creative, social-media-savvy Influencer Marketing Intern to join our remote team from Germany, Norway, or Sweden . This internship is ideal for students or recent graduates who want to gain hands-on experience in influencer outreach, campaign management, and digital brand growth. You'll work closely with our global marketing team to grow brand awareness through partnerships with influencers and content creators on platforms like Instagram, TikTok, YouTube , and more. Key Responsibilities Research and identify relevant influencers (micro & macro) across social platforms Support outreach, communication, and relationship-building with influencers Assist with campaign planning, content briefs, deliverables tracking, and reporting Monitor influencer content and track KPIs (reach, engagement, conversions) Research trends and competitor campaigns to improve influencer strategy Brainstorm ideas for future influencer-driven marketing initiatives Requirements Currently studying or recently graduated in Marketing, Communications, or a related field Passionate about social media, influencer culture, and digital content Familiar with platforms like Instagram, TikTok, YouTube, etc. Strong communication skills (verbal and written) in English Self-driven, organized, and able to work independently Based in Germany, Norway, or Sweden Stable internet connection and access to a computer or smartphone What We Offer ✅ 100% remote internship with flexible hours ✅ Work-from-anywhere within Germany, Norway, or Sweden ✅ Real-world experience in influencer marketing & campaign execution ✅ Mentorship from experienced marketers ✅ Opportunity for future paid/full-time roles based on performance How to Apply Click “Apply Now” and send us a brief introduction along with your CV. Let us know why you're excited about influencer marketing and what makes you a great fit for this role. Join us and take your first step into a career where content, creativity, and influence meet strategy. To apply: https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-norway-or-sweden",
    "url": "https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-norway-or-sweden",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 15:39:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Influencer Marketing Intern (Remote",
    "company": "Nest Step",
    "location": "Remote",
    "description": "Headquarters: Saatwinkler Damm , Berlin, Germany URL: https://nextstep-job.com/influencer-marketing-intern-remote/ We’re looking for a creative, social-media-savvy Influencer Marketing Intern to join our team remotely from Germany . This internship is ideal for students or recent graduates eager to gain hands-on experience in influencer outreach, campaign management, and digital brand strategy. You’ll collaborate with our global marketing team to help grow brand visibility by engaging with influencers and supporting real-world campaigns on platforms like Instagram, TikTok, and YouTube. Key Responsibilities Research and identify relevant influencers (micro & macro) on key social platforms Assist in outreach, communication, and relationship-building with influencers Support campaign management (brief creation, deliverables tracking, results reporting) Monitor influencer content and track key campaign KPIs (reach, engagement, conversions) Analyze competitor influencer strategies and market trends Help brainstorm and execute creative influencer-driven campaign ideas Requirements Currently pursuing or recently completed a degree in Marketing, Communications, or Business Strong passion for social media, influencers, and content marketing Familiar with platforms like Instagram, TikTok, YouTube, etc. Strong communication skills (verbal & written) Proactive, organized, and self-motivated in a remote work setting Based in Germany with a reliable internet connection What We Offer ✅ 100% Remote Internship – Work from anywhere in Germany ✅ Flexible schedule that fits your academic or personal needs ✅ Real industry experience in influencer marketing and campaign analytics ✅ Mentorship from experienced digital marketing professionals ✅ Opportunity for future full-time consideration based on performance How to Apply Click “Apply Now” and send a brief intro along with your CV. Tell us why you're excited about influencer marketing and how you'd bring value to our team. Join us and start building a digital marketing career that connects brands and communities through powerful influencer campaigns. To apply: https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-only",
    "url": "https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-only",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 15:39:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Remote Paralegal – VIDEO INTERVIEW REQUIRED (50–60 hrs/week",
    "company": "EF LAW FIRM",
    "location": "Remote",
    "description": "Headquarters: AUSTIN, TX URL: https://careers.interviewer.ai/EF-Law-Firm/f495cde6-d58f-43b9-a1aa-49fb7878d017 🚨 READ FIRST – DO NOT SKIP YOU MUST COMPLETE YOUR VIDEO INTERVIEW TO APPLY Messages and emails will NOT be responded to if you do not read this post and complete the interview below. NOTE ON CANDIDATE ID: YOU SHOULD FIRST ATTEMPT TO LEAVE THE CANDIDATE ID FIELD BLANK, BUT IF THAT DOES NOT WORK TO ALLOW YOU TO SUBMIT THE FORM, THEN (PUT A RANDOM 5 DIGIT NUMBER IN THE UNIQUE CANDIDATE ID SECTION BY USING THIS SERVICE HERE: https://numbergenerator.org/random-5-digit-number-generator#google_vignette ) About Us We’re EF LAW FIRM , a U.S.-based estate planning law firm helping families protect their loved ones through customized wills, trusts, and legal plans. We work 100% remotely. We’re systems-first, fast-moving, and client-focused. Every week, we help dozens of clients get legally solid estate plans finalized—quickly and accurately. About the Role We’re hiring a Remote Paralegal / Legal Drafter to join our legal ops team. You’ll take structured info from client forms and turn it into accurate, polished legal drafts. You won’t be writing from scratch—you’ll be assembling and formatting using templates. You’ll get full training and systems to follow. ✅ This Role Is FOR YOU If: You speak and write excellent English (fluency will be tested) You love checklists, templates, and accurate work You take ownership of your results You’re ready to work 50–60 hours/week , full-time You have fast internet, a quiet workspace, and a modern computer You improve with repetition and enjoy becoming a master of your process You’re reliable, responsive, and take pride in consistency 🚫 DO NOT Apply If: You want part-time, freelance, or “side work” You’re only available 20–30 hours/week You hate repetitive work You skim job posts and ignore instructions You resist feedback or go dark under pressure You try to bypass systems or ignore chain of command 💸 Compensation $1,200–$1,800/month (fixed salary) Paid training + performance bonuses Long-term, full-time growth opportunity 🔧 Tools & Tech Requirements (You MUST Have): Mac or PC with 8GB RAM , Intel i5 / M1 chip or better Stable internet: 50 Mbps download / 10 Mbps upload minimum Noise-canceling headset Webcam: 720p minimum , 1080p preferred Quiet, distraction-free workspace Ability to remotely log into a U.S. workstation with low lag 🧠 Software We Use: Google Drive Microsoft Word Slack Zoom PDF editors Remote desktop access tools 📝 How to Apply: Step 1: Complete your video interview: 👉 efeldmanlaw@gmail.com EF LAW GROUP – Video Interview Questions & Drafting Test Instructions Please record your answers to each of the following questions using Loom (https://www.loom.com) and send the video link back to us for review. Be sure to speak clearly and thoughtfully. Your responses will help us assess your communication, logic, and attention to detail. 1. Tell us a little about yourself and your background in working with documents or administrative tasks. 2. Why are you interested in working with a U.S.-based estate planning law firm long-term? 3. Describe your home office setup and how you keep it quiet and distraction-free. 4. What kind of computer do you use and do you have a second screen or backup device? 5. Do you use noise-canceling headphones? If not, are you willing to get them before starting? 6. Visit www.speedtest.net and share your internet speed (download + upload). 7. How would you explain what an estate plan is to someone unfamiliar? 8. If a client leaves their house to their daughter, but she has passed away, what should happen? 9. How do you accurately enter client info into templates from an intake sheet? 10. How do you respond when told a draft needs to be redone? 11. This is a full-time position that can require 50–60 hours/week. How many hours are you realistically able to work? 12. What is your expected monthly salary in USD for a full-time role working 50–60 hours/week? Step 2: Upload your resume inside the portal Step 3: Be ready to start immediately if selected ⚡ Final Word This is a serious, high-performance role. If you follow instructions, work hard, and care about doing things right—you’ll thrive here. We don’t micromanage. We don’t babysit. But we do reward people who deliver. If that’s you, let’s go. To apply: https://weworkremotely.com/remote-jobs/ef-law-firm-remote-paralegal-video-interview-required-50-60-hrs-week-1-200-1-800-mo",
    "url": "https://weworkremotely.com/remote-jobs/ef-law-firm-remote-paralegal-video-interview-required-50-60-hrs-week-1-200-1-800-mo",
    "source": "WeWorkRemotely",
    "posted_at": "Sat, 19 Apr 2025 04:40:16 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Job Post - Performance Marketer – Google & YouTube Ads",
    "company": "GrowthEdge",
    "location": "Remote",
    "description": "Headquarters: Melbourne URL: https://ge-cg.co.za Performance Marketer – Google & YouTube Ads (Remote) About the Role We're looking for a skilled Performance Marketer to join our team and lead high-performing campaigns across Google and YouTube. You'll be responsible for full-funnel strategy, execution, and optimization—scaling enterprise-level ad accounts while delivering clear insights and measurable results. Key Responsibilities Develop, execute, and optimize Google and YouTube ad campaigns Build media plans that align with client goals and budgets Maintain robust tracking, QA, and performance reporting systems Analyze campaign data to uncover insights and opportunities Present strategies and results clearly to clients and internal teams Test new creatives, offers, and bidding strategies regularly Manage and scale ad spend of $100K+/month with precision Requirements Platform Expertise Advanced knowledge of Google Ads (Search, Shopping, Display, Performance Max) Strong command of YouTube Ads for direct response campaigns Experience with GA4, GTM, conversion tracking, and attribution models Strategic Thinking and Business Acumen Proven success across eCommerce, SaaS, and service-based business models Strong understanding of key metrics: CAC, LTV, ROAS, MER, AOV, conversion rates Ability to adapt offers and strategies based on data and margins Executional Excellence Experience building and scaling campaigns from scratch Solid QA processes for setup and reporting Ability to manage multiple accounts while maintaining quality and results Communication and Reporting Clear and structured communicator Proficient in building dashboards, performance updates, and reports Comfortable contributing to strategy discussions and receiving feedback Preferred Bonus Skills Experience with landing page CRO, funnel optimization, and split testing Familiarity with multi-channel attribution models (e.g., Meta, Email) Background in creative development for YouTube and Display campaigns What We Offer Remote work with flexible hours Opportunity to work with high-growth, diverse clients Competitive compensation based on experience Access to professional development resources Collaborative, results-driven team environment How to Apply If you’re a performance-focused marketer with a proven track record of scaling campaigns and managing large budgets, we’d love to hear from you. Apply here: https://dfod2lpd4tu.typeform.com/to/EldeFkZ7 To apply: https://weworkremotely.com/remote-jobs/growthedge-job-post-performance-marketer-google-youtube-ads-remote",
    "url": "https://weworkremotely.com/remote-jobs/growthedge-job-post-performance-marketer-google-youtube-ads-remote",
    "source": "WeWorkRemotely",
    "posted_at": "Sat, 19 Apr 2025 01:12:49 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  },
  {
    "title": "Client Implementations Data Solutions Architect",
    "company": "Subscript",
    "location": "Remote",
    "description": "Headquarters: Oakland, California, United States URL: https://www.subscript.com Data Solutions works with new customers to set up their data in Subscript and verify everything is correct! Exciting update : We just closed our Series A a couple months ago (see more details here ). It's a really fun + empowering time to be joining our Subbie team! The basics The product ✨ : We're building the premier metrics-first finance and billing platform that empowers B2B SaaS leaders to invoice their customers, tell their ARR story, and track accounting revenue, all in one place—regardless of how complex their customers' contracts are The role you'll play on our team: You'll be the first point of contact for new customers after they've signed on to Subscript 🙌🏽, and will work with them through complex, data-intensive implementations 🤔. You'll hook our new customers up to their source data, help them clean and validate their data in Subscript, and help do the types of analysis that give them the most value 👍🏽. Over the course of each implementation, you'll work to get ARR metrics, invoices, and accounting revenue clean and complete, referencing clients' CRMs (e.g. Hubspot, Salesforce), general ledgers (e.g. Quickbooks, Xero), billing tools (e.g. Stripe, Maxio, Chargebee), and spreadsheets. The Subscript app acts as our de-facto ETL pipeline, but is highly customizable, which means working with an in-house transformation layer (built off of this NPM package ) to configure our ingestion rules. You can expect to split your time across four main tools: 1. Spreadsheets - Transforming and cleaning clients' past data to be ingested into Subscript, as well as validating results 2. Internal configuration JSON files - The transformation rules described above, used for hooking up to external data sources 3. SQL - To understand internal data, e.g. after ingestion 4. Postman/APIs - To fetch and explore external data (e.g. Hubspot deals or Quickbooks invoices) that will be ingested into Subscript (Bonus) Python - This isn't strictly required, but we occasionally make use of Colab notebooks to do data fetching and/or transformation that would be too challenging via other methods You'll be the seventh member of the Data Solutions team , and will help define what the role becomes as we grow! You'll work closely with the whole company, including our co-founders Sidharth Kakkar and Michelle Lee . They formerly built and successfully exited a B2B SaaS company called Freckle Education , and this is their second start-up. We're a young company with a lean team (current under 30 people, but growing quickly!), so you'll have a huge say in how we shape and build all parts of our organization 👯‍♂️. You'll have a ton of autonomy in defining + iterating on best practices and processes to really help both our customers AND our teammates reach the moon! You'll not only work directly with the new clients you take on, but also support other team members as they encounter new challenges and could learn from your experience and insight. The way we work : We are an asynchronous 🕛 team We don't do scheduled internal meetings, so the vast majority of communication is available to anybody at any time in written documentation, whole-company Slack channels, and video documentation. If you're sick of pointless meetings, this is the place for you! Sounds a little nuts, right? But it works! And it's one of our secret sauces for why our team is so high-performing (and happy!). You can hear more about working in our Async culture in this podcast episode featuring our CEO. We operate completely autonomously 💃🏿 No one will tell you what to do; everyone gets transparent context and details about the company goals and you will figure out how to work towards them with the rest of the team! This is a remote job 🌎 - work anywhere you want Although we are fully remote and asynchronous internally, our clients are all over the world; you'll be taking live calls most days of the week with customers in California, Australia, or US-East, so a substantial overlap in your working hours is a must! You can expect to be working US-Pacific hours We're a team that loves working together We love playing board games 🎲 (these we do synchronously 🙂). Full-time team members meet up multiple times per year for live off-sites around the world (expenses paid!) Our interview process We like to be really transparent and communicative about everything at Subscript, including our interview process: Our interview process is designed to focus on your intuition with analytics, and your ability to communicate clearly (both written and in video calls) . We default to asynchronous communication internally, so the majority of the interview process follows suite 🙂. The interview will focus around your ability to understand, support, and engage our awesome customers 🤝 First, we'll ask you to work on spreadsheet task similar to the type of data work you'll be doing with our customers! As part of this simulation, you'll get a chance to ask clarification questions about the data 🔢. We'll then have a short live call to talk through your background, career goals, and working style, which will also offer you the chance to talk through questions you may have about the role, the product, the team, or whatever else is on your mind. The second asynchronous task will be a SQL exercise (postgres) to show your ability in working with databases. We'll provide the data and details on the required output, and you'll provide the query to get there. Next, you'll have a chance to show off your customer communication, as you prepare for and lead a live kick-off call with a brand new Subscript customer (who we will be taking on the role of for the purposes of the interview 🥸). Finally, you'll have a chance to meet and talk with one of our cofounders. This isn't graded or used in evaluation, but is an opportunity for you to go to know us better and answer any lingering questions you might have. It's important for us that our company and working style is a good fit for you and that you have everything you need to make the right decision. Requirements Our ideal candidate loves data 🥰 (analyzing it, talking about it, advising our customers using it). You'll be acting as a key strategic advisor to our customers using that data! We're looking for... serious spreadsheet skills experience requesting and reading JSON data from APIs satisfaction in getting to perfectly clean data SQL mastery familiarity with B2B SaaS business models ability to work US-Pacific time 5+ years relevant experience We're also happy to see (but don't require)... comfort in Python experience with general ledgers used in SaaS finance (e.g. Quickbooks, Xero, and and Netsuite) exposure to CRM software (Hubspot and Salesforce) You're kind, empathetic, and communicative 😄. Both externally, as you'll be collaborating closely with customers, as well as internally, as you'll be supporting with the broader team in written docs 📄 + recorded videos. Benefits Unlimited vacation Flexible work schedule - work anytime and anywhere you want (as long as you are available to work with clients during their business hours and join live calls with them) Benefits appropriate to your location (health/dental/vision in the USA) Company-wide retreats multiple times per year, all expenses paid Like all start-ups we're scrappy, but not scrappy on compensation: Subscript is committed to paying our awesome team members at market-rate, including benefits. To apply: https://weworkremotely.com/remote-jobs/subscript-client-implementations-data-solutions-architect-1",
    "url": "https://weworkremotely.com/remote-jobs/subscript-client-implementations-data-solutions-architect-1",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 20:49:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "python",
      "sql"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-22"
  }
]