[
  {
    "title": "Senior Full Stack Engineer (Ruby on Rails/React)",
    "company": "Learning Tapestry",
    "location": "Remote",
    "description": "Headquarters: United States URL: https://www.learningtapestry.com **About Learning Tapestry** Hi! We're Learning Tapestry. We're a 25+ person all-remote, global organization dedicated to making digital learning \"just work\" for educators and learners alike. We solve hard problems in complex education technology environments. We’re a triple bottom line company: we make a profit like any good business; our work makes the world better (“social impact”); and we strive to create a healthy internal work environment for everyone who works here. For our staff we believe in flexible work locations and working arrangements. We empower all of our team members to manage their schedules and adjust as necessary. We're focused on results and impact, not locations and hours. We hire people with great technical ability, but we also expect everyone at Learning Tapestry to have a strong personal character and solid communication skills. We highly value effective software architecture, test-driven development methods, and good project management methodology. We believe in having a strong CI and deployment pipeline that enables us to focus on writing good software. **What We’re Looking For** You’re an exceptional professional software engineer with at least 8 years of software engineering experience. You’re comfortable in multiple languages, but in particular you are strong in backend coding using Ruby on Rails, and frontend engineering with React (or you are expert in an alternative frontend framework and are willing to learn/use React for some projects). Our ideal candidate is available 30-40 hours per week during US Central standard business hours. We ask everyone who works here to be fluent or highly proficient in written and spoken English, and easily understood by US-based speakers (we ask for this to allow everyone in the company to be able to communicate with each other, rather than having to go through intermediates). Please read through this entire job description before applying, as there is critical information about how to apply included. Please do not apply by reaching out to other company emails or individuals: please note that applying using other communication channels will result in your application not being considered. **Required Skills and Experience** At least eight years of Software Engineering Experience, with a minimum of five years doing senior engineering work such as solution design, architecture, code review, full stack engineering, or similar tasks. You have very good written communication skills, fluent written English, and comfortable, clear spoken English. Must be available during US Central standard business hours (UTC -6) You can write in multiple languages fluently, efficiently, and reliably, and are expert in writing in Ruby on Rails, and React (or similar modern JS framework). Help maintain professional standards for the entire organization. Have deep, substantial expertise in multiple programming environments. Capable of executing projects across multiple technical domains (“full stack,” data architecture, devops, etc). Have an interest and ability to learn new technical subjects when you need to solve new types of problems. Can pursue investigation and problem solving into issues to resolve them, and can also recognize when it’s more efficient to ask for help vs push forward to solve a problem. Believe that all technical problems are solvable with enough effort. Have humility and kindness with regards to others and their own abilities. Seek to help others; seek to share what you know; want to see your work have an impact in the world. Substantial, practical expertise in implementing: SQL-based databases Can design complex data structure implementations. Has experience with schema and other data migrations to meet new code and feature complexity requirements. Can write SQL queries and make performance optimizations. Can implement standard connectivity to/from SQL servers. DevOps Deployment and CI/CD Have a solid knowledge of designing and implementing devops pipelines, using tools such as docker, kubernetes, or related systems. Can develop strategies for managing cached data to optimize performance, using tools like Fastly, Cloudfront, Cloudflare, other CDNs, Varnish, or Redis. Understand basic infosec principles to design, evaluate, and operate systems securely. Solutions Design / Systems Architecture Can work with business analysts, product managers, and senior executives to understand the business problems and propose, adapt, and design technical solutions to meet those needs. Can translate technical concepts to non-technical audiences and simplify complex concepts without oversimplifying. Able to explain technical issues in actionable ways to non-technical people. Can design and configure/operate the technical systems required to implement a technical solution. Understand cryptography and security enough to design systems that use existing login/identity standards securely (OAuth2, JWTs, etc). Avoids overly complex technology solutions, preferring complexity levels based on the needs of specific projects. Recognize that the best technical solution is not always the best business solution, and can negotiate with stakeholders accordingly. Are not overly enamored with brand new technologies, and have the maturity and experience to evaluate new technology against existing solutions objectively. Can write clear, simple specifications to reflect how a system will be built. Testing and Reliability Engineering Understand TDD vs manual QA Engineering, and where each is appropriate in developing software. Insist on building automated testing frameworks when necessary for software pipelines, and know how to implement “enough testing” without relying on a “test everything” approach. Can design functional monitoring solutions for uptime management. Capable of implementing test automation using tools such as Cypress, Postman, Swagger/OpenAPI. Can write developer docs for a project to assist a new engineer in learning to develop in a codebase. Can train and support new engineers on existing systems, to get them up and running quickly. Can create uptime failure recovery documentation: what to do when a system fails. Can debug and analyze production systems for faults. Can conduct performance testing using K6, New Relic, Skylight, JMeter, and similar tools to find performance issues, design faults and system optimizations. **Bonus skills** Experience in Ed Tech Field (Education projects) Experience with Project Management tools, such as Github boards, Trello, Asana, or Jira. (We generally use Github boards.) Can develop or integrate coding projects with cloud-based architecture such as AWS API Gateway, Route66 (and DNS generally), SSL certificates, cloud-based private network routing, etc. **To Apply** Apply with your resume and a cover letter. In order to be considered for this role, please confirm the days and times that you plan to work in this role (in US CST) and your hourly rate (in USD) in your cover letter. **About You** You’re confident in your skills as an engineer and professional, and have humility about how you bring your expertise into the workplace with others. You’re comfortable in a remote work environment, with team members from different time zones, countries, and cultures. You manage your own time well and are a self-starter. You have a distraction-free place you can use for work that offers reliable Internet access (suitable for voice/video calls and development uses), either in your home or a local co-working facility. You are experienced and well-versed in the productivity tools we use, like Google Apps & Hangouts, Slack, and Harvest for time tracking. You’re fluent or highly proficient in written and spoken English. Please do not hesitate to apply if you do not match these requirements exactly but think you could be a good fit for this position. Just let us know why you’re a good fit! **Equal Opportunity** Learning Tapestry is an equal opportunity employer and encourages individuals of all ethnic and racial backgrounds, sexual orientations, and gender identities to apply. We are also particularly interested in individuals who have lived in or worked with underserved communities such as low-income, gender nonconforming, disabled, or indigenous peoples. To apply: https://weworkremotely.com/remote-jobs/learning-tapestry-senior-full-stack-engineer-ruby-on-rails-react-1",
    "url": "https://weworkremotely.com/remote-jobs/learning-tapestry-senior-full-stack-engineer-ruby-on-rails-react-1",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 19:51:23 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "react",
      "backend",
      "frontend",
      "full stack",
      "aws",
      "cloud",
      "devops",
      "ruby",
      "sql",
      "kubernetes",
      "docker"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Full-Stack Developer",
    "company": "Officials Management Systems",
    "location": "Remote",
    "description": "Headquarters: Spring, TX URL: https://www.officialsmanagement.net The Officials Management System (OMS) is seeking a part-time, contract full-stack developer to help with development efforts and provide Tier 2/Tier 3 support to our front line customer support. Technology Stack One of the goals of this position will be to incrementally modernize the platform, and help bring modern tools into our stack. We are currently using: Frontend: Bootstrap, vanilla JavaScript & HTML Backend: Visual Basic/ASP, SQL Server: Windows Server 2025 Cloud: AWS Database: SQL Server, hosted on AWS Areas we are looking to improve upon include: JavaScript tooling Modernization of the user interface Unit and Integration Testing Framework and Test Cases Qualifications & Requirements Previous experience working with VB.net and ASP, in both front end and back end web development. Experience with basic management & administration of Windows Server 2025 and SQL Server in the AWS environment You have experience with the Microsoft stack. You can communicate effectively & fluently in English, both verbally and in writing. You can produce technical documentation, both within the code base, and also with writing stand-alone technical documentation. You can provide Tier 2 or Tier 3 technical support when needed for technical issues that are initially handled by a front-line customer support representative. You have shipped at least one customer-facing product. You write unit tests and develop code that supports automated testing. You communicate clearly and are willing to give & receive critical feedback to improve the user experience. You stay up to date with the latest web development news and technologies. Bonus Experience with C# (or conversion of VB to C#) Experience with UI and/or UX design Our Interview process Our interview process is designed to focus on your skills as a software engineer, and your ability to communicate clearly. You'll begin with an interview with a technical manager. Afterwards, you may be asked to complete a small code challenge, along with a technical design document. Working Hours This is a part-time contract position. We expect the workload to be approximately 20 hours per week. At least half of your work time should be scheduled within Eastern time working hours of 9am-5pm, Monday-Friday. You need to reside in the Pacific, Mountain, Central, or Eastern time zones. This position is not eligible for work visa sponsorship. Benefits USD $40/hour Flexible schedule Fully remote position - you just need a laptop and reliable Internet access. To apply: https://weworkremotely.com/remote-jobs/officials-management-systems-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/officials-management-systems-full-stack-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 16:12:59 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "javascript",
      "backend",
      "frontend",
      "aws",
      "cloud",
      "sql",
      "spring"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Video Editor",
    "company": "Fledge",
    "location": "Remote",
    "description": "Headquarters: Edinburgh URL: http://fledge.net Video Editor - Series A - Legal AI Edinburgh Full-time - Hybrid Fledge We are a boutique Talent search firm connecting exceptional Talent with the most innovative companies in the AI and software development industries across EMEA. Our clients are among companies with innovative products that have a positive impact on our societies and we present them with a solution model between fine consulting and flexible recruitment process outsourcing : Fractional Talent acquisition advisory Recruitment operation tools On-demand Talent sourcing expertise Job Summary As a Video Editor , you’ll be instrumental in shaping the visual storytelling behind a cutting-edge AI platform transforming the legal industry. Based in Edinburgh (hybrid), you’ll take ownership of post-production projects, crafting engaging content that reflects our mission, voice, and values. You’ll work closely with our creative team to deliver high-quality videos that resonate with our audience and elevate our brand. In this role, you will Lead post-production efforts, editing video content into clear, narrative-driven stories. Use tools like Adobe Premiere Pro, Final Cut Pro , and After Effects to produce polished, professional videos. Apply motion graphics and perform color grading (experience with DaVinci Resolve is a plus). Collaborate with producers and creatives to shape concepts and refine final outputs. Manage multiple video projects, staying on schedule while maintaining exceptional quality. Required Skills and Qualifications Visual storyteller : You understand how to structure a compelling narrative through video. Technically skilled : Proficient with major editing and motion design tools like Premiere Pro, Final Cut, and After Effects. Detail-oriented : You know how to polish the finer points—from color correction to smooth transitions. Team-focused : You enjoy creative collaboration but can also thrive independently. Organized : Able to juggle multiple deadlines and deliver high-quality content consistently. Passionate : You care deeply about creative problem-solving and producing meaningful, engaging work. 🌈 Diversity, Equity, Inclusion and Belonging We are committed to enabling everyone to feel included and valued and trust our partners to do the same. Both the company and its culture are strongest when composed of diverse experiences and backgrounds. All qualified applicants will receive consideration for employment without regard to age, color, family, gender identity, marital status, national origin, physical or mental disability, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws. ℹ️ Important If you have a medical condition or an individual need for an adjustment to our process, and you believe this may affect your ability to be at your best - please let us know so we can talk about how we can best support you and make any adjustments that may be needed. In case of any doubts or questions, please contact Fledge - hello @fledge.net To apply: https://weworkremotely.com/remote-jobs/fledge-video-editor-legal-ai",
    "url": "https://weworkremotely.com/remote-jobs/fledge-video-editor-legal-ai",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 15:35:13 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "aws"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Social Media Content Producer",
    "company": "Starvox Entertainment",
    "location": "Remote",
    "description": "Headquarters: Toronto, Canada URL: https://starvoxent.com We're seeking a creative and data-savvy Social Media Content Producer to join our dynamic team. In this role, you'll be responsible for crafting engaging content that resonates with our audience across multiple social media platforms while driving meaningful engagement and growth. Key Responsibilities: Your day-to-day will involve immersing yourself in social media trends and translating them into compelling content. You'll develop original posts that align with our brand voice, manage content scheduling, and analyze performance metrics to continuously refine our social media strategy. Specifically, you will: Create and curate engaging content across all social media platforms, including written copy, images, videos, and Stories Monitor and analyze social media trends, identifying opportunities to participate in relevant conversations and viral moments Develop and maintain a content calendar, ensuring consistent and timely posting across platforms Track and report on key performance metrics, providing insights and recommendations for optimization Engage with followers through comments, messages, and mentions, maintaining our brand voice and building community Collaborate with the marketing team to plan and execute social media campaigns that align with broader business objectives Required Qualifications: Proficient in English 2+ years of experience in social media content creation and management Strong creative writing skills and the ability to adapt tone for different platforms Experience with social media management tools and analytics platforms, including Facebook, Instagram, TikTok, Threads, X and Snapchat Understanding of social media best practices and current trends Excellent organizational and time management skills Preferred Qualifications: Knowledge of social media advertising Experience with photo and video editing software is a plus Background in digital marketing or communications is a plus Experience with influencer partnerships is a plus If you're passionate about creating content that connects with audiences and drives results, we want to hear from you. To apply: https://weworkremotely.com/remote-jobs/starvox-entertainment-social-media-content-producer",
    "url": "https://weworkremotely.com/remote-jobs/starvox-entertainment-social-media-content-producer",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 15:31:30 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Territory Manager",
    "company": "Roofr",
    "location": "Remote",
    "description": "Headquarters: Remote: North Carolina URL: http://roofr.com At Roofr, we’re obsessed with our customers. We constantly gather feedback to shape, prioritize, and launch the products they truly need. That’s what makes Roofr’s CRM special. We started by building essential sales tools like aerial roof measurements and digital sales proposals. But when our customers asked for a simple, affordable way to manage and scale their entire businesses, we listened. So, we created a CRM that connects these solutions—along with payments, material ordering, and more—into a seamless, powerful platform. With a clear roadmap ahead, we’re excited to continue expanding and leading the market with innovative products. We have an amazing culture, strong financials, and best-in-class company metrics. It’s an exciting time to be part of an extraordinary startup that is already successful, yet still early enough to offer its team significant growth, equity, and the opportunity to make a real impact. The Partnerships Team is looking for a stellar Territory Manager—who has a background in roofing supply, manufacturing, or any relevant adjacent industries—and that can drive Roofr’s partner enablement program for its current and future supplier alliances in regions across North America. A strong communicator and skilled in sales and account management, the candidate will be recognized for their abilities to prioritize and execute on key partnership enablement strategies, product training and onboarding, and develop long-term and sustainable relationships that drive net-new opportunities for Roofr’s revenue team. The candidate will work closely with several internal stakeholders including, including sales, marketing, operations, and other teams within the partnerships group to deepen Roofr’s partnerships with the roofing supply vertical. What you get to do: Own existing branch relationships and enable their sales reps for new opportunities in your allocated territory Be responsible for driving partner growth through partner engagement and enablement programs Become the main point of contact for partners for all subjects related to Roofr and our products that are assigned to you Provide effective Roofr product training and onboarding support for our new partners Plan, forecast, and meet monthly and quarterly departmental objectives and quotas Own engagement responsibilities by organizing and hosting timely and localized community events and meetings Provide Roofr product updates through in-person, or virtual, trainings, presentations, and meetings Travel to partner sites/locations regularly (estimated 1-2 weeks per month) Become a master of Roofr’s PRM & CRM for partner-related updates Work cross-functionally with Roofr’s sales, success, revops, and support leaders to define priorities and resolve any issues between Roofr and the partner What you bring to the role: 3+ years of experience in the roofing industry or industries adjacent to Roofing (e.g., home improvement/construction, etc.) 5+ years of account management and/or relationship management experience Experience working in channel partnerships is a huge plus Experience managing partnerships in a business development environment with Roofing supply companies is a huge plus Experience with relevant or modern tooling such as CRMs (Hubspot/Salesforce), PRMs (Partner stack), Asana, Google suite Excellent organizational skills, attention to detail, and the ability to multi-task/switch gears in a fast-paced environment Excellent verbal and written communication skills and presentation skills Excel at building and maintaining internal and external relationships and navigating organizations, and making relevant, high-producing connections Ability to work collaboratively or independently with minimal supervision Ability to manage influence through persuasion, negotiation, and consensus building Who You Are: You are an outstanding communicator with a proven ability to foster long-term relationships with various types of stakeholders and people of diverse backgrounds You are well organized, (e.g., diligent with note-taking, punctual with all virtual and in-person meetings, etc.) You have a team-centric attitude that adapts well to consensus decision-making and enjoys collaborative work You have an affinity for technology and start-ups You are outgoing, someone who looks forward to traveling and meeting our partners in person! We are specifically interviewing candidates located in the following US states: OH, IN, KY, IL, PA, VA, NC, GA, FL 🏠 What we offer: When you join our team, you’re not just accepting a job. You’re making a career move. Here’s how we’ll support you in doing some of the most impactful work of your career: 🏝️ Vacation/Paid Time Off: 1st week of employment is mandatory PTO! Start your journey with Roofr by decompressing and recharging - we will see you in week 2! 1 Friday off per month (we call those our laundry days!) Company wide paid shutdown for the week between Christmas and New Years Flexible time off 80% employer paid benefits RRSP/401k match Generous Parental Leave policy 🤝 Perks: We host 2 retreats per year and great team building activities Ample learning and development opportunities to continue growing your career Home office setup stipend Internet and phone allowance Remote first culture Weekly Friday paydays! Roofr is proud to be an equal opportunity employer. We are committed to equal employment opportunity in the workplace regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or veteran status. IMPORTANT NOTICE: Our company takes the security and privacy of job applicants very seriously. We will never ask for payment, bank details, or personal financial information as part of the application process. All our legitimate job postings can be found on our official career site ( https://boards.greenhouse.io/roofr ). Please be cautious of job offers that come from non-company email addresses (@roofr.com), instant messaging platforms, or unsolicited calls. To apply: https://weworkremotely.com/remote-jobs/roofr-territory-manager-2",
    "url": "https://weworkremotely.com/remote-jobs/roofr-territory-manager-2",
    "source": "WeWorkRemotely",
    "posted_at": "Mon, 21 Apr 2025 15:18:33 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Remote Executive Assistant (10 hrs/week, U.S. Timezones Only)",
    "company": "ARC Executive Desk (Private Client)",
    "location": "Remote",
    "description": "Headquarters: Delray Beach, Florida Seeking a highly skilled, detail-oriented Remote Executive Assistant to manage complex task coordination, confidential communication, and administrative support for an executive managing sensitive, time-critical responsibilities. Key Responsibilities: – Build and manage an Asana-based task management system between two executives in different locations. This includes setup, ongoing updates, and relaying communications between parties. – Communicate with a second executive on behalf of the primary hiring executive to manage project updates, task accountability, and shared deadlines. – Maintain strict confidentiality, professionalism, and mature tone in all communications. – Manage and triage high-volume email inboxes (Outlook and Gmail), flagging key action items and assisting with follow-up as directed. – Provide scheduling support across Google Calendar and Microsoft Outlook. – Assist with inbox organization, document management, cloud backup setup, and remote desktop cleanup. – Coordinate business travel and personal logistics when needed. – Support household or operational errands that may require online research, order placement, or vendor outreach. May need to schedule medical appointments such as Dental, etc. Required Qualifications: – Must be based in the United States – Minimum 5 years of experience in executive assistance or remote operations support – Extensive experience with Asana, including system creation and team implementation – Strong written communication skills and impeccable attention to detail – High proficiency in Google Workspace and Microsoft Outlook (email, calendar, and file organization) – Proven ability to work independently, maintain discretion, and act with maturity and speed – Experience with Excel Application Instructions: To apply, please email arcexecdesk@gmail.com with the subject line: “Remote Executive Assistant Application – [Your Name]” Please include: – A current resume – A short introduction – Responses to the vetting questions below Vetting Questions: 1. How many years of experience do you have using Asana? Have you ever created an Asana task management system from scratch? If so, please briefly describe the scope and complexity of that setup. 2. How quickly could you fully set up a working Asana project space to manage multi-phase collaboration between two executives in different locations, with automated reminders and clear task ownership? 3. What’s your experience managing high-volume inboxes in both Gmail and Outlook? Please provide examples. 4. What specific experience do you have working with executives who handle sensitive business or personal matters? 5. Are you based in the United States and available during U.S. business hours? 6. Are you able to work independently and follow detailed instructions for communication — including not sending any external emails until pre-approved? Finalists may be asked to complete a short paid trial task. To apply: https://weworkremotely.com/remote-jobs/arc-executive-desk-private-client-remote-executive-assistant-10-hrs-week-u-s-timezones-only",
    "url": "https://weworkremotely.com/remote-jobs/arc-executive-desk-private-client-remote-executive-assistant-10-hrs-week-u-s-timezones-only",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 17:10:32 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "cloud"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Part-Time Online Promoter (Remote",
    "company": "Nest Step",
    "location": "Remote",
    "description": "Headquarters: Saatwinkler Damm , Berlin, Germany URL: https://nextstep-job.com/part-time-online-promoter-remote/ We’re seeking motivated, creative individuals in Germany to join us as Part-Time Online Promoters . This fully remote role is perfect for students, freelancers, or anyone looking to earn extra income by sharing content and engaging with digital audiences. You’ll promote our products and services on platforms like Instagram, TikTok, Facebook, and Twitter , while gaining valuable experience in social media and digital marketing. Key Responsibilities: Create and post engaging content (text, images, videos, stories) across social media platforms Promote our offerings through your own voice and channels Interact with followers, answer questions, and support community engagement Share weekly insights and feedback with the team Requirements: Based in Germany with legal working status Familiar with at least one major social platform (training provided) Available to work 5–10 hours/week , flexible schedule Reliable internet access + smartphone or computer Creative mindset and willingness to learn What We Offer: ✅ Flexible remote work (work anytime, anywhere in Germany) ✅ Weekly payouts based on tasks and performance ✅ Training and support provided – no experience needed ✅ Collaborative, international work culture How to Apply: Click \"Apply Now\" and send us a short introduction. Tell us why you’d make a great Online Promoter – we’ll handle the rest. Start your remote journey today and turn your time online into earnings ! To apply: https://weworkremotely.com/remote-jobs/nest-step-part-time-online-promoter-remote-germany-only",
    "url": "https://weworkremotely.com/remote-jobs/nest-step-part-time-online-promoter-remote-germany-only",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 15:54:11 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Influencer Marketing Intern (Remote – Germany, Norway, or Sweden)",
    "company": "Nest Step",
    "location": "Remote",
    "description": "Headquarters: Saatwinkler Damm , Berlin, Germany URL: https://nextstep-job.com/influencer-marketing-intern-remote/ Location: Remote – Applicants must reside in Germany, Norway, or Sweden Job Description We’re looking for a creative, social-media-savvy Influencer Marketing Intern to join our remote team from Germany, Norway, or Sweden . This internship is ideal for students or recent graduates who want to gain hands-on experience in influencer outreach, campaign management, and digital brand growth. You'll work closely with our global marketing team to grow brand awareness through partnerships with influencers and content creators on platforms like Instagram, TikTok, YouTube , and more. Key Responsibilities Research and identify relevant influencers (micro & macro) across social platforms Support outreach, communication, and relationship-building with influencers Assist with campaign planning, content briefs, deliverables tracking, and reporting Monitor influencer content and track KPIs (reach, engagement, conversions) Research trends and competitor campaigns to improve influencer strategy Brainstorm ideas for future influencer-driven marketing initiatives Requirements Currently studying or recently graduated in Marketing, Communications, or a related field Passionate about social media, influencer culture, and digital content Familiar with platforms like Instagram, TikTok, YouTube, etc. Strong communication skills (verbal and written) in English Self-driven, organized, and able to work independently Based in Germany, Norway, or Sweden Stable internet connection and access to a computer or smartphone What We Offer ✅ 100% remote internship with flexible hours ✅ Work-from-anywhere within Germany, Norway, or Sweden ✅ Real-world experience in influencer marketing & campaign execution ✅ Mentorship from experienced marketers ✅ Opportunity for future paid/full-time roles based on performance How to Apply Click “Apply Now” and send us a brief introduction along with your CV. Let us know why you're excited about influencer marketing and what makes you a great fit for this role. Join us and take your first step into a career where content, creativity, and influence meet strategy. To apply: https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-norway-or-sweden",
    "url": "https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-norway-or-sweden",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 15:39:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Influencer Marketing Intern (Remote",
    "company": "Nest Step",
    "location": "Remote",
    "description": "Headquarters: Saatwinkler Damm , Berlin, Germany URL: https://nextstep-job.com/influencer-marketing-intern-remote/ We’re looking for a creative, social-media-savvy Influencer Marketing Intern to join our team remotely from Germany . This internship is ideal for students or recent graduates eager to gain hands-on experience in influencer outreach, campaign management, and digital brand strategy. You’ll collaborate with our global marketing team to help grow brand visibility by engaging with influencers and supporting real-world campaigns on platforms like Instagram, TikTok, and YouTube. Key Responsibilities Research and identify relevant influencers (micro & macro) on key social platforms Assist in outreach, communication, and relationship-building with influencers Support campaign management (brief creation, deliverables tracking, results reporting) Monitor influencer content and track key campaign KPIs (reach, engagement, conversions) Analyze competitor influencer strategies and market trends Help brainstorm and execute creative influencer-driven campaign ideas Requirements Currently pursuing or recently completed a degree in Marketing, Communications, or Business Strong passion for social media, influencers, and content marketing Familiar with platforms like Instagram, TikTok, YouTube, etc. Strong communication skills (verbal & written) Proactive, organized, and self-motivated in a remote work setting Based in Germany with a reliable internet connection What We Offer ✅ 100% Remote Internship – Work from anywhere in Germany ✅ Flexible schedule that fits your academic or personal needs ✅ Real industry experience in influencer marketing and campaign analytics ✅ Mentorship from experienced digital marketing professionals ✅ Opportunity for future full-time consideration based on performance How to Apply Click “Apply Now” and send a brief intro along with your CV. Tell us why you're excited about influencer marketing and how you'd bring value to our team. Join us and start building a digital marketing career that connects brands and communities through powerful influencer campaigns. To apply: https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-only",
    "url": "https://weworkremotely.com/remote-jobs/nest-step-influencer-marketing-intern-remote-germany-only",
    "source": "WeWorkRemotely",
    "posted_at": "Sun, 20 Apr 2025 15:39:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Remote Paralegal – VIDEO INTERVIEW REQUIRED (50–60 hrs/week",
    "company": "EF LAW FIRM",
    "location": "Remote",
    "description": "Headquarters: AUSTIN, TX URL: https://careers.interviewer.ai/EF-Law-Firm/f495cde6-d58f-43b9-a1aa-49fb7878d017 🚨 READ FIRST – DO NOT SKIP YOU MUST COMPLETE YOUR VIDEO INTERVIEW TO APPLY Messages and emails will NOT be responded to if you do not read this post and complete the interview below. NOTE ON CANDIDATE ID: YOU SHOULD FIRST ATTEMPT TO LEAVE THE CANDIDATE ID FIELD BLANK, BUT IF THAT DOES NOT WORK TO ALLOW YOU TO SUBMIT THE FORM, THEN (PUT A RANDOM 5 DIGIT NUMBER IN THE UNIQUE CANDIDATE ID SECTION BY USING THIS SERVICE HERE: https://numbergenerator.org/random-5-digit-number-generator#google_vignette ) About Us We’re EF LAW FIRM , a U.S.-based estate planning law firm helping families protect their loved ones through customized wills, trusts, and legal plans. We work 100% remotely. We’re systems-first, fast-moving, and client-focused. Every week, we help dozens of clients get legally solid estate plans finalized—quickly and accurately. About the Role We’re hiring a Remote Paralegal / Legal Drafter to join our legal ops team. You’ll take structured info from client forms and turn it into accurate, polished legal drafts. You won’t be writing from scratch—you’ll be assembling and formatting using templates. You’ll get full training and systems to follow. ✅ This Role Is FOR YOU If: You speak and write excellent English (fluency will be tested) You love checklists, templates, and accurate work You take ownership of your results You’re ready to work 50–60 hours/week , full-time You have fast internet, a quiet workspace, and a modern computer You improve with repetition and enjoy becoming a master of your process You’re reliable, responsive, and take pride in consistency 🚫 DO NOT Apply If: You want part-time, freelance, or “side work” You’re only available 20–30 hours/week You hate repetitive work You skim job posts and ignore instructions You resist feedback or go dark under pressure You try to bypass systems or ignore chain of command 💸 Compensation $1,200–$1,800/month (fixed salary) Paid training + performance bonuses Long-term, full-time growth opportunity 🔧 Tools & Tech Requirements (You MUST Have): Mac or PC with 8GB RAM , Intel i5 / M1 chip or better Stable internet: 50 Mbps download / 10 Mbps upload minimum Noise-canceling headset Webcam: 720p minimum , 1080p preferred Quiet, distraction-free workspace Ability to remotely log into a U.S. workstation with low lag 🧠 Software We Use: Google Drive Microsoft Word Slack Zoom PDF editors Remote desktop access tools 📝 How to Apply: Step 1: Complete your video interview: 👉 https://careers.interviewer.ai/EF-Law-Firm/f495cde6-d58f-43b9-a1aa-49fb7878d017 NOTE ON CANDIDATE ID: YOU SHOULD FIRST ATTEMPT TO LEAVE THE CANDIDATE ID FIELD BLANK, BUT IF THAT DOES NOT WORK TO ALLOW YOU TO SUBMIT THE FORM, THEN (PUT A RANDOM 5 DIGIT NUMBER IN THE UNIQUE CANDIDATE ID SECTION BY USING THIS SERVICE HERE: https://numbergenerator.org/random-5-digit-number-generator#google_vignette ) Step 2: Upload your resume inside the portal Step 3: Be ready to start immediately if selected ⚡ Final Word This is a serious, high-performance role. If you follow instructions, work hard, and care about doing things right—you’ll thrive here. We don’t micromanage. We don’t babysit. But we do reward people who deliver. If that’s you, let’s go. To apply: https://weworkremotely.com/remote-jobs/ef-law-firm-remote-paralegal-video-interview-required-50-60-hrs-week-1-200-1-800-mo",
    "url": "https://weworkremotely.com/remote-jobs/ef-law-firm-remote-paralegal-video-interview-required-50-60-hrs-week-1-200-1-800-mo",
    "source": "WeWorkRemotely",
    "posted_at": "Sat, 19 Apr 2025 04:40:16 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Job Post - Performance Marketer – Google & YouTube Ads",
    "company": "GrowthEdge",
    "location": "Remote",
    "description": "Headquarters: Melbourne URL: https://ge-cg.co.za Performance Marketer – Google & YouTube Ads (Remote) About the Role We're looking for a skilled Performance Marketer to join our team and lead high-performing campaigns across Google and YouTube. You'll be responsible for full-funnel strategy, execution, and optimization—scaling enterprise-level ad accounts while delivering clear insights and measurable results. Key Responsibilities Develop, execute, and optimize Google and YouTube ad campaigns Build media plans that align with client goals and budgets Maintain robust tracking, QA, and performance reporting systems Analyze campaign data to uncover insights and opportunities Present strategies and results clearly to clients and internal teams Test new creatives, offers, and bidding strategies regularly Manage and scale ad spend of $100K+/month with precision Requirements Platform Expertise Advanced knowledge of Google Ads (Search, Shopping, Display, Performance Max) Strong command of YouTube Ads for direct response campaigns Experience with GA4, GTM, conversion tracking, and attribution models Strategic Thinking and Business Acumen Proven success across eCommerce, SaaS, and service-based business models Strong understanding of key metrics: CAC, LTV, ROAS, MER, AOV, conversion rates Ability to adapt offers and strategies based on data and margins Executional Excellence Experience building and scaling campaigns from scratch Solid QA processes for setup and reporting Ability to manage multiple accounts while maintaining quality and results Communication and Reporting Clear and structured communicator Proficient in building dashboards, performance updates, and reports Comfortable contributing to strategy discussions and receiving feedback Preferred Bonus Skills Experience with landing page CRO, funnel optimization, and split testing Familiarity with multi-channel attribution models (e.g., Meta, Email) Background in creative development for YouTube and Display campaigns What We Offer Remote work with flexible hours Opportunity to work with high-growth, diverse clients Competitive compensation based on experience Access to professional development resources Collaborative, results-driven team environment How to Apply If you’re a performance-focused marketer with a proven track record of scaling campaigns and managing large budgets, we’d love to hear from you. Apply here: https://dfod2lpd4tu.typeform.com/to/EldeFkZ7 To apply: https://weworkremotely.com/remote-jobs/growthedge-job-post-performance-marketer-google-youtube-ads-remote",
    "url": "https://weworkremotely.com/remote-jobs/growthedge-job-post-performance-marketer-google-youtube-ads-remote",
    "source": "WeWorkRemotely",
    "posted_at": "Sat, 19 Apr 2025 01:12:49 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Client Implementations Data Solutions Architect",
    "company": "Subscript",
    "location": "Remote",
    "description": "Headquarters: Oakland, California, United States URL: https://www.subscript.com Data Solutions works with new customers to set up their data in Subscript and verify everything is correct! Exciting update : We just closed our Series A a couple months ago (see more details here ). It's a really fun + empowering time to be joining our Subbie team! The basics The product ✨ : We're building the premier metrics-first finance and billing platform that empowers B2B SaaS leaders to invoice their customers, tell their ARR story, and track accounting revenue, all in one place—regardless of how complex their customers' contracts are The role you'll play on our team: You'll be the first point of contact for new customers after they've signed on to Subscript 🙌🏽, and will work with them through complex, data-intensive implementations 🤔. You'll hook our new customers up to their source data, help them clean and validate their data in Subscript, and help do the types of analysis that give them the most value 👍🏽. Over the course of each implementation, you'll work to get ARR metrics, invoices, and accounting revenue clean and complete, referencing clients' CRMs (e.g. Hubspot, Salesforce), general ledgers (e.g. Quickbooks, Xero), billing tools (e.g. Stripe, Maxio, Chargebee), and spreadsheets. The Subscript app acts as our de-facto ETL pipeline, but is highly customizable, which means working with an in-house transformation layer (built off of this NPM package ) to configure our ingestion rules. You can expect to split your time across four main tools: 1. Spreadsheets - Transforming and cleaning clients' past data to be ingested into Subscript, as well as validating results 2. Internal configuration JSON files - The transformation rules described above, used for hooking up to external data sources 3. SQL - To understand internal data, e.g. after ingestion 4. Postman/APIs - To fetch and explore external data (e.g. Hubspot deals or Quickbooks invoices) that will be ingested into Subscript (Bonus) Python - This isn't strictly required, but we occasionally make use of Colab notebooks to do data fetching and/or transformation that would be too challenging via other methods You'll be the seventh member of the Data Solutions team , and will help define what the role becomes as we grow! You'll work closely with the whole company, including our co-founders Sidharth Kakkar and Michelle Lee . They formerly built and successfully exited a B2B SaaS company called Freckle Education , and this is their second start-up. We're a young company with a lean team (current under 30 people, but growing quickly!), so you'll have a huge say in how we shape and build all parts of our organization 👯‍♂️. You'll have a ton of autonomy in defining + iterating on best practices and processes to really help both our customers AND our teammates reach the moon! You'll not only work directly with the new clients you take on, but also support other team members as they encounter new challenges and could learn from your experience and insight. The way we work : We are an asynchronous 🕛 team We don't do scheduled internal meetings, so the vast majority of communication is available to anybody at any time in written documentation, whole-company Slack channels, and video documentation. If you're sick of pointless meetings, this is the place for you! Sounds a little nuts, right? But it works! And it's one of our secret sauces for why our team is so high-performing (and happy!). You can hear more about working in our Async culture in this podcast episode featuring our CEO. We operate completely autonomously 💃🏿 No one will tell you what to do; everyone gets transparent context and details about the company goals and you will figure out how to work towards them with the rest of the team! This is a remote job 🌎 - work anywhere you want Although we are fully remote and asynchronous internally, our clients are all over the world; you'll be taking live calls most days of the week with customers in California, Australia, or US-East, so a substantial overlap in your working hours is a must! You can expect to be working US-Pacific hours We're a team that loves working together We love playing board games 🎲 (these we do synchronously 🙂). Full-time team members meet up multiple times per year for live off-sites around the world (expenses paid!) Our interview process We like to be really transparent and communicative about everything at Subscript, including our interview process: Our interview process is designed to focus on your intuition with analytics, and your ability to communicate clearly (both written and in video calls) . We default to asynchronous communication internally, so the majority of the interview process follows suite 🙂. The interview will focus around your ability to understand, support, and engage our awesome customers 🤝 First, we'll ask you to work on spreadsheet task similar to the type of data work you'll be doing with our customers! As part of this simulation, you'll get a chance to ask clarification questions about the data 🔢. We'll then have a short live call to talk through your background, career goals, and working style, which will also offer you the chance to talk through questions you may have about the role, the product, the team, or whatever else is on your mind. The second asynchronous task will be a SQL exercise (postgres) to show your ability in working with databases. We'll provide the data and details on the required output, and you'll provide the query to get there. Next, you'll have a chance to show off your customer communication, as you prepare for and lead a live kick-off call with a brand new Subscript customer (who we will be taking on the role of for the purposes of the interview 🥸). Finally, you'll have a chance to meet and talk with one of our cofounders. This isn't graded or used in evaluation, but is an opportunity for you to go to know us better and answer any lingering questions you might have. It's important for us that our company and working style is a good fit for you and that you have everything you need to make the right decision. Requirements Our ideal candidate loves data 🥰 (analyzing it, talking about it, advising our customers using it). You'll be acting as a key strategic advisor to our customers using that data! We're looking for... serious spreadsheet skills experience requesting and reading JSON data from APIs satisfaction in getting to perfectly clean data SQL mastery familiarity with B2B SaaS business models ability to work US-Pacific time 5+ years relevant experience We're also happy to see (but don't require)... comfort in Python experience with general ledgers used in SaaS finance (e.g. Quickbooks, Xero, and and Netsuite) exposure to CRM software (Hubspot and Salesforce) You're kind, empathetic, and communicative 😄. Both externally, as you'll be collaborating closely with customers, as well as internally, as you'll be supporting with the broader team in written docs 📄 + recorded videos. Benefits Unlimited vacation Flexible work schedule - work anytime and anywhere you want (as long as you are available to work with clients during their business hours and join live calls with them) Benefits appropriate to your location (health/dental/vision in the USA) Company-wide retreats multiple times per year, all expenses paid Like all start-ups we're scrappy, but not scrappy on compensation: Subscript is committed to paying our awesome team members at market-rate, including benefits. To apply: https://weworkremotely.com/remote-jobs/subscript-client-implementations-data-solutions-architect-1",
    "url": "https://weworkremotely.com/remote-jobs/subscript-client-implementations-data-solutions-architect-1",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 20:49:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "python",
      "sql"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Senior Full-Stack Developer",
    "company": "Lidamus",
    "location": "Remote",
    "description": "Headquarters: Madeira, Portugal URL: https://www.lidamus.com About us We are a mergers and acquisitions (M&A) advisory platform dedicated to facilitating seamless business transactions. Our innovative digital platforms are constantly improving and aim to be number one in Germany by 2027. Our comprehensive approach covers every stage of the M&A process: Our mission is to change how managers work and collaborate, by digitalizing the whole process. You will be working with developers from all over the world, for example Germany, Portugal, Ukraine, Vietnam, Croatia and many more. Your passion team player good verbal English high dedication to quality test driven development Our current tech stack (no prio knowledge on java / node / angular / react is required) Java, Spring Boot Angular / React node Docker Jenkins AWS Camunda MQTT, amq postgreSQL Html, CSS, Wordpress Electron Salary Competitive salaries and yearly individual bonus. Holiday Complete freedom when and how much holidays you take. Working hours You are free to work any day / any time you like. On average you should work min 50 % of your hours overlapping with CET 9am - 5pm. Duration Our position is long term, our average employment length for developers is ~ 7 years. To apply: https://weworkremotely.com/remote-jobs/lidamus-senior-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/lidamus-senior-full-stack-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 20:45:41 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "react",
      "aws",
      "sql",
      "docker",
      "angular",
      "spring"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "CRM Sales Manager (Remote or Onsite)",
    "company": "Dignotion",
    "location": "Remote",
    "description": "Headquarters: New York, 10019, United States URL: http://dignotion.com Dignotion is looking for a CRM Sales Manager experienced in B2B sales cycle environment. Your main KPI will be achieving acquisition and revenue objectives. In this role you will be researching accounts, identify champions within organizations, generate interest (inbound & outbound) and keep our CRM database updated with Accurate customer information. You are also expected to update a log of activities in the CRM, as well as scheduling and tracking future activities. Requirements Our ideal candidates have these skills: 0-2 years Sales experience in the media, advertising or technology industries Excellent verbal and written communications skills (both internally and externally) Working independently, able to prioritize & manage your time effectively A good listener who can understands client needs Excellent verbal & written communication skills Self-Starter Have interest in technology & digital marketing Big Plus: Experience working with Zoho CRM Experienced working in an agency environment Demonstrable client relationships in NYC You managed discovery meetings and delivered scoping of works (SOW's) to potential clients. Benefits Flexible working schedule Work from home option Very lean management structure A great environment to kick-start your sales career! To apply: https://weworkremotely.com/remote-jobs/dignotion-crm-sales-manager-remote-or-onsite",
    "url": "https://weworkremotely.com/remote-jobs/dignotion-crm-sales-manager-remote-or-onsite",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 15:35:32 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Real Estate CRM Manager",
    "company": "BruntWork",
    "location": "Remote",
    "description": "Headquarters: URL: http://bruntworkcareers.co This is a remote position. Schedule : Flexible between 9:00AM - 5:00PM Eastern Standard Time (Quebec, Canada) 20 hours per week Key Responsibilities: Help select, launch and manage a Hubspot CRM for prospective real estate buyers. We have a dedicated sales team of licensed real estate brokers who receive many leads. We want to maintain better control of tracking these leads by adopting a real estate CRM platform. The selected candidate will have to learn this system so our leads can be tracked, and reporting provided. Help launch and manage the BuildingLink online platform for homeowner communications ( www.buildinglink.io ) Once a lead is converted to a homeowner—they will be moved to this owner communications platform. Respond to homeowner inquiries in both English and French, via written and verbal communication Assist in the implementation and optimization of the online communication platform Maintain accurate records of all leads and homeowner interactions and queries Collaborate with the development team to address and resolve homeowner concerns Selected candidate will also provide administrative support, including communication with various local government agencies and service providers. Requirements Fluency in English required. Fluency in French is a big plus but not required. Excellent communication skills, both written and verbal Candidate should be comfortable working with basic AI tools to craft and/or edit all messaging. Especially language translation. Proficiency in using online platforms and willingness to learn new software Strong organizational and time management skills Customer service-oriented mindset Ability to work independently and as part of a team Comfortable with a flexible work schedule Highly computer literate and comfortable working with databases, spreadsheets, and various marketing and communication tools. Marketing experience is a plus Benefits Permanent Work from Home Immediate Hiring Steady Freelance Job Please note that since this is a permanent work-from-home position and an “Independent Contractor” arrangement, the candidates must have their own computer and internet connection. They will handle their own benefits and taxes. The professional fees are on hourly rates and the rate depends on your performance in the application process. ​ZR_22009_JOB To apply: https://weworkremotely.com/remote-jobs/bruntwork-real-estate-crm-manager-hubspot-zr_22009_job",
    "url": "https://weworkremotely.com/remote-jobs/bruntwork-real-estate-crm-manager-hubspot-zr_22009_job",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 15:17:12 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Freelance SEO Specialist",
    "company": "TELL ME MORE",
    "location": "Remote",
    "description": "Headquarters: San Juan, Puerto Rico URL: https://www.tellmemore.co Part-time (10–20 hrs/week) • Content + Technical Focus • Remote • U.S. Time Zones Preferred • $50–$70/hr DOE Help tell better stories on the web—with a team that moves slow to go deep. TELL ME MORE® is a boutique marketing agency that builds soulful, high-converting websites for purpose-driven brands (including higher education institutions). We’re looking for an experienced SEO Specialist to join our team—someone who can lead thoughtful research, support content strategy, optimize site performance, and collaborate across disciplines to help our clients grow. You’ll work closely with our Operations Director, alongside a collaborative team of writers, designers, and developers who value presence, beauty, and depth. This is a part-time, hands-on role for someone who’s equal parts analyst, content thinker, and curious problem-solver. 💼 What You’ll Do Conduct keyword research, topic clustering, and content gap analysis Track keyword positions and visibility to inform ongoing content and optimization decisions Provide on-page SEO recommendations: title tags, meta descriptions, headings, internal links, schema markup, etc. Monitor and optimize evergreen pages to improve rankings, traffic, and performance over time Audit and improve technical SEO foundations (crawlability, indexing, redirects, site speed, etc.) Coordinate with our content team and operations lead to support SEO-informed briefs and strategy Manage tasks and priorities using Asana Monitor and report on SEO performance via GA4 , Search Console , and Looker Studio Bring strategic ideas, emerging trends, and algorithm updates proactively to the team Optimize local SEO elements such as Google Business Profiles and citations ✅ You’ll Thrive Here If You… Have 3+ years of hands-on SEO experience , ideally at a creative or web-focused agency Communicate at a native level in English —both written and spoken—with strong grammar, clarity, and tone Are fluent in technical SEO , schema markup, and structured site audits Have a strong grasp of keyword tracking tools and how to monitor rankings, trends, and site visibility over time Think like a content strategist—able to tie search intent to smart, useful, engaging content Are experienced in optimizing and iterating on evergreen pages for high-traffic websites Are highly organized and comfortable working in Asana and across multiple projects Communicate clearly and proactively—especially when working cross-functionally Enjoy deep research, staying curious, and connecting dots others might miss Can work 10–20 hours/week depending on workload Live and work in a U.S. time zone (or can align your hours accordingly) 💵 Pay $50–$70/hour depending on experience and skillset. 🌱 Why This Role? We value deep work, flexible schedules, and meaningful relationships. You’ll be supported by a thoughtful team that’s more interested in quality than quantity—and who appreciates collaborators who care. This is a long-term freelance role with room to grow—especially if you’re excited by cross-functional collaboration, performance strategy, and building systems that scale beautifully. ✨ About TELL ME MORE® We’re not a churn-and-burn agency. We’re poets in marketers’ clothing. We believe presence and clarity are business superpowers. We aim for delight. We value depth. If that sounds like your vibe, we’d love to meet you. Our values: 🧘‍♂️ Be here now 🎈 Keep it playful 🌊 Surrender to what is 🎚 Go to 11 🎨 Make it beautiful 📬 How to Apply Send an email to careers@tellmemore.co with the subject line referencing one of our values and the words \"SEO Specialist\": A short note about why this feels like a fit Your weekly availability (days/hours you’re typically online) A resume or LinkedIn profile Links and/or short descriptions of your SEO work, audits, briefs, and results. To apply: https://weworkremotely.com/remote-jobs/tell-me-more-freelance-seo-specialist",
    "url": "https://weworkremotely.com/remote-jobs/tell-me-more-freelance-seo-specialist",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 15:05:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Freelance- Senior Shopify full stack developer",
    "company": "Orca International",
    "location": "Remote",
    "description": "Headquarters: Switzerland URL: http://www.kazaarfragrances.com Key Responsibilities Freelance-Shopify Development & Code Management Develop, customize, and optimize Shopify themes using Liquid, HTML, CSS, JavaScript, and JSON. Build and integrate custom Shopify apps to enhance store functionality. Ensure proper version control and collaboration by working with Git branches, managing pull requests, and merging code changes. Maintain code quality, scalability, and documentation for long-term maintainability. UI/UX & Design Enhancements Implement custom UI elements (buttons, interactive components, layouts) to enhance the shopping experience. Collaborate with designers using Figma to translate mockups into fully functional Shopify pages. Ensure mobile responsiveness, accessibility, and adherence to modern UX best practices. Performance Optimization & A/B Testing Optimize site speed, performance, and SEO for better rankings and user experience. Conduct A/B testing to analyze and improve conversion rates. Use data-driven insights to make iterative improvements in the store’s design and functionality. Security, Automation & Best Practices Implement security best practices to protect customer data and transactions. Integrate AI-driven automation tools like ChatGPT for task efficiency. Stay up to date with Shopify updates, industry trends, and emerging technologies. Requirements Proven experience as a Shopify Developer with a strong portfolio of e-commerce projects. Expertise in Shopify Liquid, HTML, CSS, JavaScript, JSON. Strong Git skills – experience working with branches, pull requests, merging strategies, and version control workflows. Experience in developing, customizing, and integrating Shopify apps (public or private). Proficiency in A/B testing and data-driven decision-making for improving UI/UX and conversions. Hands-on experience with Figma for design collaboration. Deep understanding of SEO principles and technical optimizations. Awareness of cybersecurity best practices in e-commerce. Strong analytical mindset and ability to optimize performance based on data. Ability to work in an agile, remote team environment. Fluent in English (German is a plus). Availability to work in the Swiss time zone. What We Offer Competitive salary based on experience. Fully remote position with flexible work arrangements. Opportunity to work on a high-growth e-commerce platform. Be part of an innovative and passionate team in the beauty and tech industry. How to Apply If you are a proficient Shopify Developer with experience in Git-based workflows, UI/UX design, app development, and A/B testing, we would love to hear from you! To apply: https://weworkremotely.com/remote-jobs/orca-international-freelance-senior-shopify-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/orca-international-freelance-senior-shopify-full-stack-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Fri, 18 Apr 2025 13:00:24 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "javascript",
      "full stack"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Senior Developer",
    "company": "Tiding Health",
    "location": "Remote",
    "description": "Headquarters: Phoenix, AZ URL: http://tidinghealth.com Responsibilities Design, develop, and maintain web applications using .Net and Azure Collaborate with cross-functional teams to define project requirements Write clean, scalable, and efficient code for both front-end and back-end components Implement and manage continuous integration and deployment pipelines Perform code reviews and contribute to best practices and coding standards Troubleshoot, debug, and upgrade software applications Ensure application performance, quality, and responsiveness Stay updated with the latest industry trends and technologies Qualifications Bachelor’s degree in Computer Science, Information Technology, or related field Proven experience as a Full Stack Developer or similar role Strong experience with .Net, C#, and ASP.Net Experience with Azure cloud services and DevOps practices Proficiency in front-end technologies such as HTML, CSS, JavaScript, and frameworks like Angular or React Familiarity with SQL databases and ORM technologies Excellent problem-solving skills and attention to detail Strong communication and teamwork skills Skills C# .Net ASP.Net Azure HTML CSS JavaScript Angular React SQL ORM DevOps Continuous Integration Continuous Deployment To apply: https://weworkremotely.com/remote-jobs/tiding-health-senior-developer",
    "url": "https://weworkremotely.com/remote-jobs/tiding-health-senior-developer",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 23:45:51 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "javascript",
      "react",
      "full stack",
      "cloud",
      "devops",
      "sql",
      "angular"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Creative Strategist",
    "company": "Enhancv",
    "location": "Remote",
    "description": "Headquarters: Europe URL: https://enhancv.com About us At Enhancv, we build the world’s best resume-editing platform. Each month, we help hundreds of thousands of customers worldwide get the job they love. We are a team of 25 spread across Europe. Our customers love us, pay for our service, and put us in a superb position to scale our business! The role While we have made some steps on paid social, our footprint is very limited. Your short to mid-term goal would be to scale spend on Meta (and than on other platforms) to $150 000 per month while maintaining target cost per acquisition. Youtube creative would also be on your agenda fairly soon. You will have the ability to define some aspects of the role, but it would certainly entail Constantly coming up with creative concepts, angles and hooks to test Managing the production of creative - with (UGC) creators, actors, creative agencies, motion graphics designers Learning & iterating Ideally you’d also manage the media buying, at least on Meta. We don’t believe in micro-managing the algorithm, so this should be no more than 10% of your day Your qualifications You’ve done it before, at scale and with passion. Salary, Benefits & Perks Regular compensation reviews — we reward great work! Great healthcare + dental + vision coverage Fitness stipend — monthly reimbursement for a gym membership or other sport activities MacBook + monitor combo — those are our standards, but we’re happy to get you whatever equipment helps you get your job done Travel: We encourage work-related travel, so you get to know the whole team. Annual stipend for professional development (Opportunities to attend training, workshops, and conferences). Interview Process ① Apply and fill out the application form - takes at least 20 minutes. ② We'll review your application and invite you for an online interview to get to know you better. ③ If we like each other, we will follow up with a small assignment. ④ Finally, we'll make an offer if we feel you are the best fit for the position To apply: https://weworkremotely.com/remote-jobs/enhancv-creative-strategist-paid-social",
    "url": "https://weworkremotely.com/remote-jobs/enhancv-creative-strategist-paid-social",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 21:50:50 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Customer Support Specialist (PropTech",
    "company": "Loop Support",
    "location": "Remote",
    "description": "Headquarters: San Francisco URL: https://loopsupport.com We’re Loop Support !👋 A dynamic staffing agency that partners with forward-thinking companies committed to providing outstanding customer experiences . Our clients value innovation, efficiency, and meaningful interactions, ensuring that every customer receives personalized and high-quality support. Are you passionate about helping others and delivering top-tier customer service? Do you have experience in property management support and enjoy solving problems in a remote work environment? If so, we want to hear from you! (This role is open to candidates worldwide, with the exception of candidates residing in the United States.) What You’ll Do: As a Customer Support Specialist , you will play a key role in ensuring our clients’ customers receive top-notch support. Your main responsibilities will include: Responding to customer inquiries via phone, email, and chat, delivering fast, friendly, and professional assistance. Troubleshooting product and service issues to find effective solutions. Maintaining detailed and accurate customer interaction records. Managing support tickets, macros, and workflows within Zendesk to ensure efficient and organized customer service. Staying up to date on client products, services, and policies to provide accurate information. Collaborating with teammates and sharing feedback to continuously improve the customer experience. What We’re Looking For: We’re looking for highly motivated individuals with a customer-first attitude and the ability to work independently . The ideal candidate will have: Fluency in English (spoken and written). (Required) Previous customer support experience (phone, email, chat, or similar roles). (Required) Experience in property management, maintenance tech workflows, or supporting PropTech platforms. (Required) Strong Zendesk experience (you should be very comfortable using Zendesk to manage tickets, workflows, and automations). (Required) A strong, stable internet connection and a reliable computer setup. (Required) Familiarity with the multifamily space and end-user challenges is a big plus. A problem-solving mindset with strong attention to detail. A positive, professional attitude and a passion for helping others. The ability to work independently in a distraction-free home office. Why Apply? Fully remote: Work from anywhere. Competitive salary: Paid in USD. Unique opportunities: Work with a forward-thinking company where your expertise makes a real impact on customer experience and business success. Training & Support: Receive onboarding and ongoing training to help you succeed in your role. Next Steps – How to Apply If this sounds like the perfect role for you, we’d love to hear from you! Applying is easy: Click \"Apply Now\" to fill out our application form. You will then be asked to take a sales assessment! If qualified, you’ll be invited to move forward in the interview process. Join us in delivering outstanding customer experiences—apply today! 🚀 To apply: https://weworkremotely.com/remote-jobs/loop-support-customer-support-specialist-proptech-remote-u-s-excluded",
    "url": "https://weworkremotely.com/remote-jobs/loop-support-customer-support-specialist-proptech-remote-u-s-excluded",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 15:51:51 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Customer Support Specialist (PropTech",
    "company": "Loop Support",
    "location": "Remote",
    "description": "Headquarters: San Francisco URL: https://loopsupport.com We’re Loop Support !👋 A dynamic staffing agency that partners with forward-thinking companies committed to providing outstanding customer experiences . Our clients value innovation, efficiency, and meaningful interactions, ensuring that every customer receives personalized and high-quality support. Are you passionate about helping others and delivering top-tier customer service? Do you have experience in property management support and enjoy solving problems in a remote work environment? If so, we want to hear from you! (This role is open to candidates worldwide, with the exception of candidates residing in the United States.) What You’ll Do: As a Customer Support Specialist , you will play a key role in ensuring our clients’ customers receive top-notch support. Your main responsibilities will include: Responding to customer inquiries via phone, email, and chat, delivering fast, friendly, and professional assistance. Troubleshooting product and service issues to find effective solutions. Maintaining detailed and accurate customer interaction records. Managing support tickets, macros, and workflows within Zendesk to ensure efficient and organized customer service. Staying up to date on client products, services, and policies to provide accurate information. Collaborating with teammates and sharing feedback to continuously improve the customer experience. What We’re Looking For: We’re looking for highly motivated individuals with a customer-first attitude and the ability to work independently . The ideal candidate will have: Fluency in English (spoken and written). (Required) Previous customer support experience (phone, email, chat, or similar roles). (Required) Experience in property management, maintenance tech workflows, or supporting PropTech platforms. (Required) Strong Zendesk experience (you should be very comfortable using Zendesk to manage tickets, workflows, and automations). (Required) A strong, stable internet connection and a reliable computer setup. (Required) Familiarity with the multifamily space and end-user challenges is a big plus. A problem-solving mindset with strong attention to detail. A positive, professional attitude and a passion for helping others. The ability to work independently in a distraction-free home office. Why Apply? Fully remote: Work from anywhere. Competitive salary: Paid in USD. Unique opportunities: Work with a forward-thinking company where your expertise makes a real impact on customer experience and business success. Training & Support: Receive onboarding and ongoing training to help you succeed in your role. Next Steps – How to Apply If this sounds like the perfect role for you, we’d love to hear from you! Applying is easy: Click \"Apply Now\" to fill out our application form. You will then be asked to take a sales assessment! If qualified, you’ll be invited to move forward in the interview process. Join us in delivering outstanding customer experiences—apply today! 🚀 To apply: https://weworkremotely.com/remote-jobs/loop-support-customer-support-specialist-proptech-remote-u-s-applicants-excluded",
    "url": "https://weworkremotely.com/remote-jobs/loop-support-customer-support-specialist-proptech-remote-u-s-applicants-excluded",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 15:51:51 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Amazon Account Manager",
    "company": "TPS DR L.L.C.",
    "location": "Remote",
    "description": "Headquarters: TPS DR L.L.C. URL: http://NDA We are looking for a dynamic and results-driven Amazon Account Manager to join our partners (time zone: Europe). What You Will Do: ✔️ Brand & Storefront Management: Create and develop brands, manage storefronts, and enhance brand positioning. ✔️ Account Health & Performance: Monitor and maintain account health, ensuring compliance with key metrics. ✔️ Product Line & Launches: Systematize the product assortment and successfully launch new products. ✔️ Listing Optimization & Audits: Create new product listings, optimize existing ones, and conduct regular audits. ✔️ Sales & Pricing Analysis: Track sales performance, monitor prices, and develop pricing strategies. ✔️ Competitor Research: Analyze competitors and identify opportunities for growth. ✔️ Inventory & Logistics: Oversee warehouse stock levels and ensure timely replenishment. ✔️ Cross-Team Collaboration: Work closely with the design team, SEO copywriters, and Amazon PPC specialists to enhance listing performance. ✔️ Promotions & Discounts: Manage Amazon promotions, coupons, and discounts to maximize sales. ✔️ Financial & Sales Reporting: Handle financial reports, analyze Amazon reports, and solve account-related issues. ✔️ Innovation & Growth Strategies: Research and implement new tools and strategies to drive sales growth. ✔️ Data & Reporting: Maintain structured and detailed reporting documentation. What We Expect From You: ✔️ 3+ years of experience as an Amazon Account Manager. ✔️ Proven expertise in regulated or complex product categories, such as dietary supplements, children’s products, electronics, or cosmetics. ✔️ Hands-on experience with leading Amazon analytics and seller tools, including: Helium10, Keepa, Jungle Scout, AMZ Scout, Seller Assistant App, Sellerboard, Tactical Arbitrage, Zik Analytics, Terapeak, eRank, etc. ✔️ Strong analytical and problem-solving skills. ✔️ Ability to work independently and meet deadlines with a high level of detail orientation. ✔️ Proficiency in Google tools and ability to self-learn and quickly find solutions. ✔️ English proficiency (B2 -C1). Interested? Apply now and join international team. To apply: https://weworkremotely.com/remote-jobs/tps-dr-l-l-c-amazon-account-manager",
    "url": "https://weworkremotely.com/remote-jobs/tps-dr-l-l-c-amazon-account-manager",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 12:15:45 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Operations & Knowledge Manager (Europe)",
    "company": "Patchstack",
    "location": "Remote",
    "description": "Headquarters: Estonia URL: https://patchstack.com Are you an experienced remote operations manager looking for their next gig? Do you get excited by knowledge bases and automated process? Do you love to use AI to 10X your productivity? Are you an effective communicator, especially async? Then you could be our first Operations & Knowledge Manager. Patchstack is a cyber security company helping companies and software developers to identify & patch vulnerabilities in open-source code. We have a strong community focus with our own gamified bug bounty program called Patchstack Alliance. Most importantly, we’re looking for a full-time team member who is an excellent communicator can grow with the rest of the team. This is a remote role but you should be based in Europe. What we do: We provide a SaaS solution to detect and virtually patch plugin vulnerabilities. We run a community-driven bug bounty platform (Patchstack Alliance) to nurture a community of independent security researchers behind the WordPress ecosystem. We maintain an open and free WordPress vulnerability database We provide professional code review and security auditing to WordPress plugins We're looking for a proactive and experienced Operations and Knowledge Manager to help us scale our internal operations and knowledge infrastructure in a distributed, asynchronous environment. You’ll play a key role in shaping how our remote-first team works together—ensuring we have clear processes, effective communication, and easy access to the knowledge and tools we need to move fast and deliver impact. This role sits at the heart of the company, supporting cross-functional collaboration, aligning teams around shared goals, and making sure our knowledge systems and operational practices are scalable, accessible, and human-friendly. What You’ll Do Develop and maintain company-wide knowledge systems including our company handbook and shared resources that keep our distributed team aligned and informed. Work with teams to define and refine processes and SOPs, making it easy for people to do great work, repeatably. Manage our suite of tools, including our knowledge management system, Take a human-centered approach to process design - you don’t just think about the process but the experience of the human working with that process. Use AI to help us build infrastructure fast - we are embedding AI as a practice at the heart of our stack. This is something you should be excited about. Facilitate asynchronous and synchronous planning and collaboration, enabling clear goal-setting, progress tracking, and decision-making. Champion asynchronous-first communication, helping the company stay productive and connected across time zones. Support operational rhythms such as team cadences, planning cycles, retrospectives, and more—making them efficient, valuable, and lightweight. Lead facilitation for team workshops, planning sessions, and cross-functional initiatives. Help us balance structure with flexibility, building just enough process to support outcomes without slowing people down. Requirements All about you Based in Europe, fluent in English, with the ability to work effectively in a fully remote, distributed team. 3+ years experience in operations, knowledge management, or a related role in a remote-first company. Demonstrated experience building and managing company knowledge bases (e.g., Notion, Confluence, GitBook, or similar). Highly skilled in asynchronous communication, planning tools, and platforms like Slack, Loom, Notion, or Jira. Take an AI-first approach, always looking for opportunities to do more and be more effective, while still knowing when to do things manually. Strong facilitation skills—you’re comfortable leading team sessions and helping others align on goals and direction. Excellent written and verbal communication, with a knack for clarity and tone that suits a remote-first environment. Detail-oriented, but you know when “done is better than perfect.” Ability to create flexible, outcome-driven processes that scale with the company. Confident guiding teams through goal-setting processes, both quarterly and long-term. Nice to Have Experience working in or with open-source or community-driven teams. Exposure to OKRs or similar planning frameworks. Familiarity with SOC 2, ISO 27001, or other information security and compliance frameworks. Experience supporting scaling teams through periods of fast growth or organizational change. Benefits What we can offer: €45,000 - €55,000 Highly impactful work No corporate environment Paid training for work-related personal development Paid time off (31 days a year) Full-time telecommuting in a globally distributed team Co-working space membership or WFH equipment for home-office Fitness club or a local gym membership Competitive salary with stock options plan Awesome team members! To apply: https://weworkremotely.com/remote-jobs/patchstack-operations-knowledge-manager-europe",
    "url": "https://weworkremotely.com/remote-jobs/patchstack-operations-knowledge-manager-europe",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 10:38:38 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Staff Software Engineer",
    "company": "BaxEnergy",
    "location": "Remote",
    "description": "Headquarters: Acireale, Italy URL: https://baxenergy.com To support our mission of advancing renewable energy through cutting-edge technology, we’re seeking an experienced Staff Software Engineer to help us build our newest product Farsight®. This role involves defining and overseeing the architecture of renewable energy monitoring systems that interface with OPC (UA, DA) and similar protocols, ensuring seamless data collection, processing, and storage in a cloud-native environment. If you have a strong background in industrial data systems and cloud technologies, we want to hear from you! What You'll Do Design, architect and develop scalable, secure, and high-performance data collection systems for industrial protocols (OPC UA/DA, Modbus, MQTT, etc.) Define system requirements, architecture patterns, and best practices for integrating with cloud environments, especially AWS Lead the selection and implementation of data streaming and messaging platforms (e.g., Kafka) Oversee the design and optimization of time-series data storage using TimescaleDB and PostgreSQL Provide technical leadership and guidance to development teams, ensuring adherence to architectural principles Collaborate with stakeholders to align technical solutions with business needs Evaluate and integrate new tools, frameworks, and technologies to improve system capabilities Ensure the architecture complies with industry standards, data security, and privacy regulations About you Smart and gets things done You have 8+ years of experience in software development and architecture, with at least 5 years focusing on cloud-based industrial data systems You bring expertise in OPC (UA, DA) and are familiar with other industrial communication protocols like Modbus and MQTT You are proficient in data streaming platforms such as Apache Kafka and time-series databases like TimescaleDB. You possess advanced knowledge of PostgreSQL, including query optimization and database scaling You are located in or have a 4-hour overlap with CET (-4 to +4) time zones. You’re eligible to obtain a visa and can travel to Italy within three months of hiring Why Join BaxEnergy? Be part of a team driving innovation in the renewable energy sector through advanced technology Join a remote-first organization that values inclusivity, technical excellence, and work-life balance Enjoy a competitive salary, over 30 days of paid vacation, and comprehensive sick leave Participate in annual retreats with paid travel arrangements to connect with colleagues in person Receive paid hardware and tools to excel in your role To apply: https://weworkremotely.com/remote-jobs/baxenergy-staff-software-engineer-1",
    "url": "https://weworkremotely.com/remote-jobs/baxenergy-staff-software-engineer-1",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 08:32:25 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "aws",
      "cloud",
      "sql"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  },
  {
    "title": "Senior PHP Engineer",
    "company": "MailerLite",
    "location": "Remote",
    "description": "Headquarters: USA URL: https://www.mailerlite.com/company-values We’re the people behind MailerLite , a team of creators dedicated to building outstanding online products and industry-leading email marketing software. We launched MailerSend to provide you with the same experience for transactional emails. After 10+ years of sending huge volumes of emails and experiencing similar challenges you’re facing, we’re now happy to share our solution with you. MailerSend is a cloud-based transactional email service built for developers, but designed so that the entire team, including designers, project managers, and marketing people can use it. We are committed to providing a top-notch solution for transactional communication to our clients worldwide. We understand that behind every successful business is a team of passionate and dedicated individuals. We are looking for a Senior PHP Engineer who will help us implement new features and maintain our growing product, MailerSend. Join us now! 🚀 Why MailerLite? Wondering why we think you’ll love working with us? Here are our favorite 6 reasons! You'll be challenged with interesting tasks Our customers are sending millions of emails per day. Scaling the platform is a challenge that will definitely keep you energized. You'll grow, develop and evolve As part of a team that's always looking for new, innovative ways to offer value for our customers, you'll constantly be experimenting, learning, and trying out new things. You'll take ownership We expect you to take full responsibility and ownership of your tasks. Team leads avoid micromanaging and minimize interruptions so you can stay focused on your assignments. You'll have experts at hand Whenever you’re stuck, your teammates with a wide range of different expertise are ready to help you grow. And they’d love for you to share your knowledge too! You'll pick where you work, every day We embrace the remote culture. Every day you get to choose what environment that makes you most productive. You'll have stability We value a stable workplace! MailerLite has been thriving for over 10 years and our year-over-year growth continues to increase. What you will work on Develop new features and maintain MailerSend to meet evolving product and customer needs Work on a high-load system, handling millions of emails per hour and ensuring performance, scalability, and reliability Optimize and modernize the platform by integrating new technologies while maintaining stability Collaborate with multiple teams to resolve technical challenges and improve overall system performance Balance long-term improvements with daily operational tasks What we expect from you 6+ years of experience with PHP, JavaScript and HTML Experience with at least one of these frameworks: ReactJS or VueJS Working knowledge of Laravel Proficient understanding of code versioning tools, such as Git Ability to write and optimize complex SQL queries Knowledge of Redis and queues Ability to write clean code with test coverage and ability to build scalable applications Self-starter with an investigative mindset for thinking out of the box Proficient verbal and written communication skills in English Familiarity with other languages is a bonus (NodeJS, Golang, Ruby) Based within the EMEA region What we offer Yearly gross salary range: $50,000-$80,000 Remote-first culture with the team working remotely from all over the world International health insurance provided with coverage in most countries. Monthly health care payout available in select countries where coverage is limited Company-paid retreats. Once per year we gather for a week in an exotic location to work, learn and have fun together 31 days of vacation per year. We encourage you to unplug and recharge! 12 paid sick days for your physical and mental well-being, no doctor's note required. Parents can use them to care for their sick children 4 creative days. One paid day off per quarter to do something creative and fun 12 parental days per year. Enjoy one paid day off each month to treasure time with your children Parental leave. Enjoy paid bonding time at 100% of your salary when welcoming a new child into your family through birth or adoption - 3 months of maternity leave and 1 month of paternity leave Parenting budget of $1000. Celebrate the arrival of your little one, whether through childbirth or adoption, with a special gift from us Joy Budget. Joy Budget. Annual allowance to spend on what brings you joy, starting at $1,000 and increasing over time. MacBook and other tools that'll help you to do your job efficiently Team Achievements We're incredibly proud of our team and love celebrating their accomplishments. We believe in recognizing hard work, creativity, and collaboration. Here, we share some of the standout achievements that highlight the passion and talent within our team. Innovative development Successfully launched a new, feature-rich, drag-and-drop builder for creating professional landing pages. Rooted in research Our team leveraged user research and prototyping to design effective onboarding flows for new users, demonstrating our commitment to user-centered design and seamless experiences. Scaling for the future Overhauled our processing pipelines to efficiently handle massive data volumes, ensuring scalability, performance and insights for our users. Seamless integrations Implemented integrations with Wix and Canva, enhancing platform interoperability and expanding third-party ecosystem support. To apply: https://weworkremotely.com/remote-jobs/mailerlite-senior-php-engineer",
    "url": "https://weworkremotely.com/remote-jobs/mailerlite-senior-php-engineer",
    "source": "WeWorkRemotely",
    "posted_at": "Thu, 17 Apr 2025 07:51:41 GMT",
    "salary": "",
    "job_type": "Remote",
    "category": "",
    "tech_stack": [
      "java",
      "javascript",
      "react",
      "cloud",
      "golang",
      "ruby",
      "php",
      "sql",
      "vue"
    ],
    "company_logo": "",
    "scraped_date": "2025-04-21"
  }
]